
[
  {
    "url": "https://api.open5e.com/v2/races/srd_dwarf/",
    "key": "srd_dwarf",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Constitution score increases by 2."
      },
      {
        "name": "Age",
        "desc": "Dwarves mature at the same rate as humans, but they’re considered young until they reach the age of 50. On average, they live about 350 years."
      },
      {
        "name": "Alignment",
        "desc": "Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order."
      },
      {
        "name": "Size",
        "desc": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor."
      },
      {
        "name": "Darkvision",
        "desc": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
      },
      {
        "name": "Dwarven Resilience",
        "desc": "You have advantage on saving throws against poison, and you have resistance against poison damage."
      },
      {
        "name": "Dwarven Combat Training",
        "desc": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
      },
      {
        "name": "Tool Proficiency",
        "desc": "You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools."
      },
      {
        "name": "Stonecunning",
        "desc": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
      }
    ],
    "name": "Dwarf",
    "desc": "Your Dwarf character has an assortment of inborn abilities, part and parcel of dwarven nature.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_hill-dwarf/",
    "key": "srd_hill-dwarf",
    "is_subrace": true,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Wisdom score increases by 1."
      },
      {
        "name": "Dwarven Toughness",
        "desc": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
      }
    ],
    "name": "Hill Dwarf",
    "desc": "As a hill dwarf, you have keen senses, deep intuition, and remarkable resilience.",
    "subrace_of": "https://api.open5e.com/v2/races/srd_dwarf/"
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_elf/",
    "key": "srd_elf",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Dexterity score increases by 2."
      },
      {
        "name": "Age",
        "desc": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old."
      },
      {
        "name": "Alignment",
        "desc": "Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others’ freedom as well as their own, and they are more often good than not."
      },
      {
        "name": "Size",
        "desc": "Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 30 feet."
      },
      {
        "name": "Darkvision",
        "desc": "Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
      },
      {
        "name": "Keen Senses",
        "desc": "You have proficiency in the Perception skill."
      },
      {
        "name": "Fey Ancestry",
        "desc": "You have advantage on saving throws against being charmed, and magic can’t put you to sleep."
      },
      {
        "name": "Trance",
        "desc": "Elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
      }
    ],
    "name": "Elf",
    "desc": "Your Elf character has a variety of natural abilities, the result of thousands of years of elven refinement.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_high-elf/",
    "key": "srd_high-elf",
    "is_subrace": true,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Intelligence score increases by 1."
      },
      {
        "name": "Elf Weapon Training",
        "desc": "You have proficiency with the longsword, shortsword, shortbow, and longbow."
      },
      {
        "name": "Cantrip",
        "desc": "You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it."
      },
      {
        "name": "Extra Language",
        "desc": "You can speak, read, and write one extra language of your choice."
      }
    ],
    "name": "High Elf",
    "desc": "As a high elf, you have a keen mind and a mastery of at least the basics of magic. In many fantasy gaming worlds, there are two kinds of high elves. One type is haughty and reclusive, believing themselves to be superior to non-elves and even other elves. The other type is more common and more friendly, and often encountered among humans and other races.",
    "subrace_of": "https://api.open5e.com/v2/races/srd_elf/"
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_halfling/",
    "key": "srd_halfling",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Dexterity score increases by 2."
      },
      {
        "name": "Age",
        "desc": "A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century."
      },
      {
        "name": "Alignment",
        "desc": "Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways."
      },
      {
        "name": "Size",
        "desc": "Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 25 feet."
      },
      {
        "name": "Lucky",
        "desc": "When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
      },
      {
        "name": "Brave",
        "desc": "You have advantage on saving throws against being frightened."
      },
      {
        "name": "Halfling Nimbleness",
        "desc": "You can move through the space of any creature that is of a size larger than yours."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common and Halfling. The Halfling language isn’t secret, but halflings are loath to share it with others. They write very little, so they don’t have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."
      }
    ],
    "name": "Halfling",
    "desc": "Your Halfling character has a number of traits in common with all other halflings.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_lightfoot/",
    "key": "srd_lightfoot",
    "is_subrace": true,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Charisma score increases by 1."
      },
      {
        "name": "Naturally Stealthy",
        "desc": "You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."
      }
    ],
    "name": "Lightfoot",
    "desc": "As a lightfoot halfling, you can easily hide from notice, even using other people as cover. You’re inclined to be affable and get along well with others. Lightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life.",
    "subrace_of": "https://api.open5e.com/v2/races/srd_halfling/"
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_human/",
    "key": "srd_human",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your ability scores each increase by 1."
      },
      {
        "name": "Age",
        "desc": "Humans reach adulthood in their late teens and live less than a century."
      },
      {
        "name": "Alignment",
        "desc": "Humans tend toward no particular alignment. The best and the worst are found among them."
      },
      {
        "name": "Size",
        "desc": "Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 30 feet."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
      }
    ],
    "name": "Human",
    "desc": "Your Human character has an assortment of inborn abilities.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_dragonborn/",
    "key": "srd_dragonborn",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Strength score increases by 2, and your Charisma score increases by 1."
      },
      {
        "name": "Age",
        "desc": "Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80."
      },
      {
        "name": "Alignment",
        "desc": "Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil. Most dragonborn are good, but those who side with evil can be terrible villains."
      },
      {
        "name": "Size",
        "desc": "Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 30 feet."
      },
      {
        "name": "Draconic Ancestry",
        "desc": "You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.\n\n| Dragon | Damage Type | Breath Weapon |\n|---|---|---|\n| Black | Acid | 5 by 30 ft. line (Dex. save) |\n| Blue | Lightning | 5 by 30 ft. line (Dex. save) |\n| Brass | Fire | 5 by 30 ft. line (Dex. save) |\n| Bronze | Lightning | 5 by 30 ft. line (Dex. save) |\n| Copper | Acid | 5 by 30 ft. line (Dex. save) |\n| Gold | Fire | 15 ft. cone (Dex. save) |\n| Green | Poison | 15 ft. cone (Con. save) |\n| Red | Fire | 15 ft. cone (Dex. save) |\n| Silver | Cold | 15 ft. cone (Con. save) |\n| White | Cold | 15 ft. cone (Con. save) |"
      },
      {
        "name": "Breath Weapon",
        "desc": "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation. When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level. After you use your breath weapon, you can’t use it again until you complete a short or long rest."
      },
      {
        "name": "Damage Resistance",
        "desc": "You have resistance to the damage type associated with your draconic ancestry."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants."
      }
    ],
    "name": "Dragonborn",
    "desc": "Your Dragonborn character has an assortment of inborn abilities.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_gnome/",
    "key": "srd_gnome",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Intelligence score increases by 2."
      },
      {
        "name": "Age",
        "desc": "Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years."
      },
      {
        "name": "Alignment",
        "desc": "Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious."
      },
      {
        "name": "Size",
        "desc": "Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 25 feet."
      },
      {
        "name": "Darkvision",
        "desc": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
      },
      {
        "name": "Gnome Cunning",
        "desc": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world."
      }
    ],
    "name": "Gnome",
    "desc": "Your Gnome character has an assortment of inborn abilities.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_rock-gnome/",
    "key": "srd_rock-gnome",
    "is_subrace": true,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Constitution score increases by 1."
      },
      {
        "name": "Artificers Lore",
        "desc": "Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply."
      },
      {
        "name": "Tinker",
        "desc": "You have proficiency with artisan’s tools (tinker’s tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time. When you create a device, choose one of the following options: Clockwork Toy, Fire Starter, Music Box."
      }
    ],
    "name": "Rock Gnome",
    "desc": "As a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes.",
    "subrace_of": "https://api.open5e.com/v2/races/srd_gnome/"
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_half-elf/",
    "key": "srd_half-elf",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Charisma score increases by 2, and two other ability scores of your choice increase by 1."
      },
      {
        "name": "Age",
        "desc": "Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years."
      },
      {
        "name": "Alignment",
        "desc": "Half-elves share the chaotic bent of their elven heritage. They value both personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others’ demands, and sometimes prove unreliable, or at least unpredictable."
      },
      {
        "name": "Size",
        "desc": "Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 30 feet."
      },
      {
        "name": "Darkvision",
        "desc": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
      },
      {
        "name": "Fey Ancestry",
        "desc": "You have advantage on saving throws against being charmed, and magic can’t put you to sleep."
      },
      {
        "name": "Skill Versatility",
        "desc": "You gain proficiency in two skills of your choice."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common, Elvish, and one extra language of your choice."
      }
    ],
    "name": "Half-Elf",
    "desc": "Your Half-Elf character has an assortment of inborn abilities.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_half-orc/",
    "key": "srd_half-orc",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Strength score increases by 2, and your Constitution score increases by 1."
      },
      {
        "name": "Age",
        "desc": "Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years."
      },
      {
        "name": "Alignment",
        "desc": "Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil."
      },
      {
        "name": "Size",
        "desc": "Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 30 feet."
      },
      {
        "name": "Darkvision",
        "desc": "Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
      },
      {
        "name": "Menacing",
        "desc": "You gain proficiency in the Intimidation skill."
      },
      {
        "name": "Relentless Endurance",
        "desc": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."
      },
      {
        "name": "Savage Attacks",
        "desc": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script."
      }
    ],
    "name": "Half-Orc",
    "desc": "Your Half-Orc character has an assortment of inborn abilities.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/srd_tiefling/",
    "key": "srd_tiefling",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Intelligence score increases by 1, and your Charisma score increases by 2."
      },
      {
        "name": "Age",
        "desc": "Tieflings mature at the same rate as humans but live a few years longer."
      },
      {
        "name": "Alignment",
        "desc": "Tieflings might not have an innate tendency toward evil, but many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment."
      },
      {
        "name": "Size",
        "desc": "Tieflings are about the same size and build as humans. Your size is Medium."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 30 feet."
      },
      {
        "name": "Darkvision",
        "desc": "Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."
      },
      {
        "name": "Hellish Resistance",
        "desc": "You have resistance to fire damage."
      },
      {
        "name": "Infernal Legacy",
        "desc": "You know the thaumaturgy cantrip. When you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the darkness spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common and Infernal."
      }
    ],
    "name": "Tiefling",
    "desc": "Your Tiefling character has an assortment of inborn abilities.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/custom_alseid/",
    "key": "custom_alseid",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/wotc-srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Dexterity score increases by 2, and your Wisdom score increases by 1."
      },
      {
        "name": "Speed",
        "desc": "Alseid are fast for their size, with a base walking speed of 40 feet."
      },
      {
        "name": "Darkvision",
        "desc": "Accustomed to the limited light beneath the forest canopy, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
      },
      {
        "name": "Age",
        "desc": "Alseid reach maturity by the age of 20. They can live well beyond 100 years, but it is unknown just how old they can become."
      },
      {
        "name": "Alignment",
        "desc": "Alseid are generally chaotic, flowing with the unpredictable whims of nature, though variations are common, particularly among those rare few who leave their people."
      },
      {
        "name": "Size",
        "desc": "Alseid stand over 6 feet tall and weigh around 300 pounds. Your size is Medium."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common and Elvish."
      },
      {
        "name": "Alseid Weapon Training",
        "desc": "You have proficiency with spears and shortbows."
      },
      {
        "name": "Light Hooves",
        "desc": "You have proficiency in the Stealth skill."
      },
      {
        "name": "Quadruped",
        "desc": "The mundane details of the structures of humanoids can present considerable obstacles for you. You have to squeeze when moving through trapdoors, manholes, and similar structures even when a Medium humanoid wouldn't have to squeeze. In addition, ladders, stairs, and similar structures are difficult terrain for you."
      },
      {
        "name": "Woodfriend",
        "desc": "When in a forest, you leave no tracks and can automatically discern true north."
      }
    ],
    "name": "Alseid",
    "desc": "Your alseid character has certain characteristics in common with all other alseid.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/custom_catfolk/",
    "key": "custom_catfolk",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/wotc-srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Dexterity score increases by 2."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 30 feet."
      },
      {
        "name": "Darkvision",
        "desc": "You have a cat's keen senses, especially in the dark. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
      },
      {
        "name": "Age",
        "desc": "Catfolk mature at the same rate as humans and can live just past a century."
      },
      {
        "name": "Alignment",
        "desc": "Catfolk tend toward two extremes. Some are free-spirited and chaotic, letting impulse and fancy guide their decisions. Others are devoted to duty and personal honor. Typically, catfolk deem concepts such as good and evil as less important than freedom or their oaths."
      },
      {
        "name": "Size",
        "desc": "Catfolk have a similar stature to humans but are generally leaner and more muscular. Your size is Medium."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Common."
      },
      {
        "name": "Cat's Claws",
        "desc": "Your sharp claws can cut with ease. Your claws are natural melee weapons, which you can use to make unarmed strikes. When you hit with a claw, your claw deals slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
      },
      {
        "name": "Hunter's Senses",
        "desc": "You have proficiency in the Perception and Stealth skills."
      }
    ],
    "name": "Catfolk",
    "desc": "Your catfolk character has the following traits.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/custom_drow/",
    "key": "custom_drow",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/wotc-srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Intelligence score increases by 2."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 30 feet."
      },
      {
        "name": "Superior Darkvision",
        "desc": "Accustomed to life in the darkest depths of the world, you can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
      },
      {
        "name": "Age",
        "desc": "Drow physically mature at the same rate as humans, but they aren't considered adults until they reach the age of 50. They typically live to be around 500."
      },
      {
        "name": "Alignment",
        "desc": "Drow believe in reason and rationality, which leads them to favor lawful activities. However, their current dire situation makes them more prone than their ancestors to chaotic behavior. Their vicious fight for survival makes them capable of doing great evil in the name of self-preservation, although they are not, by nature, prone to evil in other circumstances."
      },
      {
        "name": "Size",
        "desc": "Drow are slightly shorter and slimmer than humans. Your size is Medium."
      },
      {
        "name": "Languages",
        "desc": "You can speak, read, and write Elvish and your choice of Common or Undercommon."
      },
      {
        "name": "Fey Ancestry",
        "desc": "You have advantage on saving throws against being charmed, and magic can't put you to sleep."
      },
      {
        "name": "Mind of Steel",
        "desc": "You understand the complexities of minds, as well as the magic that can affect them. You have advantage on Wisdom, Intelligence, and Charisma saving throws against spells."
      },
      {
        "name": "Sunlight Sensitivity",
        "desc": "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
      }
    ],
    "name": "Drow",
    "desc": "Your drow character has certain characteristics in common with all other drow.",
    "subrace_of": null
  },
  {
    "url": "https://api.open5e.com/v2/races/custom_erina/",
    "key": "custom_erina",
    "is_subrace": false,
    "document": "https://api.open5e.com/v2/documents/wotc-srd/",
    "traits": [
      {
        "name": "Ability Score Increase",
        "desc": "Your Dexterity score increases by 2, and you can choose to increase either your Wisdom or Charisma score by 1."
      },
      {
        "name": "Speed",
        "desc": "Your base walking speed is 25 feet."
      },
      {
        "name": "Darkvision",
        "desc": "Accustomed to life in the dark burrows of your people, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
      },
      {
        "name": "Age",
        "desc": "Erina reach maturity around 15 years and can live up to 60 years, though some erina burrow elders have memories of events which suggest erina can live much longer."
      },
      {
        "name": "Alignment",
        "desc": "Erina are good-hearted and extremely social creatures who have a difficult time adapting to the laws of other species."
      },
      {
        "name": "Size",
        "desc": "Erina average about 3 feet tall and weigh about 50 pounds. Your size is Small."
      },
      {
        "name": "Languages",
        "desc": "You can speak Erina and either Common or Sylvan."
      },
      {
        "name": "Hardy",
        "desc": "The erina diet of snakes and venomous insects has made them hardy. You have advantage on saving throws against poison, and you have resistance against poison damage."
      },
      {
        "name": "Spines",
        "desc": "Erina grow needle-sharp spines in small clusters atop their heads and along their backs. While you are grappling a creature or while a creature is grappling you, the creature takes 1d4 piercing damage at the start of your turn."
      },
      {
        "name": "Keen Senses",
        "desc": "You have proficiency in the Perception skill."
      },
      {
        "name": "Digger",
        "desc": "You have a burrowing speed of 20 feet, but you can use it to move through only earth and sand, not mud, ice, or rock."
      }
    ],
    "name": "Erina",
    "desc": "Your erina character has traits which complement its curiosity, sociability, and fierce nature.",
    "subrace_of": null
  }
]
