
[
    {
        "slug": "abilities",
        "name": "Abilities",
        "desc": "Six abilities provide a quick description of every creature's physical and mental characteristics:\n\n- **Strength**, measuring physical power\n - **Dexterity**, measuring agility\n - **Constitution**, measuring endurance \n - **Intelligence**, measuring reasoning and memory \n - **Wisdom**, measuring perception and insight \n - **Charisma**, measuring force of personality\n\n\nIs a character muscle-bound and insightful? Brilliant and charming? Nimble and hardy? Ability scores define these qualities---a creature's assets as well as weaknesses.\n\nThe three main rolls of the game---the ability check, the saving throw, and the attack roll---rely on the six ability scores. The book's introduction describes the basic rule behind these rolls: roll a d20, add an ability modifier derived from one of the six ability scores, and compare the total to a target number\n\n## Ability Scores and Modifiers\n\n Each of a creature's abilities has a score, a number that defines the magnitude of that ability. An ability score is not just a measure of innate capabilities, but also encompasses a creature's training and competence in activities related to that ability.\n\nA score of 10 or 11 is the normal human average, but adventurers and many monsters are a cut above average in most abilities. A score of 18 is the highest that a person usually reaches. Adventurers can have scores as high as 20, and monsters and divine beings can have scores as high as 30.\n\nEach ability also has a modifier, derived from the score and ranging from -5 (for an ability score of 1) to +10 (for a score of 30). The Ability Scores and Modifiers table notes the ability modifiers for the range of possible ability scores, from 1 to 30.\n\n  To determine an ability modifier without consulting the table, subtract 10 from the ability score and then divide the total by 2 (round down).\n\n Because ability modifiers affect almost every attack roll, ability check, and saving throw, ability modifiers come up in play more often than their associated scores.\n\n## Advantage and Disadvantage\n\nSometimes a special ability or spell tells you that you have advantage or disadvantage on an ability check, a saving throw, or an attack roll.\nWhen that happens, you roll a second d20 when you make the roll. Use the higher of the two rolls if you have advantage, and use the lower roll if you have disadvantage. For example, if you have disadvantage and roll a 17 and a 5, you use the 5. If you instead have advantage and roll those numbers, you use the 17.\n\nIf multiple situations affect a roll and each one grants advantage or imposes disadvantage on it, you don't roll more than one additional d20.\nIf two favorable situations grant advantage, for example, you still roll only one additional d20.\n\nIf circumstances cause a roll to have both advantage and disadvantage, you are considered to have neither of them, and you roll one d20. This is true even if multiple circumstances impose disadvantage and only one grants advantage or vice versa. In such a situation, you have neither advantage nor disadvantage.\n\nWhen you have advantage or disadvantage and something in the game, such as the halfling's Lucky trait, lets you reroll the d20, you can reroll only one of the dice. You choose which one. For example, if a halfling has advantage or disadvantage on an ability check and rolls a 1 and a 13, the halfling could use the Lucky trait to reroll the 1.\n\nYou usually gain advantage or disadvantage through the use of special abilities, actions, or spells. Inspiration can also give a character advantage. The GM can also decide that circumstances influence a roll in one direction or the other and grant advantage or impose disadvantage as a result.\n\n## Proficiency Bonus  \nCharacters have a proficiency bonus determined by level. Monsters also have this bonus, which is incorporated in their stat blocks. The bonus is used in the rules on ability checks, saving throws, and attack rolls.\n\nYour proficiency bonus can't be added to a single die roll or other number more than once. For example, if two different rules say you can add your proficiency bonus to a Wisdom saving throw, you nevertheless add the bonus only once when you make the save.\n\nOccasionally, your proficiency bonus might be multiplied or divided (doubled or halved, for example) before you apply it. For example, the rogue's Expertise feature doubles the proficiency bonus for certain ability checks. If a circumstance suggests that your proficiency bonus applies more than once to the same roll, you still add it only once and multiply or divide it only once.\n\nBy the same token, if a feature or effect allows you to multiply your proficiency bonus when making an ability check that wouldn't normally benefit from your proficiency bonus, you still don't add the bonus to the check. For that check your proficiency bonus is 0, given the fact that multiplying 0 by any number is still 0. For instance, if you lack proficiency in the History skill, you gain no benefit from a feature that lets you double your proficiency bonus when you make Intelligence (History) checks.\n\nIn general, you don't multiply your proficiency bonus for attack rolls or saving throws. If a feature or effect allows you to do so, these same rules apply.\n\n## Ability Checks  \nAn ability check tests a character's or monster's innate talent and training in an effort to overcome a challenge. The GM calls for an ability check when a character or monster attempts an action (other than an attack) that has a chance of failure. When the outcome is uncertain, the dice determine the results.\n\nFor every ability check, the GM decides which of the six abilities is relevant to the task at hand and the difficulty of the task, represented by a Difficulty Class.\n\nThe more difficult a task, the higher its DC. The Typical Difficulty Classes table shows the most common DCs.\n\nTo make an ability check, roll a d20 and add the relevant ability modifier. As with other d20 rolls, apply bonuses and penalties, and compare the total to the DC. If the total equals or exceeds the DC, the ability check is a success---the creature overcomes the challenge at hand. Otherwise, it's a failure, which means the character or monster makes no progress toward the objective or makes progress combined with a setback determined by the GM.\n\n### Contests  \nSometimes one character's or monster's efforts are directly opposed to another's. This can occur when both of them are trying to do the same thing and only one can succeed, such as attempting to snatch up a magic ring that has fallen on the floor. This situation also applies when one of them is trying to prevent the other one from accomplishing a goal---for example, when a monster tries to force open a door that an adventurer is holding closed. In situations like these, the outcome is determined by a special form of ability check, called a contest.\n\nBoth participants in a contest make ability checks appropriate to their efforts. They apply all appropriate bonuses and penalties, but instead of comparing the total to a DC, they compare the totals of their two checks. The participant with the higher check total wins the contest.\nThat character or monster either succeeds at the action or prevents the other one from succeeding.\n\nIf the contest results in a tie, the situation remains the same as it was before the contest. Thus, one contestant might win the contest by default. If two characters tie in a contest to snatch a ring off the floor, neither character grabs it. In a contest between a monster trying to open a door and an adventurer trying to keep the door closed, a tie means that the door remains shut.\n\n### Skills\n\n Each ability covers a broad range of capabilities, including skills that a character or a monster can be proficient in. A skill represents a specific aspect of an ability score, and an individual's proficiency in a skill demonstrates a focus on that aspect. (A character's starting skill proficiencies are determined at character creation, and a monster's skill proficiencies appear in the monster's stat block.)  For example, a Dexterity check might reflect a character's attempt to pull off an acrobatic stunt, to palm an object, or to stay hidden. Each of these aspects of Dexterity has an associated skill: Acrobatics, Sleight of Hand, and Stealth, respectively. So a character who has proficiency in the Stealth skill is particularly good at Dexterity checks related to sneaking and hiding.\n\nThe skills related to each ability score are shown in the following list. (No skills are related to Constitution.) See an ability's description in the later sections of this section for examples of how to use a skill associated with an ability.\n\n**Strength**\n\n- Athletics\n\n**Dexterity**\n- Acrobatics\n- Sleight of Hand\n- Stealth\n\n**Intelligence**\n\n- Arcana\n- History\n- Investigation\n- Nature\n- Religion\n\n**Wisdom**\n\n- Animal Handling\n- Insight\n- Medicine\n- Perception\n- Survival\n\n**Charisma**\n\n- Deception\n- Intimidation\n- Performance\n- Persuasion\n\n\nSometimes, the GM might ask for an ability check using a specific skill---for example, Make a Wisdom (Perception) check. At other times, a player might ask the GM if proficiency in a particular skill applies to a check. In either case, proficiency in a skill means an individual can add his or her proficiency bonus to ability checks that involve that skill. Without proficiency in the skill, the individual makes a normal ability check.\n\nFor example, if a character attempts to climb up a dangerous cliff, the GM might ask for a Strength (Athletics) check. If the character is proficient in Athletics, the character's proficiency bonus is added to the Strength check. If the character lacks that proficiency, he or she just makes a Strength check.\n\n#### Variant: Skills with Different Abilities  \nNormally, your proficiency in a skill applies only to a specific kind of ability check. Proficiency in Athletics, for example, usually applies to Strength checks. In some situations, though, your proficiency might reasonably apply to a different kind of check. In such cases, the GM might ask for a check using an unusual combination of ability and skill, or you might ask your GM if you can apply a proficiency to a different check. For example, if you have to swim from an offshore island to the mainland, your GM might call for a Constitution check to see if you have the stamina to make it that far. In this case, your GM might allow you to apply your proficiency in Athletics and ask for a Constitution (Athletics) check. So if you're proficient in Athletics, you apply your proficiency bonus to the Constitution check just as you would normally do for a Strength (Athletics) check. Similarly, when your half-orc barbarian uses a display of raw strength to intimidate an enemy, your GM might ask for a Strength (Intimidation) check, even though Intimidation is normally associated with Charisma.\n\n### Passive Checks  \nA passive check is a special kind of ability check that doesn't involve any die rolls. Such a check can represent the average result for a task done repeatedly, such as searching for secret doors over and over again, or can be used when the GM wants to secretly determine whether the characters succeed at something without rolling dice, such as noticing a hidden monster.\n\nHere's how to determine a character's total for a passive check:  > 10 + all modifiers that normally apply to the check  If the character has advantage on the check, add 5. For disadvantage, subtract 5. The game refers to a passive check total as a **score**.\n\nFor example, if a 1st-level character has a Wisdom of 15 and proficiency in Perception, he or she has a passive Wisdom (Perception) score of 14.\n\nThe rules on hiding in the Dexterity section below rely on passive checks, as do the exploration rules.\n\n### Working Together  \nSometimes two or more characters team up to attempt a task. The character who's leading the effort---or the one with the highest ability modifier---can make an ability check with advantage, reflecting the help provided by the other characters. In combat, this requires the Help action.\n\nA character can only provide help if the task is one that he or she could attempt alone. For example, trying to open a lock requires proficiency with thieves' tools, so a character who lacks that proficiency can't help another character in that task. Moreover, a character can help only when two or more individuals working together would actually be productive. Some tasks, such as threading a needle, are no easier with help.\n\n#### Group Checks  \nWhen a number of individuals are trying to accomplish something as a group, the GM might ask for a group ability check. In such a situation, the characters who are skilled at a particular task help cover those who aren't.\n\nTo make a group ability check, everyone in the group makes the ability check. If at least half the group succeeds, the whole group succeeds.\nOtherwise, the group fails.\n\nGroup checks don't come up very often, and they're most useful when all the characters succeed or fail as a group. For example, when adventurers are navigating a swamp, the GM might call for a group Wisdom (Survival) check to see if the characters can avoid the quicksand, sinkholes, and other natural hazards of the environment. If at least half the group succeeds, the successful characters are able to guide their companions out of danger. Otherwise, the group stumbles into one of these hazards.\n\nEvery task that a character or monster might attempt in the game is covered by one of the six abilities. This section explains in more detail what those abilities mean and the ways they are used in the game.\n\n### Strength  \nStrength measures bodily power, athletic training, and the extent to which you can exert raw physical force.\n\n#### Strength Checks  \nA Strength check can model any attempt to lift, push, pull, or break something, to force your body through a space, or to otherwise apply brute force to a situation. The Athletics skill reflects aptitude in certain kinds of Strength checks.\n\n##### Athletics  \nYour Strength (Athletics) check covers difficult situations you encounter while climbing, jumping, or swimming. Examples include the following activities:  - You attempt to climb a sheer or slippery cliff, avoid hazards while   scaling a wall, or cling to a surface while something is trying to   knock you off.\n- You try to jump an unusually long distance or pull off a stunt   midjump.\n- You struggle to swim or stay afloat in treacherous currents,   storm-tossed waves, or areas of thick seaweed. Or another creature   tries to push or pull you underwater or otherwise interfere with   your swimming.\n\n##### Other Strength Checks  \nThe GM might also call for a Strength check when you try to accomplish tasks like the following:  - Force open a stuck, locked, or barred door - Break free of bonds - Push through a tunnel that is too small - Hang on to a wagon while being dragged behind it - Tip over a statue - Keep a boulder from rolling\n\n\n#### Attack Rolls and Damage\n\nYou add your Strength modifier to your attack roll and your damage roll when attacking with a melee weapon such as a mace, a battleaxe, or a javelin. You use melee weapons to make melee attacks in hand-to-hand combat, and some of them can be thrown to make a ranged attack.\n\n#### Lifting and Carrying  \nYour Strength score determines the amount of weight you can bear. The following terms define what you can lift or carry.\n\n**Carrying Capacity.** Your carrying capacity is your Strength score multiplied by 15. This is the weight (in pounds) that you can carry, which is high enough that most characters don't usually have to worry about it.\n\n**Push, Drag, or Lift.** You can push, drag, or lift a weight in pounds up to twice your carrying capacity (or 30 times your Strength score).\nWhile pushing or dragging weight in excess of your carrying capacity, your speed drops to 5 feet.\n\n**Size and Strength.** Larger creatures can bear more weight, whereas Tiny creatures can carry less. For each size category above Medium, double the creature's carrying capacity and the amount it can push, drag, or lift. For a Tiny creature, halve these weights.\n\n#### Variant: Encumbrance  \nThe rules for lifting and carrying are intentionally simple. Here is a variant if you are looking for more detailed rules for determining how a character is hindered by the weight of equipment. When you use this variant, ignore the Strength column of the Armor table.\n\nIf you carry weight in excess of 5 times your Strength score, you are **encumbered**, which means your speed drops by 10 feet.\n\nIf you carry weight in excess of 10 times your Strength score, up to your maximum carrying capacity, you are instead **heavily encumbered**, which means your speed drops by 20 feet and you have disadvantage on ability checks, attack rolls, and saving throws that use Strength, Dexterity, or Constitution.\n\n### Dexterity \nDexterity measures agility, reflexes, and balance.\n\n#### Dexterity Checks\n\nA Dexterity check can model any attempt to move nimbly, quickly, or quietly, or to keep from falling on tricky footing. The Acrobatics, Sleight of Hand, and Stealth skills reflect aptitude in certain kinds of Dexterity checks.\n\n##### Acrobatics  \nYour Dexterity (Acrobatics) check covers your attempt to stay on your feet in a tricky situation, such as when you're trying to run across a sheet of ice, balance on a tightrope, or stay upright on a rocking ship's deck. The GM might also call for a Dexterity (Acrobatics) check to see if you can perform acrobatic stunts, including dives, rolls, somersaults, and flips.\n\n##### Sleight of Hand  \nWhenever you attempt an act of legerdemain or manual trickery, such as planting something on someone else or concealing an object on your person, make a Dexterity (Sleight of Hand) check. The GM might also call for a Dexterity (Sleight of Hand) check to determine whether you can lift a coin purse off another person or slip something out of another person's pocket.\n\n##### Stealth  \nMake a Dexterity (Stealth) check when you attempt to conceal yourself from enemies, slink past guards, slip away without being noticed, or sneak up on someone without being seen or heard.\n\n##### Other Dexterity Checks  \nThe GM might call for a Dexterity check when you try to accomplish tasks like the following:  - Control a heavily laden cart on a steep descent - Steer a chariot around a tight turn - Pick a lock - Disable a trap - Securely tie up a prisoner - Wriggle free of bonds - Play a stringed instrument - Craft a small or detailed object  **Hiding**  The GM decides when circumstances are appropriate for hiding. When you try to hide, make a Dexterity (Stealth) check. Until you are discovered or you stop hiding, that check's total is contested by the Wisdom (Perception) check of any creature that actively searches for signs of your presence.\n\nYou can't hide from a creature that can see you clearly, and you give away your position if you make noise, such as shouting a warning or knocking over a vase.\n\nAn invisible creature can always try to hide. Signs of its passage might still be noticed, and it does have to stay quiet.\n\nIn combat, most creatures stay alert for signs of danger all around, so if you come out of hiding and approach a creature, it usually sees you.\nHowever, under certain circumstances, the GM might allow you to stay hidden as you approach a creature that is distracted, allowing you to gain advantage on an attack roll before you are seen.\n\n**Passive Perception.** When you hide, there's a chance someone will notice you even if they aren't searching. To determine whether such a creature notices you, the GM compares your Dexterity (Stealth) check with that creature's passive Wisdom (Perception) score, which equals 10  - the creature's Wisdom modifier, as well as any other bonuses or   penalties. If the creature has advantage, add 5. For disadvantage,   subtract 5. For example, if a 1st-level character (with a proficiency   bonus of +2) has a Wisdom of 15 (a +2 modifier) and proficiency in   Perception, he or she has a passive Wisdom (Perception) of 14.\n\n**What Can You See?** One of the main factors in determining whether you can find a hidden creature or object is how well you can see in an area, which might be **lightly** or **heavily obscured**, as explained in the-environment.\n\n#### Attack Rolls and Damage\n\nYou add your Dexterity modifier to your attack roll and your damage roll when attacking with a ranged weapon, such as a sling or a longbow. You can also add your Dexterity modifier to your attack roll and your damage roll when attacking with a melee weapon that has the finesse property, such as a dagger or a rapier.\n\n#### Armor Class  \nDepending on the armor you wear, you might add some or all of your Dexterity modifier to your Armor Class.\n\n#### Initiative  \nAt the beginning of every combat, you roll initiative by making a Dexterity check. Initiative determines the order of creatures' turns in combat.\n\n### Constitution  \nConstitution measures health, stamina, and vital force.\n\n#### Constitution Checks  \nConstitution checks are uncommon, and no skills apply to Constitution checks, because the endurance this ability represents is largely passive rather than involving a specific effort on the part of a character or monster. A Constitution check can model your attempt to push beyond normal limits, however.\n\nThe GM might call for a Constitution check when you try to accomplish tasks like the following:  - Hold your breath - March or labor for hours without rest - Go without sleep - Survive without food or water - Quaff an entire stein of ale in one go  #### Hit Points  \nYour Constitution modifier contributes to your hit points. Typically, you add your Constitution modifier to each Hit Die you roll for your hit points.\n\nIf your Constitution modifier changes, your hit point maximum changes as well, as though you had the new modifier from 1st level. For example, if you raise your Constitution score when you reach 4th level and your Constitution modifier increases from +1 to +2, you adjust your hit point maximum as though the modifier had always been +2. So you add 3 hit points for your first three levels, and then roll your hit points for 4th level using your new modifier. Or if you're 7th level and some effect lowers your Constitution score so as to reduce your Constitution modifier by 1, your hit point maximum is reduced by 7.\n\n### Intelligence\n\nIntelligence measures mental acuity, accuracy of recall, and the ability to reason.\n\n#### Intelligence Checks  \nAn Intelligence check comes into play when you need to draw on logic, education, memory, or deductive reasoning. The Arcana, History, Investigation, Nature, and Religion skills reflect aptitude in certain kinds of Intelligence checks.\n\n##### Arcana  \nYour Intelligence (Arcana) check measures your ability to recall lore about spells, magic items, eldritch symbols, magical traditions, the planes of existence, and the inhabitants of those planes.\n\n##### History  \nYour Intelligence (History) check measures your ability to recall lore about historical events, legendary people, ancient kingdoms, past disputes, recent wars, and lost civilizations.\n\n##### Investigation\n\nWhen you look around for clues and make deductions based on those clues, you make an Intelligence (Investigation) check. You might deduce the location of a hidden object, discern from the appearance of a wound what kind of weapon dealt it, or determine the weakest point in a tunnel that could cause it to collapse. Poring through ancient scrolls in search of a hidden fragment of knowledge might also call for an Intelligence (Investigation) check.\n\n##### Nature  \nYour Intelligence (Nature) check measures your ability to recall lore about terrain, plants and animals, the weather, and natural cycles.\n\n##### Religion\n\nYour Intelligence (Religion) check  measures your ability to recall lore about deities, rites and prayers, religious hierarchies, holy symbols, and the practices of secret cults.\n\n##### Other Intelligence Checks  \nThe GM might call for an Intelligence check when you try to accomplish tasks like the following:  - Communicate with a creature without using words - Estimate the value of a precious item - Pull together a disguise to pass as a city guard - Forge a document - Recall lore about a craft or trade - Win a game of skill\n\n#### Spellcasting Ability  \nWizards use Intelligence as their spellcasting ability, which helps determine the saving throw DCs of spells they cast.\n\n### Wisdom  \nWisdom reflects how attuned you are to the world around you and represents perceptiveness and intuition.\n\n#### Wisdom Checks  \nA Wisdom check might reflect an effort to read body language, understand someone's feelings, notice things about the environment, or care for an injured person. The Animal Handling, Insight, Medicine, Perception, and Survival skills reflect aptitude in certain kinds of Wisdom checks.\n\n##### Animal Handling  \nWhen there is any question whether you can calm down a domesticated animal, keep a mount from getting spooked, or intuit an animal's intentions, the GM might call for a Wisdom (Animal Handling) check. You also make a Wisdom (Animal Handling) check to control your mount when you attempt a risky maneuver.\n\n##### Insight  \nYour Wisdom (Insight) check decides whether you can determine the true intentions of a creature, such as when searching out a lie or predicting someone's next move. Doing so involves gleaning clues from body language, speech habits, and changes in mannerisms.\n\n##### Medicine  \nA Wisdom (Medicine) check lets you try to stabilize a dying companion or diagnose an illness.\n\n##### Perception  \nYour Wisdom (Perception) check lets you spot, hear, or otherwise detect the presence of something. It measures your general awareness of your surroundings and the keenness of your senses. For example, you might try to hear a conversation through a closed door, eavesdrop under an open window, or hear monsters moving stealthily in the forest. Or you might try to spot things that are obscured or easy to miss, whether they are orcs lying in ambush on a road, thugs hiding in the shadows of an alley, or candlelight under a closed secret door.\n\n##### Survival  \nThe GM might ask you to make a Wisdom (Survival) check to follow tracks, hunt wild game, guide your group through frozen wastelands, identify signs that owlbears live nearby, predict the weather, or avoid quicksand and other natural hazards.\n\n##### Other Wisdom Checks  \nThe GM might call for a Wisdom check when you try to accomplish tasks like the following:  - Get a gut feeling about what course of action to follow - Discern whether a seemingly dead or living creature is undead  #### Spellcasting Ability  \nClerics, druids, and rangers use Wisdom as their spellcasting ability, which helps determine the saving throw DCs of spells they cast.\n\n### Charisma\n\nCharisma measures your ability to interact effectively with others. It includes such factors as confidence and eloquence, and it can represent a charming or commanding personality.\n\n#### Charisma Checks\n\nA Charisma check might arise when you try to influence or entertain others, when you try to make an impression or tell a convincing lie, or when you are navigating a tricky social situation. The Deception, Intimidation, Performance, and Persuasion skills reflect aptitude in certain kinds of Charisma checks.\n\n##### Deception\n\nYour Charisma (Deception) check determines whether you can convincingly hide the truth, either verbally or through your actions. This deception can encompass everything from misleading others through ambiguity to telling outright lies. Typical situations include trying to fast-talk a guard, con a merchant, earn money through gambling, pass yourself off in a disguise, dull someone's suspicions with false assurances, or maintain a straight face while telling a blatant lie.\n\n##### Intimidation  \nWhen you attempt to influence someone through overt threats, hostile actions, and physical violence, the GM might ask you to make a Charisma (Intimidation) check. Examples include trying to pry information out of a prisoner, convincing street thugs to back down from a confrontation, or using the edge of a broken bottle to convince a sneering vizier to reconsider a decision.\n\n##### Performance  \nYour Charisma (Performance) check determines how well you can delight an audience with music, dance, acting, storytelling, or some other form of entertainment.\n\n##### Persuasion  \nWhen you attempt to influence someone or a group of people with tact, social graces, or good nature, the GM might ask you to make a Charisma (Persuasion) check. Typically, you use persuasion when acting in good faith, to foster friendships, make cordial requests, or exhibit proper etiquette. Examples of persuading others include convincing a chamberlain to let your party see the king, negotiating peace between warring tribes, or inspiring a crowd of townsfolk\n\n##### Other Charisma Checks\n\nThe GM might call for a Charisma check when you try to accomplish tasks like the following:\n\n- Find the best person to talk to for news, rumors, and gossip\n- Blend into a crowd to get the sense of key topics of conversation\n\n\n#### Spellcasting Ability\n\nBards, paladins, sorcerers, and warlocks use Charisma as their spellcasting ability, which helps determine the saving throw DCs of spells they cast.",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd",
        "parent": "Gameplay Mechanics"
    },
    {
        "slug": "actions-in-combat",
        "name": "Actions in Combat",
        "desc": "When you take your action on your turn, you can take one of the actions presented here, an action you gained from your class or a special feature, or an action that you improvise. Many monsters have action options of their own in their stat blocks.\n\nWhen you describe an action not detailed elsewhere in the rules, the GM tells you whether that action is possible and what kind of roll you need to make, if any, to determine success or failure.\n\n## Types of Actions\n\n### Attack\n\nThe most common action to take in combat is the Attack action, whether you are swinging a sword, firing an arrow from a bow, or brawling with your fists.\n\nWith this action, you make one melee or ranged attack. See the Making an Attack section for the rules that govern attacks. Certain features, such as the Extra Attack feature of the fighter, allow you to make more than one attack with this action.\n\n### Cast a Spell\n\nSpellcasters such as wizards and clerics, as well as many monsters, have access to spells and can use them to great effect in combat. Each spell has a casting time, which specifies whether the caster must use an action, a reaction, minutes, or even hours to cast the spell. Casting a spell is, therefore, not necessarily an action. Most spells do have a casting time of 1 action, so a spellcaster often uses his or her action in combat to cast such a spell.\n\n### Dash\n\nWhen you take the Dash action, you gain extra movement for the current turn. The increase equals your speed, after applying any modifiers. With a speed of 30 feet, for example, you can move up to 60 feet on your turn if you dash.\n\nAny increase or decrease to your speed changes this additional movement by the same amount. If your speed of 30 feet is reduced to 15 feet, for instance, you can move up to 30 feet this turn if you dash.\n\n### Disengage\n\nIf you take the Disengage action, your movement doesn't provoke opportunity attacks for the rest of the turn.\n\n### Dodge\n\nWhen you take the Dodge action, you focus entirely on avoiding attacks. Until the start of your next turn, any attack roll made against you has disadvantage if you can see the attacker, and you make Dexterity saving throws with advantage. You lose this benefit if you are incapacitated or if your speed drops to 0.\n\n### Help\n\nYou can lend your aid to another creature in the completion of a task.\n\nWhen you take the Help action, the creature you aid gains advantage on the next ability check it makes to perform the task you are helping with, provided that it makes the check before the start of your next turn.\n\nAlternatively, you can aid a friendly creature in attacking a creature within 5 feet of you. You feint, distract the target, or in some other way team up to make your ally's attack more effective. If your ally attacks the target before your next turn, the first attack roll is made with advantage.\n\n### Hide\n\nWhen you take the Hide action, you make a Dexterity (Stealth) check in an attempt to hide, following the rules for hiding. If you succeed, you gain certain benefits, as described in srd:unseen-attackers-and-targets.\n\n### Ready\n\nSometimes you want to get the jump on a foe or wait for a particular circumstance before you act. To do so, you can take the Ready action on your turn, which lets you act using your reaction before the start of your next turn.\n\nFirst, you decide what perceivable circumstance will trigger your reaction. Then, you choose the action you will take in response to that trigger, or you choose to move up to your speed in response to it. Examples include 'If the cultist steps on the trapdoor, I'll pull the lever that opens it,' and 'If the goblin steps next to me, I move away.'\n\nWhen the trigger occurs, you can either take your reaction right after the trigger finishes or ignore the trigger. Remember that you can take only one reaction per round.\n\nWhen you ready a spell, you cast it as normal but hold its energy, which you release with your reaction when the trigger occurs. To be readied, a spell must have a casting time of 1 action, and holding onto the spell's magic requires concentration. If your concentration is broken, the spell dissipates without taking effect. For example, if you are concentrating on the srd:web spell and ready srd:magic-missile, your srd:web spell ends, and if you take damage before you release srd:magic-missile with your reaction, your concentration might be broken.\n\n### Search\n\nWhen you take the Search action, you devote your attention to finding something. Depending on the nature of your search, the GM might have you make a Wisdom (Perception) check or an Intelligence (Investigation) check.\n\n### Use an Object\n\nYou normally interact with an object while doing something else, such as when you draw a sword as part of an attack. When an object requires your action for its use, you take the Use an Object action. This action is also useful when you want to interact with more than one object on your turn.",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd",
        "parent": "Combat"
    },
    {
        "slug": "adventuring-gear",
        "name": "Adventuring Gear",
        "desc": "This section describes items that have special rules or require further explanation.\n\n**_Acid._** As an action, you can splash the contents of this vial onto a creature within 5 feet of you or throw the vial up to 20 feet, shattering it on impact. In either case, make a ranged attack against a creature or object, treating the acid as an improvised weapon. On a hit, the target takes 2d6 acid damage.\n\n**_Alchemist's Fire._** This sticky, adhesive fluid ignites when exposed to air. As an action, you can throw this flask up to 20 feet, shattering it on impact. Make a ranged attack against a creature or object, treating the alchemist's fire as an improvised weapon. On a hit, the target takes 1d4 fire damage at the start of each of its turns. A creature can end this damage by using its action to make a DC 10 Dexterity check to extinguish the flames.\n\n**_Antitoxin._** A creature that drinks this vial of liquid gains advantage on saving throws against poison for 1 hour. It confers no benefit to undead or constructs.\n\n**_Arcane Focus._** An arcane focus is a special item-an orb, a crystal, a rod, a specially constructed staff, a wand-like length of wood, or some similar item- designed to channel the power of arcane spells. A sorcerer, warlock, or wizard can use such an item as a spellcasting focus.\n\n**_Ball Bearings._** As an action, you can spill these tiny metal balls from their pouch to cover a level, square area that is 10 feet on a side. A creature moving across the covered area must succeed on a DC 10 Dexterity saving throw or fall prone. A creature moving through the area at half speed doesn't need to make the save.\n\n**_Block and Tackle._** A set of pulleys with a cable threaded through them and a hook to attach to objects, a block and tackle allows you to hoist up to four times the weight you can normally lift.\n\n**_Book._** A book might contain poetry, historical accounts, information pertaining to a particular field of lore, diagrams and notes on gnomish contraptions, or just about anything else that can be represented using text or pictures. A book of spells is a spellbook (described later in this section).\n\n**_Caltrops._** As an action, you can spread a bag of caltropsto cover a square area that is 5 feet on a side. Any creature that enters the area must succeed on a DC 15 Dexterity saving throw or stop moving this turn and take 1 piercing damage. Taking this damage reduces the creature's walking speed by 10 feet until the creature regains at least 1 hit point. A creature moving through the area at half speed doesn't need to make the save.\n\n**_Candle._** For 1 hour, a candle sheds bright light in a 5-foot radius and dim light for an additional 5 feet.\n\n**_Case, Crossbow Bolt._** This wooden case can hold up to twenty crossbow bolts.\n\n**_Case, Map or Scroll._** This cylindrical leather case can hold up to ten rolled-up sheets of paper or five rolled-up sheets of parchment.\n\n**_Chain._** A chain has 10 hit points. It can be burst with a successful DC 20 Strength check.\n\n**_Climber's Kit._** A climber's kit includes special pitons, boot tips, gloves, and a harness. You can use the climber's kit as an action to anchor yourself; when you do, you can't fall more than 25 feet from the point where you anchored yourself, and you can't climb more than 25 feet away from that point without undoing the anchor.\n\n**_Component Pouch._** A component pouch is a small, watertight leather belt pouch that has compartments to hold all the material components and other special items you need to cast your spells, except for those components that have a specific cost (as indicated in a spell's description).\n\n**_Crowbar._** Using a crowbar grants advantage to Strength checks where the crowbar's leverage can be applied.\n\n**_Druidic Focus._** A druidic focus might be a sprig of mistletoe or holly, a wand or scepter made of yew or another special wood, a staff drawn whole out of a living tree, or a totem object incorporating feathers, fur, bones, and teeth from sacred animals. A druid can use such an object as a spellcasting focus.\n\n**_Fishing Tackle._** This kit includes a wooden rod, silken line, corkwood bobbers, steel hooks, lead sinkers, velvet lures, and narrow netting.\n\n**_Healer's Kit._** This kit is a leather pouch containing bandages, salves, and splints. The kit has ten uses. As an action, you can expend one use of the kit to stabilize a creature that has 0 hit points, without needing to make a Wisdom (Medicine) check.\n\n**_Holy Symbol._** A holy symbol is a representation of a god or pantheon. It might be an amulet depicting a symbol representing a deity, the same symbol carefully engraved or inlaid as an emblem on a shield, or a tiny box holding a fragment of a sacred relic. Appendix PH-B **Fantasy-Historical Pantheons** lists the symbols commonly associated with many gods in the multiverse. A cleric or paladin can use a holy symbol as a spellcasting focus. To use the symbol in this way, the caster must hold it in hand, wear it visibly, or bear it on a shield.\n\n**_Holy Water._** As an action, you can splash the contents of this flask onto a creature within 5 feet of you or throw it up to 20 feet, shattering it on impact. In either case, make a ranged attack against a target creature, treating the holy water as an improvised weapon. If the target is a fiend or undead, it takes 2d6 radiant damage. A cleric or paladin may create holy water by performing a special ritual. The ritual takes 1 hour to perform, uses 25 gp worth of powdered silver, and requires the caster to expend a 1st-level spell slot.\n\n**_Hunting Trap._** When you use your action to set it, this trap forms a saw-toothed steel ring that snaps shut when a creature steps on a pressure plate in the center. The trap is affixed by a heavy chain to an immobile object, such as a tree or a spike driven into the ground. A creature that steps on the plate must succeed on a DC 13 Dexterity saving throw or take 1d4 piercing damage and stop moving. Thereafter, until the creature breaks free of the trap, its movement is limited by the length of the chain (typically 3 feet long). A creature can use its action to make a DC 13 Strength check, freeing itself or another creature within its reach on a success. Each failed check deals 1 piercing damage to the trapped creature.\n\n**_Lamp._** A lamp casts bright light in a 15-foot radius and dim light for an additional 30 feet. Once lit, it burns for 6 hours on a flask (1 pint) of oil.\n\n**_Lantern, Bullseye._** A bullseye lantern casts bright light in a 60-foot cone and dim light for an additional 60 feet. Once lit, it burns for 6 hours on a flask (1 pint) of oil.\n\n**_Lantern, Hooded._** A hooded lantern casts bright light in a 30-foot radius and dim light for an additional 30 feet. Once lit, it burns for 6 hours on a flask (1 pint) of oil. As an action, you can lower the hood, reducing the light to dim light in a 5-foot radius.\n\n**_Lock._** A key is provided with the lock. Without the key, a creature proficient with thieves' tools can pick this lock with a successful DC 15 Dexterity check. Your GM may decide that better locks are available for higher prices.\n\n**_Magnifying Glass._** This lens allows a closer look at small objects. It is also useful as a substitute for flint and steel when starting fires. Lighting a fire with a magnifying glass requires light as bright as sunlight to focus, tinder to ignite, and about 5 minutes for the fire to ignite. A magnifying glass grants advantage on any ability check made to appraise or inspect an item that is small or highly detailed.\n\n**_Manacles._** These metal restraints can bind a Small or Medium creature. Escaping the manacles requires a successful DC 20 Dexterity check. Breaking them requires a successful DC 20 Strength check. Each set of manacles comes with one key. Without the key, a creature proficient with thieves' tools can pick the manacles' lock with a successful DC 15 Dexterity check. Manacles have 15 hit points.\n\n**_Mess Kit._** This tin box contains a cup and simple cutlery. The box clamps together, and one side can be used as a cooking pan and the other as a plate or shallow bowl.\n\n**_Oil._** Oil usually comes in a clay flask that holds 1 pint. As an action, you can splash the oil in this flask onto a creature within 5 feet of you or throw it up to 20 feet, shattering it on impact. Make a ranged attack against a target creature or object, treating the oil as an improvised weapon. On a hit, the target is covered in oil. If the target takes any fire damage before the oil dries (after 1 minute), the target takes an additional 5 fire damage from the burning oil. You can also pour a flask of oil on the ground to cover a 5-foot-square area, provided that the surface is level. If lit, the oil burns for 2 rounds and deals 5 fire damage to any creature that enters the area or ends its turn in the area. A creature can take this damage only once per turn.\n\n**_Poison, Basic._** You can use the poison in this vial to coat one slashing or piercing weapon or up to three pieces of ammunition. Applying the poison takes an action. A creature hit by the poisoned weapon or ammunition must make a DC 10 Constitution saving throw or take 1d4 poison damage. Once applied, the poison retains potency for 1 minute before drying.\n\n**_Potion of Healing._** A character who drinks the magical red fluid in this vial regains 2d4 + 2 hit points. Drinking or administering a potion takes an action.\n\n**_Pouch._** A cloth or leather pouch can hold up to 20 sling bullets or 50 blowgun needles, among other things. A compartmentalized pouch for holding spell components is called a component pouch (described earlier in this section).\n\n**_Quiver._** A quiver can hold up to 20 arrows.\n\n**_Ram, Portable._** You can use a portable ram to break down doors. When doing so, you gain a +4 bonus on the Strength check. One other character can help you use the ram, giving you advantage on this check.\n\n**_Rations._** Rations consist of dry foods suitable for extended travel, including jerky, dried fruit, hardtack, and nuts.\n\n**_Rope._** Rope, whether made of hemp or silk, has 2 hit points and can be burst with a DC 17 Strength check.\n\n**_Scale, Merchant's._** A scale includes a small balance, pans, and a suitable assortment of weights up to 2 pounds. With it, you can measure the exact weight of small objects, such as raw precious metals or trade goods, to help determine their worth.\n\n**_Spellbook._** Essential for wizards, a spellbook is a leather-bound tome with 100 blank vellum pages suitable for recording spells.\n\n**_Spyglass._** Objects viewed through a spyglass are magnified to twice their size.\n\n**_Tent._** A simple and portable canvas shelter, a tent sleeps two.\n\n**_Tinderbox._** This small container holds flint, fire steel, and tinder (usually dry cloth soaked in light oil) used to kindle a fire. Using it to light a torch—or anything else with abundant, exposed fuel—takes an action. Lighting any other fire takes 1 minute.\n\n**_Torch._** A torch burns for 1 hour, providing bright light in a 20-foot radius and dim light for an additional 20 feet. If you make a melee attack with a burning torch and hit, it deals 1 fire damage.\n\n### Adventuring Gear\n\n|**Item**| **Cost**| **Weight**|\n|---|---|---|\n|Abacus|2 gp|2 lb.|\n|Acid (vial)|25 gp|1 lb.|\n|Alchemist's fire (flask)|50 gp|1 lb.|\n|**Ammunition**| | |\n|&emsp;&emsp;Arrows (20) |1 gp|1 lb.|\n|&emsp;&emsp;Blowgun needles (50)|1 gp|1 lb.|\n|&emsp;&emsp;Crossbow bolts (20)|1 gp|1 1/2 lb.|\n|&emsp;&emsp;Sling bullets (20)|4 cp|1 1/2 lb.|\n|Antitoxin (vial)|50 gp|-|\n| **Arcane focus** | | |\n|&emsp;&emsp;Crystal|10 gp|1 lb.|\n|&emsp;&emsp;Orb|20 gp|3 lb.|\n|&emsp;&emsp;Rod|10 gp|2 lb.|\n|&emsp;&emsp;Staff|5 gp|4 lb.|\n|&emsp;&emsp;Wand|10 gp|1 lb.|\n|Backpack|2 gp|5 lb.|\n|Ball bearings (bag of 1,000)|1 gp|2 lb.|\n|Barrel|2 gp|70 lb.|\n|Bedroll|1 gp|7 lb.|\n|Bell|1 gp|-|\n|Blanket|5 sp|3 lb.|\n|Block and tackle|1 gp|5 lb.|\n|Book|25 gp| 5 lb. |\n|Bottle, glass|2 gp|2 lb.|\n|Bucket|5 cp| 2 lb. |\n| Caltrops (bag of 20) | 1 gp | 2 lb. |\n|Candle|1 cp|-|\n| Case, crossbow bolt|1 gp|1 lb.|\n|Case, map or scroll|1 gp|1 lb.|\n|Chain (10 feet)|5 gp|10 lb.|\n|Chalk (1 piece)| 1 cp | - |\n| Chest|5 gp|25 lb.|\n|Climber's kit|25 gp|12 lb.|\n|Clothes, common|5 sp|3 lb.|\n|Clothes, costume|5 gp|4 lb.|\n|Clothes, fine | 15 gp | 6 lb. |\n| Clothes, traveler's | 2 gp|4 lb. |\n| Components pouch|25 gp|2 lb.|\n|Crowbar|2 gp|5 lb.|\n|**Druidic Focus**| | |\n|&emsp;&emsp;Sprig of mistletoe|1 gp|-|\n|&emsp;&emsp;Totem|1 gp|-|\n|&emsp;&emsp;Wooden staff|5 gp|4 lb.|\n|&emsp;&emsp;Yew wand|10 gp|1 lb.|\n|Fishing table|1 gp|4 lb.|\n|Flask or tankard|2 cp|1 lb.|\n|Grappling hook|2 gp|4 lb.|\n|Hammer|1 gp|3 lb.|\n|Hammer, sledge|2 gp|10 lb.|\n|Healer's kit|5 gp|3 lb.|\n|**Holy Symbol**| | |\n|&emsp;&emsp;Amulet| 5 gp|1 lb.|\n|&emsp;&emsp;Emblem|5 gp|-|\n|&emsp;&emsp;Reliquary|5 gp|-|\n|Holy water (flask)|25 gp|1 lb.|\n|Hourglass|25 gp|1 lb.|\n|Hunting trap|5 gp|25 lb.|\n|Ink  (1 ounce bottle)|10 gp|-|\n|Ink pen|2 cp|-|\n|Jug or pitcher|2 cp|4 lb.|\n|Ladder (10-foot)|1 sp|25 lb.|\n|Lamp|5 sp|1 lb.|\n|Lantern, bullseye|10 gp|1 lb.|\n|Lantern, hooded|5 gp|2 lb.|\n|Lock|10 gp|1 lb.|\n|Magnifying glass|100 gp|-|\n|Manacles|2 gp|6 lb.|\n|Mess kit|2 sp|1 lb.|\n|Mirror, steel|5 gp|1/2 lb.|\n|Oil (flask)|1 sp|1 lb.|\n|Paper (one sheet)|2 sp|-|\n|Parchment (one sheet)|1 sp|-|\n|Perfume (vial)|5 gp|-|\n|Pick, miner's|2 gp| 10 lb.|\n|Piton|5 cp|1/4 lb.|\n|Poison, basic (vial)|100 gp|-|\n|Pole (10-foot)|5 cp|7 lb.|\n|Quiver|1 gp|1 lb.|\n|Ram, portable|4 gp|35 lb.|\n|Rations (1 day)|5 sp|2 lb.|\n|Robes|1 gp|4 lb.|\n|Rope, hempen (50 feet)|1 gp|10 lb.|\n|Rope, silk (50 feet)|10 gp|5 lb.|\n|Sack|1 cp|1/2 lb.|\n|Scales, merchant's|5 gp|3 lb.|\n|Sealing wax|5 sp|-|\n|Shovel|2 gp|5 lb.|\n|Signal whistle|5 cp|-|\n|Signet ring|5 gp|-|\n|Soap|2 cp|-|\n|Spellbook|50 gp|3 lb.|\n|Spikes, iron (10)|1 gp|5 lb.|\n|Spyglass|1000 gp|1 lb.|\n|Tent, two-person|2 gp|20 lb.|\n|Tinderbox|5 sp|1 lb.|\n|Torch|1 cp|1 lb.|\n|Vial|1 gp|-|\n|Waterskin|2 sp|5 lb. (full)|\n|Whetstone|1 cp|1 lb.|\n\n### Container Capacity\n\n|**Container**|**Capacity**|\n|---|---|\n|Backpack&ast;|1 cubic foot/30 pounds of gear|\n|Barrel|40 gallons liquid, 4 cubic feet solid|\n|Basket|2 cubic feet/40 pounds of gear|\n|Bottle|1 1/2 pints liquid|\n|Bucket|3 gallons liquid, 1/2 cubic foot solid|\n|Chest|12 cubic feet/300 pounds of gear|\n|Flask or tankard|1 pint liquid|\n|Jug or pitcher|1 gallon liquid|\n|Pot, iron|1 gallon liquid|\n|Pouch|1/5 cubic foot/6 pounds of gear|\n|Sack|1 cubic foot/30 pounds of gear|\n|Vial|4 ounces liquid|\n|Waterskin|4 pints liquid|\n\n&ast;You can also strap items, such as a bedroll or a coil of rope, to the outside of a backpack.",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd",
        "parent": "Equipment"
    },
    {
        "slug": "alignment",
        "name": "Alignment",
        "desc": "A typical creature in the game world has an alignment, which broadly describes its moral and personal attitudes. Alignment is a combination of two factors: one identifies morality (good, evil, or neutral), and the other describes attitudes toward society and order (lawful, chaotic, or neutral). Thus, nine distinct alignments define the possible combinations.\n\nThese brief summaries of the nine alignments describe the typical behavior of a creature with that alignment. Individuals might vary significantly from that typical behavior, and few people are perfectly and consistently faithful to the precepts of their alignment.\n\n**Lawful good** (LG) creatures can be counted on to do the right thing as expected by society. Gold dragons, paladins, and most dwarves are lawful good.\n\n**Neutral good** (NG) folk do the best they can to help others according to their needs. Many celestials, some cloud giants, and most gnomes are neutral good.\n\n**Chaotic good** (CG) creatures act as their conscience directs, with little regard for what others expect. Copper dragons, many elves, and unicorns are chaotic good.\n\n**Lawful neutral** (LN) individuals act in accordance with law, tradition, or personal codes. Many monks and some wizards are lawful neutral.\n\n**Neutral** (N) is the alignment of those who prefer to steer clear of moral questions and don't take sides, doing what seems best at the time. Lizardfolk, most druids, and many humans are neutral.\n\n**Chaotic neutral** (CN) creatures follow their whims, holding their personal freedom above all else. Many barbarians and rogues, and some bards, are chaotic neutral.\n\n**Lawful evil** (LE) creatures methodically take what they want, within the limits of a code of tradition, loyalty, or order. Devils, blue dragons, and hobgoblins are lawful evil.\n\n**Neutral evil** (NE) is the alignment of those who do whatever they can get away with, without compassion or qualms. Many drow, some cloud giants, and goblins are neutral evil.\n\n**Chaotic evil** (CE) creatures act with arbitrary violence, spurred by their greed, hatred, or bloodlust. Demons, red dragons, and orcs are chaotic evil.\n\n## Alignment in the Multiverse\n\nFor many thinking creatures, alignment is a moral choice. Humans, dwarves, elves, and other humanoid races can choose whether to follow the paths of good or evil, law or chaos. According to myth, the good- aligned gods who created these races gave them free will to choose their moral paths, knowing that good without free will is slavery.\n\nThe evil deities who created other races, though, made those races to serve them. Those races have strong inborn tendencies that match the nature of their gods. Most orcs share the violent, savage nature of the orc gods, and are thus inclined toward evil. Even if an orc chooses a good alignment, it struggles against its innate tendencies for its entire life. (Even half-orcs feel the lingering pull of the orc god's influence.)\n\nAlignment is an essential part of the nature of celestials and fiends. A devil does not choose to be lawful evil, and it doesn't tend toward lawful evil, but rather it is lawful evil in its essence. If it somehow ceased to be lawful evil, it would cease to be a devil.\n\nMost creatures that lack the capacity for rational thought do not have alignments-they are **unaligned**. Such a creature is incapable of making a moral or ethical choice and acts according to its bestial nature. Sharks are savage predators, for example, but they are not evil; they have no alignment.",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd",
        "parent": "Characters"
    },
    {
        "slug": "armor",
        "name": "Armor",
        "desc": "Fantasy gaming worlds are a vast tapestry made up of many different cultures, each with its own technology level. For this reason, adventurers have access to a variety of armor types, ranging from leather armor to chain mail to costly plate armor, with several other kinds of armor in between. The Armor table collects the most commonly available types of armor found in the game and separates them into three categories: light armor, medium armor, and heavy armor. Many warriors supplement their armor with a shield.\n\nThe Armor table shows the cost, weight, and other properties of the common types of armor worn in fantasy gaming worlds.\n\n**_Armor Proficiency._** Anyone can put on a suit of armor or strap a shield to an arm. Only those proficient in the armor's use know how to wear it effectively, however. Your class gives you proficiency with certain types of armor. If you wear armor that you lack proficiency with, you have disadvantage on any ability check, saving throw, or attack roll that involves Strength or Dexterity, and you can't cast spells.\n\n**_Armor Class (AC)._** Armor protects its wearer from attacks. The armor (and shield) you wear determines your base Armor Class.\n\n**_Heavy Armor._** Heavier armor interferes with the wearer's ability to move quickly, stealthily, and freely. If the Armor table shows “Str 13” or “Str 15” in the Strength column for an armor type, the armor reduces the wearer's speed by 10 feet unless the wearer has a Strength score equal to or higher than the listed score.\n\n**_Stealth._** If the Armor table shows “Disadvantage” in the Stealth column, the wearer has disadvantage on Dexterity (Stealth) checks.\n\n**_Shields._** A shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.\n\n## Light Armor\n\nMade from supple and thin materials, light armor favors agile adventurers since it offers some protection without sacrificing mobility. If you wear light armor, you add your Dexterity modifier to the base number from your armor type to determine your Armor Class.\n\n**_Padded._** Padded armor consists of quilted layers of cloth and batting.\n\n**_Leather._** The breastplate and shoulder protectors of this armor are made of leather that has been stiffened by being boiled in oil. The rest of the armor is made of softer and more flexible materials.\n\n**_Studded Leather._** Made from tough but flexible leather, studded leather is reinforced with close-set rivets or spikes.\n\n## Medium Armor\n\nMedium armor offers more protection than light armor, but it also impairs movement more. If you wear medium armor, you add your Dexterity modifier, to a maximum of +2, to the base number from your armor type to determine your Armor Class.\n\n**_Hide._** This crude armor consists of thick furs and pelts. It is commonly worn by barbarian tribes, evil humanoids, and other folk who lack access to the tools and materials needed to create better armor.\n\n**_Chain Shirt._** Made of interlocking metal rings, a chain shirt is worn between layers of clothing or leather. This armor offers modest protection to the wearer's upper body and allows the sound of the rings rubbing against one another to be muffled by outer layers.\n\n**_Scale Mail._** This armor consists of a coat and leggings (and perhaps a separate skirt) of leather covered with overlapping pieces of metal, much like the scales of a fish. The suit includes gauntlets.\n\n**_Breastplate._** This armor consists of a fitted metal chest piece worn with supple leather. Although it leaves the legs and arms relatively unprotected, this armor provides good protection for the wearer's vital organs while leaving the wearer relatively unencumbered.\n\n**_Half Plate._** Half plate consists of shaped metal plates that cover most of the wearer's body. It does not include leg protection beyond simple greaves that are attached with leather straps.\n\n## Heavy Armor\n\nOf all the armor categories, heavy armor offers the best protection. These suits of armor cover the entire body and are designed to stop a wide range of attacks. Only proficient warriors can manage their weight and bulk.\n\nHeavy armor doesn't let you add your Dexterity modifier to your Armor Class, but it also doesn't penalize you if your Dexterity modifier is negative.\n\n**_Ring Mail._** This armor is leather armor with heavy rings sewn into it. The rings help reinforce the armor against blows from swords and axes. Ring mail is inferior to chain mail, and it's usually worn only by those who can't afford better armor.\n\n**_Chain Mail._** Made of interlocking metal rings, chain mail includes a layer of quilted fabric worn underneath the mail to prevent chafing and to cushion the impact of blows. The suit includes gauntlets.\n\n**_Splint._** This armor is made of narrow vertical strips of metal riveted to a backing of leather that is worn over cloth padding. Flexible chain mail protects the joints.\n\n**_Plate._** Plate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body.\n\n**Armor (table)**\n\n| Armor              | Cost     | Armor Class (AC)          | Strength | Stealth      | Weight |\n|--------------------|----------|---------------------------|----------|--------------|--------|\n| **_Light Armor_**  |          |                           |          |              |        |\n| Padded             | 5 gp     | 11 + Dex modifier         | -        | Disadvantage | 8 lb.  |\n| Leather            | 10 gp    | 11 + Dex modifier         | -        | -            | 10 lb. |\n| Studded leather    | 45 gp    | 12 + Dex modifier         | -        | -            | 13 lb. |\n| **_Medium Armor_** |          |                           |          |              |        |\n| Hide               | 10 gp    | 12 + Dex modifier (max 2) | -        | -            | 12 lb. |\n| Chain shirt        | 50 gp    | 13 + Dex modifier (max 2) | -        | -            | 20 lb. |\n| Scale mail         | 50 gp    | 14 + Dex modifier (max 2) | -        | Disadvantage | 45 lb. |\n| Breastplate        | 400 gp   | 14 + Dex modifier (max 2) | -        | -            | 20 lb. |\n| Half plate         | 750 gp   | 15 + Dex modifier (max 2) | -        | Disadvantage | 40 lb. |\n| **_Heavy Armor_**  |          |                           |          |              |        |\n| Ring mail          | 30 gp    | 14                        | -        | Disadvantage | 40 lb. |\n| Chain mail         | 75 gp    | 16                        | Str 13   | Disadvantage | 55 lb. |\n| Splint             | 200 gp   | 17                        | Str 15   | Disadvantage | 60 lb. |\n| Plate              | 1,500 gp | 18                        | Str 15   | Disadvantage | 65 lb. |\n| **_Shield_**       |          |                           |          |              |        |\n| Shield             | 10 gp    | +2                        | -        | -            | 6 lb.  |\n\n## Getting Into and Out of Armor\n\nThe time it takes to don or doff armor depends on the armor's category.\n\n**_Don._** This is the time it takes to put on armor. You benefit from the armor's AC only if you take the full time to don the suit of armor.\n\n**_Doff._** This is the time it takes to take off armor. If you have help, reduce this time by half.\n\n**Donning and Doffing Armor (table)**\n\n| Category     | Don        | Doff      |\n|--------------|------------|-----------|\n| Light Armor  | 1 minute   | 1 minute  |\n| Medium Armor | 5 minutes  | 1 minute  |\n| Heavy Armor  | 10 minutes | 5 minutes |\n| Shield       | 1 action   | 1 action  |",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd",
        "parent": "Equipment"
    },
    {
        "slug": "backgrounds",
        "name": "Backgrounds",
        "desc": "Every story has a beginning. Your character's background reveals where you came from, how you became an adventurer, and your place in the world. Your fighter might have been a courageous knight or a grizzled soldier. Your wizard could have been a sage or an artisan. Your rogue might have gotten by as a guild thief or commanded audiences as a jester.\n\nChoosing a background provides you with important story cues about your character's identity. The most important question to ask about your background is *what changed*? Why did you stop doing whatever your background describes and start adventuring? Where did you get the money to purchase your starting gear, or, if you come from a wealthy background, why don't you have *more* money? How did you learn the skills of your class? What sets you apart from ordinary people who share your background?\n\nThe sample backgrounds in this chapter provide both concrete benefits (features, proficiencies, and languages) and roleplaying suggestions.\n\n## Proficiencies\n\nEach background gives a character proficiency in two skills (described in “Using Ability Scores”).\n\nIn addition, most backgrounds give a character proficiency with one or more tools (detailed in “Equipment”).\n\nIf a character would gain the same proficiency from two different sources, he or she can choose a different proficiency of the same kind (skill or tool) instead.\n\n## Languages\n\nSome backgrounds also allow characters to learn additional languages beyond those given by race. See “Languages.”\n\n## Equipment\n\nEach background provides a package of starting equipment. If you use the optional rule to spend coin on gear, you do not receive the starting equipment from your background.\n\n## Suggested Characteristics\n\nA background contains suggested personal characteristics based on your background. You can pick characteristics, roll dice to determine them randomly, or use the suggestions as inspiration for characteristics of your own creation.\n\n## Customizing a Background\n\nYou might want to tweak some of the features of a background so it better fits your character or the campaign setting. To customize a background, you can replace one feature with any other one, choose any two skills, and choose a total of two tool proficiencies or languages from the sample backgrounds. You can either use the equipment package from your background or spend coin on gear as described in the equipment section. (If you spend coin, you can't also take the equipment package suggested for your class.) Finally, choose two personality traits, one ideal, one bond, and one flaw. If you can't find a feature that matches your desired background, work with your GM to create one.",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd",
        "parent": "Characters"
    },
    {
        "slug": "between-adventures",
        "name": "Between Adventures",
        "desc": "Between trips to dungeons and battles against ancient evils, adventurers need time to rest, recuperate, and prepare for their next adventure.\n\n Many adventurers also use this time to perform other tasks, such as crafting arms and armor, performing research, or spending their hard-earned gold.\n\n In some cases, the passage of time is something that occurs with little fanfare or description. When starting a new adventure, the GM might simply declare that a certain amount of time has passed and allow you to describe in general terms what your character has been doing. At other times, the GM might want to keep track of just how much time is passing as events beyond your perception stay in motion.\n\n## Lifestyle Expenses\n\nBetween adventures, you choose a particular quality of life and pay the cost of maintaining that lifestyle.\n\nLiving a particular lifestyle doesn't have a huge effect on your character, but your lifestyle can affect the way other individuals and groups react to you. For example, when you lead an aristocratic lifestyle, it might be easier for you to influence the nobles of the city than if you live in poverty.\n\n## Downtime Activities \n\nBetween adventures, the GM might ask you what your character is doing during his or her downtime. Periods of downtime can vary in duration, but each downtime activity requires a certain number of days to complete before you gain any benefit, and at least 8 hours of each day must be spent on the downtime activity for the day to count. The days do not need to be consecutive. If you have more than the minimum amount of days to spend, you can keep doing the same thing for a longer period of time, or switch to a new downtime activity.\n\n Downtime activities other than the ones presented below are possible. If you want your character to spend his or her downtime performing an activity not covered here, discuss it with your GM.\n\n### Crafting \n\nYou can craft nonmagical objects, including adventuring equipment and works of art. You must be proficient with tools related to the object you are trying to create (typically artisan's tools). You might also need access to special materials or locations necessary to create it.\n\nFor example, someone proficient with smith's tools needs a forge in order to craft a sword or suit of armor.\n\nFor every day of downtime you spend crafting, you can craft one or more items with a total market value not exceeding 5 gp, and you must expend raw materials worth half the total market value. If something you want to craft has a market value greater than 5 gp, you make progress every day in 5- gp increments until you reach the market value of the item.\n\nFor example, a suit of plate armor (market value 1,500 gp) takes 300 days to craft by yourself.\n\n Multiple characters can combine their efforts toward the crafting of a single item, provided that the characters all have proficiency with the requisite tools and are working together in the same place. Each character contributes 5 gp worth of effort for every day spent helping to craft the item. For example, three characters with the requisite tool proficiency and the proper facilities can craft a suit of plate armor in 100 days, at a total cost of 750 gp.\n\n While crafting, you can maintain a modest lifestyle without having to pay 1 gp per day, or a comfortable lifestyle at half the normal cost.\n\n### Practicing a Profession\n\nYou can work between adventures, allowing you to maintain a modest lifestyle without having to pay 1 gp per day. This benefit lasts as long you continue to practice your profession.\n\nIf you are a member of an organization that can provide gainful employment, such as a temple or a thieves' guild, you earn enough to support a comfortable lifestyle instead.\n\nIf you have proficiency in the Performance skill and put your performance skill to use during your downtime, you earn enough to support a wealthy lifestyle instead.\n\n### Recuperating  \nYou can use downtime between adventures to recover from a debilitating injury, disease, or poison.\n\nAfter three days of downtime spent recuperating, you can make a DC 15 Constitution saving throw. On a successful save, you can choose one of the following results:\n\n- End one effect on you that prevents you from regaining hit points.\n- For the next 24 hours, gain advantage on saving throws against one disease or poison currently affecting you.\n\n\n### Researching\n\nThe time between adventures is a great chance to perform research, gaining insight into mysteries that have unfurled over the course of the campaign. Research can include poring over dusty tomes and crumbling scrolls in a library or buying drinks for the locals to pry rumors and gossip from their lips.\n\nWhen you begin your research, the GM determines whether the information is available, how many days of downtime it will take to find it, and whether there are any restrictions on your research (such as needing to seek out a specific individual, tome, or location). The GM might also require you to make one or more ability checks, such as an Intelligence (Investigation) check to find clues pointing toward the information you seek, or a Charisma (Persuasion) check to secure someone's aid. Once those conditions are met, you learn the information if it is available.\n\nFor each day of research, you must spend 1 gp to cover your expenses.\n\nThis cost is in addition to your normal lifestyle expenses.\n\n### Training\n\nYou can spend time between adventures learning a new language or training with a set of tools. Your GM might allow additional training options.\n\nFirst, you must find an instructor willing to teach you. The GM determines how long it takes, and whether one or more ability checks are required.\n\nThe training lasts for 250 days and costs 1 gp per day. After you spend the requisite amount of time and money, you learn the new language or gain proficiency with the new tool.",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd",
        "parent": "Gameplay Mechanics"
    },
    {
        "slug": "coins",
        "name": "Coins",
        "desc": "Common coins come in several different denominations based on the relative worth of the metal from which they are made. The three most common coins are the gold piece (gp), the silver piece (sp), and the copper piece (cp).\n\nWith one gold piece, a character can buy a bedroll, 50 feet of good rope, or a goat. A skilled (but not exceptional) artisan can earn one gold piece a day. The old piece is the standard unit of measure for wealth, even if the coin itself is not commonly used. When merchants discuss deals that involve goods or services worth hundreds or thousands of gold pieces, the transactions don't usually involve the exchange of individual coins. Rather, the gold piece is a standard measure of value, and the actual exchange is in gold bars, letters of credit, or valuable goods.\n\nOne gold piece is worth ten silver pieces, the most prevalent coin among commoners. A silver piece buys a laborer's work for half a day, a flask of lamp oil, or a night's rest in a poor inn.\n\nOne silver piece is worth ten copper pieces, which are common among laborers and beggars. A single copper piece buys a candle, a torch, or a piece of chalk.\n\nIn addition, unusual coins made of other precious metals sometimes appear in treasure hoards. The electrum piece (ep) and the platinum piece (pp) originate from fallen empires and lost kingdoms, and they sometimes arouse suspicion and skepticism when used in everyday transactions. An electrum piece is worth five silver pieces, and a platinum piece is worth ten gold pieces.\n\nA standard coin weighs about a third of an ounce, so fifty coins weigh a pound.\n\n**Standard Exchange Rates**\n\n| Coin | CP | SP | EP | GP | PP |\n|:---:|:---:|:---:|:---:|:---:|:---:|\n| Copper (cp) | 1 | 1/10 | 1/50 | 1/100 | 1/1,000 |\n| Silver (sp) | 10 | 1 | 1/5 | 1/10 | 1/100 |\n| Electrum (ep) | 50 | 5 | 1 | 1/2 | 1/20 |\n| Gold (gp) | 100 | 10 | 2 | 1 | 1/10 |\n| Platinum (pp) | 1,000 | 100 | 20 | 10 | 1 |",
        "document__slug": "wotc-srd",
        "document__title": "5e Core Rules",
        "document__license_url": "http://open5e.com/legal",
        "document__url": "http://dnd.wizards.com/articles/features/systems-reference-document-srd",
        "parent": "Equipment"
    }
]
