
[
  {
    "name": "Barbarian",
    "slug": "barbarian",
    "hit_die": 12,
    "prof_saving_throws": "STR, CON",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 2,
        "from": [
          "Animal Handling",
          "Athletics",
          "Intimidation",
          "Nature",
          "Perception",
          "Survival"
        ]
      }
    ],
    "prof_armor": "Light armor, medium armor, shields",
    "prof_weapons": "Simple weapons, martial weapons",
    "prof_tools": "None",
    "equipment": "(a) a greataxe or (b) any martial melee weapon; (a) two handaxes or (b) any simple weapon; An explorer’s pack and four javelins.",
    "features": [
      {
        "name": "Rage",
        "level": 1,
        "desc": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain the following benefits if you aren’t wearing heavy armor: You have advantage on Strength checks and Strength saving throws. When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table. You have resistance to bludgeoning, piercing, and slashing damage. If you are able to cast spells, you can’t cast them or concentrate on them while raging. Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action. Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
      },
      {
        "name": "Unarmored Defense",
        "level": 1,
        "desc": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
      },
      {
        "name": "Reckless Attack",
        "level": 2,
        "desc": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
      },
      {
        "name": "Danger Sense",
        "level": 2,
        "desc": "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated."
      },
      {
        "name": "Primal Path",
        "level": 3,
        "desc": "At 3rd level, you choose a path that shapes the nature of your rage. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels. The document details the Path of the Berserker."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "desc": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
      },
      {
        "name": "Fast Movement",
        "level": 5,
        "desc": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor."
      },
      {
        "name": "Feral Instinct",
        "level": 7,
        "desc": "By 7th level, your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
      },
      {
        "name": "Brutal Critical",
        "level": 9,
        "desc": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. This increases to two additional dice at 13th level and three additional dice at 17th level."
      },
      {
        "name": "Relentless Rage",
        "level": 11,
        "desc": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
      },
      {
        "name": "Persistent Rage",
        "level": 15,
        "desc": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
      },
      {
        "name": "Indomitable Might",
        "level": 18,
        "desc": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
      },
      {
        "name": "Primal Champion",
        "level": 20,
        "desc": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
      }
    ],
    "archetypes": [
      {
        "name": "Path of the Berserker",
        "desc": "This path is one of untrammeled fury, slick with blood. As you enter the berserker’s rage, you thrill in the chaos of battle, heedless of your own health or well-being.",
        "features": [
          {
            "name": "Frenzy",
            "level": 3,
            "desc": "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion."
          },
          {
            "name": "Mindless Rage",
            "level": 6,
            "desc": "Beginning at 6th level, you can’t be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage."
          },
          {
            "name": "Intimidating Presence",
            "level": 10,
            "desc": "Beginning at 10th level, you can use your action to frighten someone with your menacing presence. Choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you. If the creature succeeds on its saving throw, you can’t use this feature on that creature again for 24 hours."
          },
          {
            "name": "Retaliation",
            "level": 14,
            "desc": "Starting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Rage, Unarmored Defense |\n| 2nd | +2 | Reckless Attack, Danger Sense |\n| 3rd | +2 | Primal Path |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | Extra Attack, Fast Movement |\n| 6th | +3 | Path feature |\n| 7th | +3 | Feral Instinct |\n| 8th | +3 | Ability Score Improvement |\n| 9th | +4 | Brutal Critical (1 die) |\n| 10th | +4 | Path feature |\n| 11th | +4 | Relentless Rage |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | Brutal Critical (2 dice) |\n| 14th | +5 | Path feature |\n| 15th | +5 | Persistent Rage |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | Brutal Critical (3 dice) |\n| 18th | +6 | Indomitable Might |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Primal Champion |"
  },
  {
    "name": "Bard",
    "slug": "bard",
    "hit_die": 8,
    "prof_saving_throws": "DEX, CHA",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 3,
        "from": [
          "Acrobatics",
          "Animal Handling",
          "Arcana",
          "Athletics",
          "Deception",
          "History",
          "Insight",
          "Intimidation",
          "Investigation",
          "Medicine",
          "Nature",
          "Perception",
          "Performance",
          "Persuasion",
          "Religion",
          "Sleight of Hand",
          "Stealth",
          "Survival"
        ]
      }
    ],
    "prof_armor": "Light armor",
    "prof_weapons": "Simple weapons, hand crossbows, longswords, rapiers, shortswords",
    "prof_tools": "Three musical instruments of your choice",
    "equipment": "(a) a rapier, (b) a longsword, or (c) any simple weapon; (a) a diplomat’s pack or (b) an entertainer’s pack; (a) a lute or (b) any other musical instrument; Leather armor and a dagger.",
    "features": [
      {
        "name": "Spellcasting",
        "level": 1,
        "desc": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire. You know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels. The Bard table shows how many spell slots you have to cast your spells of 1st level and higher. You must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest. You know four 1st-level spells of your choice from the bard spell list. You learn more bard spells of your choice as you level up. Each of these spells must be of a level for which you have spell slots. Additionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list. Charisma is your spellcasting ability for your bard spells. The save DC is 8 + your proficiency bonus + your Charisma modifier, and the attack modifier is your proficiency bonus + your Charisma modifier. You can cast any bard spell you know as a ritual if that spell has the ritual tag. You can use a musical instrument as a spellcasting focus for your bard spells."
      },
      {
        "name": "Bardic Inspiration",
        "level": 1,
        "desc": "You can inspire others through stirring words or music. As a bonus action, choose one creature other than yourself within 60 feet who can hear you. That creature gains one Bardic Inspiration die (a d6). Once within the next 10 minutes, the creature can roll the die and add the number to one ability check, attack roll, or saving throw. A creature can have only one Bardic Inspiration die at a time. You can use this feature a number of times equal to your Charisma modifier (minimum of once) and regain expended uses after a long rest. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."
      },
      {
        "name": "Jack of All Trades",
        "level": 2,
        "desc": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn’t already include your proficiency bonus."
      },
      {
        "name": "Song of Rest",
        "level": 2,
        "desc": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. The extra hit points increase to 1d8 at 9th level, 1d10 at 13th level, and 1d12 at 17th level."
      },
      {
        "name": "Bard College",
        "level": 3,
        "desc": "At 3rd level, you delve into the advanced techniques of a bard college of your choice, such as the College of Lore, which grants you features at 3rd, 6th, and 14th level."
      },
      {
        "name": "Expertise",
        "level": 3,
        "desc": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. At 10th level, you can choose another two skill proficiencies to gain this benefit."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Font of Inspiration",
        "level": 5,
        "desc": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest."
      },
      {
        "name": "Countercharm",
        "level": 6,
        "desc": "At 6th level, you can use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit."
      },
      {
        "name": "Magical Secrets",
        "level": 10,
        "desc": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class. A spell you choose must be of a level you can cast, or a cantrip. The chosen spells count as bard spells for you. You learn two additional spells from any class at 14th level and again at 18th level."
      },
      {
        "name": "Superior Inspiration",
        "level": 20,
        "desc": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use."
      }
    ],
    "archetypes": [
      {
        "name": "College of Lore",
        "desc": "Bards of the College of Lore are knowledgeable on a wide variety of topics and use their gifts to hold audiences spellbound, often questioning established norms.",
        "features": [
          {
            "name": "Bonus Proficiencies",
            "level": 3,
            "desc": "When you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice."
          },
          {
            "name": "Cutting Words",
            "level": 3,
            "desc": "Also at 3rd level, when a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature’s roll. The creature is immune if it can’t hear you or if it’s immune to being charmed."
          },
          {
            "name": "Additional Magical Secrets",
            "level": 6,
            "desc": "At 6th level, you learn two spells of your choice from any class. A spell you choose must be of a level you can cast, or a cantrip. The chosen spells count as bard spells for you but don’t count against the number of bard spells you know."
          },
          {
            "name": "Peerless Skill",
            "level": 14,
            "desc": "Starting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Spellcasting, Bardic Inspiration (d6) |\n| 2nd | +2 | Jack of All Trades, Song of Rest (d6) |\n| 3rd | +2 | Bard College, Expertise |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | Bardic Inspiration (d8), Font of Inspiration |\n| 6th | +3 | Countercharm, Bard College feature |\n| 7th | +3 | - |\n| 8th | +3 | Ability Score Improvement |\n| 9th | +4 | Song of Rest (d8) |\n| 10th | +4 | Bardic Inspiration (d10), Expertise, Magical Secrets |\n| 11th | +4 | - |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | Song of Rest (d10) |\n| 14th | +5 | Magical Secrets, Bard College feature |\n| 15th | +5 | Bardic Inspiration (d12) |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | Song of Rest (d12) |\n| 18th | +6 | Magical Secrets |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Superior Inspiration |"
  },
  {
    "name": "Cleric",
    "slug": "cleric",
    "hit_die": 8,
    "prof_saving_throws": "WIS, CHA",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 2,
        "from": [
          "History",
          "Insight",
          "Medicine",
          "Persuasion",
          "Religion"
        ]
      }
    ],
    "prof_armor": "Light armor, medium armor, shields",
    "prof_weapons": "Simple weapons",
    "prof_tools": "None",
    "equipment": "(a) a mace or (b) a warhammer (if proficient); (a) scale mail, (b) leather armor, or (c) chain mail (if proficient); (a) a light crossbow and 20 bolts or (b) any simple weapon; (a) a priest’s pack or (b) an explorer’s pack; A shield and a holy symbol.",
    "features": [
      {
        "name": "Spellcasting",
        "level": 1,
        "desc": "As a conduit for divine power, you can cast cleric spells. At 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips at higher levels. You prepare a list of cleric spells that are available for you to cast, choosing from the cleric spell list. You choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots. You can change your list of prepared spells when you finish a long rest. Wisdom is your spellcasting ability for your cleric spells. The save DC is 8 + your proficiency bonus + your Wisdom modifier, and the attack modifier is your proficiency bonus + your Wisdom modifier. You can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared. You can use a holy symbol as a spellcasting focus for your cleric spells."
      },
      {
        "name": "Divine Domain",
        "level": 1,
        "desc": "Choose one domain related to your deity, such as the Life Domain. Your choice grants you domain spells and other features at 1st level, and additional benefits at 2nd, 6th, 8th, and 17th levels. Each domain has a list of domain spells that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day."
      },
      {
        "name": "Channel Divinity",
        "level": 2,
        "desc": "At 2nd level, you gain the ability to channel divine energy. You start with two effects: Turn Undead and an effect determined by your domain. You must finish a short or long rest to use your Channel Divinity again. You can use it twice between rests starting at 6th level, and three times at 18th level."
      },
      {
        "name": "Channel Divinity: Turn Undead",
        "level": 2,
        "desc": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet must make a Wisdom saving throw. If it fails, it is turned for 1 minute or until it takes any damage."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Destroy Undead",
        "level": 5,
        "desc": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold."
      },
      {
        "name": "Divine Intervention",
        "level": 10,
        "desc": "Beginning at 10th level, you can call on your deity to intervene on your behalf. As an action, describe the assistance you seek and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. You can’t use this feature again for 7 days if successful. At 20th level, your call for intervention succeeds automatically."
      }
    ],
    "archetypes": [
      {
        "name": "Life Domain",
        "desc": "This domain focuses on the vibrant positive energy that sustains all life, promoting vitality and health. Life Domain Spells: You gain access to specific spells at certain cleric levels: 1st - bless, cure wounds; 3rd - lesser restoration, spiritual weapon; 5th - beacon of hope, revivify; 7th - death ward, guardian of faith; 9th - mass cure wounds, raise dead.",
        "features": [
          {
            "name": "Bonus Proficiency",
            "level": 1,
            "desc": "When you choose the Life Domain at 1st level, you gain proficiency with heavy armor."
          },
          {
            "name": "Disciple of Life",
            "level": 1,
            "desc": "Starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points, the creature regains additional hit points equal to 2 + the spell’s level."
          },
          {
            "name": "Channel Divinity: Preserve Life",
            "level": 2,
            "desc": "Starting at 2nd level, as an action, you can use your Channel Divinity to restore a number of hit points equal to five times your cleric level. You choose any creatures within 30 feet and divide those hit points among them, but a creature cannot be restored to more than half of its hit point maximum."
          },
          {
            "name": "Blessed Healer",
            "level": 6,
            "desc": "Beginning at 6th level, when you cast a healing spell of 1st level or higher on another creature, you regain hit points equal to 2 + the spell’s level."
          },
          {
            "name": "Divine Strike",
            "level": 8,
            "desc": "At 8th level, once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage. This damage increases to 2d8 at 14th level."
          },
          {
            "name": "Supreme Healing",
            "level": 17,
            "desc": "Starting at 17th level, when you would normally roll dice to restore hit points with a spell, you instead use the highest number possible for each die."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Spellcasting, Divine Domain |\n| 2nd | +2 | Channel Divinity (1/rest), Divine Domain feature |\n| 3rd | +2 | - |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | Destroy Undead (CR 1/2) |\n| 6th | +3 | Channel Divinity (2/rest), Divine Domain feature |\n| 7th | +3 | - |\n| 8th | +3 | Ability Score Improvement, Destroy Undead (CR 1), Divine Domain feature |\n| 9th | +4 | - |\n| 10th | +4 | Divine Intervention |\n| 11th | +4 | Destroy Undead (CR 2) |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | - |\n| 14th | +5 | Destroy Undead (CR 3) |\n| 15th | +5 | - |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | Destroy Undead (CR 4), Divine Domain feature |\n| 18th | +6 | Channel Divinity (3/rest) |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Divine Intervention improvement |"
  },
  {
    "name": "Druid",
    "slug": "druid",
    "hit_die": 8,
    "prof_saving_throws": "INT, WIS",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 2,
        "from": [
          "Arcana",
          "Animal Handling",
          "Insight",
          "Medicine",
          "Nature",
          "Perception",
          "Religion",
          "Survival"
        ]
      }
    ],
    "prof_armor": "Light armor, medium armor, shields (druids will not wear armor or use shields made of metal)",
    "prof_weapons": "Clubs, daggers, darts, javelins, maces, quarterstaffs, scimitars, sickles, slings, spears",
    "prof_tools": "Herbalism kit",
    "equipment": "(a) a wooden shield or (b) any simple weapon; (a) a scimitar or (b) any simple melee weapon; Leather armor, an explorer’s pack, and a druidic focus.",
    "features": [
      {
        "name": "Druidic",
        "level": 1,
        "desc": "You know Druidic, the secret language of druids, which you can use to speak and leave hidden messages."
      },
      {
        "name": "Spellcasting",
        "level": 1,
        "desc": "Drawing on the divine essence of nature itself, you can cast spells. At 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips at higher levels. You prepare a list of druid spells from the druid spell list, choosing a number of spells equal to your Wisdom modifier + your druid level (minimum of one). The spells must be of a level for which you have spell slots. You can change your list of prepared spells when you finish a long rest. Wisdom is your spellcasting ability for your druid spells. The save DC is 8 + your proficiency bonus + your Wisdom modifier, and the attack modifier is your proficiency bonus + your Wisdom modifier. You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared. You can use a druidic focus as a spellcasting focus for your druid spells."
      },
      {
        "name": "Wild Shape",
        "level": 2,
        "desc": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice, regaining expended uses on a short or long rest. Your druid level determines the beasts you can transform into. You can stay in a beast shape for a number of hours equal to half your druid level."
      },
      {
        "name": "Druid Circle",
        "level": 2,
        "desc": "At 2nd level, you choose to identify with a circle of druids, such as the Circle of the Land, which grants you features at 2nd, 6th, 10th, and 14th level."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Timeless Body",
        "level": 18,
        "desc": "Starting at 18th level, for every 10 years that pass, your body ages only 1 year."
      },
      {
        "name": "Beast Spells",
        "level": 18,
        "desc": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components but not provide material components."
      },
      {
        "name": "Archdruid",
        "level": 20,
        "desc": "At 20th level, you can use your Wild Shape an unlimited number of times. Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren’t consumed by a spell."
      }
    ],
    "archetypes": [
      {
        "name": "Circle of the Land",
        "desc": "This circle is made up of mystics and sages who safeguard ancient knowledge and rites. Your magic is influenced by the land where you were initiated. Circle Spells: Your mystical connection to the land infuses you with the ability to cast certain spells connected to a chosen land (arctic, coast, desert, forest, grassland, mountain, or swamp). You gain access to these spells at 3rd, 5th, 7th, and 9th level. These spells are always prepared and don't count against the number of spells you can prepare.",
        "features": [
          {
            "name": "Bonus Cantrip",
            "level": 2,
            "desc": "When you choose this circle at 2nd level, you learn one additional druid cantrip of your choice."
          },
          {
            "name": "Natural Recovery",
            "level": 2,
            "desc": "Starting at 2nd level, during a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can’t use this feature again until you finish a long rest."
          },
          {
            "name": "Land’s Stride",
            "level": 6,
            "desc": "Starting at 6th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them. You also have advantage on saving throws against plants that are magically created or manipulated to impede movement."
          },
          {
            "name": "Nature’s Ward",
            "level": 10,
            "desc": "When you reach 10th level, you can’t be charmed or frightened by elementals or fey, and you are immune to poison and disease."
          },
          {
            "name": "Nature’s Sanctuary",
            "level": 14,
            "desc": "When you reach 14th level, when a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Druidic, Spellcasting |\n| 2nd | +2 | Wild Shape, Druid Circle |\n| 3rd | +2 | - |\n| 4th | +2 | Wild Shape improvement, Ability Score Improvement |\n| 5th | +3 | - |\n| 6th | +3 | Druid Circle feature |\n| 7th | +3 | - |\n| 8th | +3 | Wild Shape improvement, Ability Score Improvement |\n| 9th | +4 | - |\n| 10th | +4 | Druid Circle feature |\n| 11th | +4 | - |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | - |\n| 14th | +5 | Druid Circle feature |\n| 15th | +5 | - |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | - |\n| 18th | +6 | Timeless Body, Beast Spells |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Archdruid |"
  },
  {
    "name": "Fighter",
    "slug": "fighter",
    "hit_die": 10,
    "prof_saving_throws": "STR, CON",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 2,
        "from": [
          "Acrobatics",
          "Animal Handling",
          "Athletics",
          "History",
          "Insight",
          "Intimidation",
          "Perception",
          "Survival"
        ]
      }
    ],
    "prof_armor": "All armor, shields",
    "prof_weapons": "Simple weapons, martial weapons",
    "prof_tools": "None",
    "equipment": "(a) chain mail or (b) leather armor, longbow, and 20 arrows; (a) a martial weapon and a shield or (b) two martial weapons; (a) a light crossbow and 20 bolts or (b) two handaxes; (a) a dungeoneer’s pack or (b) an explorer’s pack.",
    "features": [
      {
        "name": "Fighting Style",
        "level": 1,
        "desc": "You adopt a particular style of fighting as your specialty. Choose one of the following options: Archery, Defense, Dueling, Great Weapon Fighting, Protection, or Two-Weapon Fighting. You can’t take a Fighting Style option more than once."
      },
      {
        "name": "Second Wind",
        "level": 1,
        "desc": "You have a limited well of stamina. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again."
      },
      {
        "name": "Action Surge",
        "level": 2,
        "desc": "Starting at 2nd level, on your turn, you can take one additional action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
      },
      {
        "name": "Martial Archetype",
        "level": 3,
        "desc": "At 3rd level, you choose an archetype that you strive to emulate, such as the Champion. This choice grants you features at 3rd, 7th, 10th, 15th, and 18th level."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "desc": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three at 11th level and to four at 20th level."
      },
      {
        "name": "Indomitable",
        "level": 9,
        "desc": "Beginning at 9th level, you can reroll a saving throw that you fail. You must use the new roll, and you can’t use this feature again until you finish a long rest. You can use this feature twice between long rests starting at 13th level and three times starting at 17th level."
      }
    ],
    "archetypes": [
      {
        "name": "Champion",
        "desc": "The archetypal Champion focuses on the development of raw physical power honed to deadly perfection.",
        "features": [
          {
            "name": "Improved Critical",
            "level": 3,
            "desc": "Beginning when you choose this archetype at 3rd level, your weapon attacks score a critical hit on a roll of 19 or 20."
          },
          {
            "name": "Remarkable Athlete",
            "level": 7,
            "desc": "Starting at 7th level, you can add half your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn’t already use your proficiency bonus. In addition, your running long jump distance increases by a number of feet equal to your Strength modifier."
          },
          {
            "name": "Additional Fighting Style",
            "level": 10,
            "desc": "At 10th level, you can choose a second option from the Fighting Style class feature."
          },
          {
            "name": "Superior Critical",
            "level": 15,
            "desc": "Starting at 15th level, your weapon attacks score a critical hit on a roll of 18–20."
          },
          {
            "name": "Survivor",
            "level": 18,
            "desc": "At 18th level, at the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don’t gain this benefit if you have 0 hit points."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Fighting Style, Second Wind |\n| 2nd | +2 | Action Surge (one use) |\n| 3rd | +2 | Martial Archetype |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | Extra Attack |\n| 6th | +3 | Ability Score Improvement |\n| 7th | +3 | Martial Archetype feature |\n| 8th | +3 | Ability Score Improvement |\n| 9th | +4 | Indomitable (one use) |\n| 10th | +4 | Martial Archetype feature |\n| 11th | +4 | Extra Attack (2) |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | Indomitable (two uses) |\n| 14th | +5 | Ability Score Improvement |\n| 15th | +5 | Martial Archetype feature |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | Action Surge (two uses), Indomitable (three uses) |\n| 18th | +6 | Martial Archetype feature |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Extra Attack (3) |"
  },
  {
    "name": "Monk",
    "slug": "monk",
    "hit_die": 8,
    "prof_saving_throws": "STR, DEX",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 2,
        "from": [
          "Acrobatics",
          "Athletics",
          "History",
          "Insight",
          "Religion",
          "Stealth"
        ]
      }
    ],
    "prof_armor": "None",
    "prof_weapons": "Simple weapons, shortswords",
    "prof_tools": "Choose one type of artisan’s tools or one musical instrument",
    "equipment": "(a) a shortsword or (b) any simple weapon; (a) a dungeoneer’s pack or (b) an explorer’s pack; 10 darts.",
    "features": [
      {
        "name": "Unarmored Defense",
        "level": 1,
        "desc": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier."
      },
      {
        "name": "Martial Arts",
        "level": 1,
        "desc": "At 1st level, you are a master of combat styles that use unarmed strikes and monk weapons. You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons. You can roll a d4 for damage, which increases as you gain monk levels. When you use the Attack action with an unarmed strike or a monk weapon, you can make one unarmed strike as a bonus action."
      },
      {
        "name": "Ki",
        "level": 2,
        "desc": "Starting at 2nd level, you can harness the mystic energy of ki. You have a number of ki points equal to your monk level. You can spend these points to fuel various ki features. You regain all expended ki points when you finish a short or long rest. The Ki save DC is 8 + your proficiency bonus + your Wisdom modifier."
      },
      {
        "name": "Flurry of Blows",
        "level": 2,
        "desc": "Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action."
      },
      {
        "name": "Patient Defense",
        "level": 2,
        "desc": "You can spend 1 ki point to take the Dodge action as a bonus action on your turn."
      },
      {
        "name": "Step of the Wind",
        "level": 2,
        "desc": "You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn."
      },
      {
        "name": "Unarmored Movement",
        "level": 2,
        "desc": "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases as you gain monk levels. At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling."
      },
      {
        "name": "Monastic Tradition",
        "level": 3,
        "desc": "At 3rd level, you commit to a monastic tradition, such as the Way of the Open Hand, which grants you features at 3rd, 6th, 11th, and 17th level."
      },
      {
        "name": "Deflect Missiles",
        "level": 3,
        "desc": "Starting at 3rd level, you can use your reaction to deflect or catch a missile when you are hit by a ranged weapon attack. The damage is reduced by 1d10 + your Dexterity modifier + your monk level. If you reduce the damage to 0, you can catch the missile and spend 1 ki point to make a ranged attack with it."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Slow Fall",
        "level": 4,
        "desc": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "desc": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
      },
      {
        "name": "Stunning Strike",
        "level": 5,
        "desc": "Starting at 5th level, when you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn."
      },
      {
        "name": "Ki-Empowered Strikes",
        "level": 6,
        "desc": "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."
      },
      {
        "name": "Evasion",
        "level": 7,
        "desc": "At 7th level, when you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
      },
      {
        "name": "Stillness of Mind",
        "level": 7,
        "desc": "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened."
      },
      {
        "name": "Purity of Body",
        "level": 10,
        "desc": "At 10th level, you are immune to disease and poison."
      },
      {
        "name": "Tongue of the Sun and Moon",
        "level": 13,
        "desc": "Starting at 13th level, you understand all spoken languages, and any creature that can understand a language can understand you."
      },
      {
        "name": "Diamond Soul",
        "level": 14,
        "desc": "Beginning at 14th level, you gain proficiency in all saving throws. Additionally, when you fail a saving throw, you can spend 1 ki point to reroll it and take the second result."
      },
      {
        "name": "Timeless Body",
        "level": 15,
        "desc": "At 15th level, you suffer none of the frailty of old age, and you can’t be aged magically. You no longer need food or water."
      },
      {
        "name": "Empty Body",
        "level": 18,
        "desc": "Beginning at 18th level, you can spend 4 ki points to become invisible for 1 minute, during which you have resistance to all damage but force damage. You can also spend 8 ki points to cast the astral projection spell."
      },
      {
        "name": "Perfect Self",
        "level": 20,
        "desc": "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points."
      }
    ],
    "archetypes": [
      {
        "name": "Way of the Open Hand",
        "desc": "Monks of this tradition are the ultimate masters of martial arts combat.",
        "features": [
          {
            "name": "Open Hand Technique",
            "level": 3,
            "desc": "Starting at 3rd level, whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects: knock the target prone, push it up to 15 feet away, or prevent it from taking reactions until the end of your next turn."
          },
          {
            "name": "Wholeness of Body",
            "level": 6,
            "desc": "At 6th level, as an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again."
          },
          {
            "name": "Tranquility",
            "level": 11,
            "desc": "Beginning at 11th level, at the end of a long rest, you gain the effect of a sanctuary spell that lasts until the start of your next long rest."
          },
          {
            "name": "Quivering Palm",
            "level": 17,
            "desc": "At 17th level, when you hit a creature with an unarmed strike, you can spend 3 ki points to start lethal vibrations in its body. You can use your action to end the vibrations, forcing the creature to make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 necrotic damage."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Unarmored Defense, Martial Arts |\n| 2nd | +2 | Ki, Unarmored Movement |\n| 3rd | +2 | Monastic Tradition, Deflect Missiles |\n| 4th | +2 | Ability Score Improvement, Slow Fall |\n| 5th | +3 | Extra Attack, Stunning Strike |\n| 6th | +3 | Ki-Empowered Strikes, Monastic Tradition feature |\n| 7th | +3 | Evasion, Stillness of Mind |\n| 8th | +3 | Ability Score Improvement |\n| 9th | +4 | Unarmored Movement improvement |\n| 10th | +4 | Purity of Body |\n| 11th | +4 | Monastic Tradition feature |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | Tongue of the Sun and Moon |\n| 14th | +5 | Diamond Soul |\n| 15th | +5 | Timeless Body |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | Monastic Tradition feature |\n| 18th | +6 | Empty Body |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Perfect Self |"
  },
  {
    "name": "Paladin",
    "slug": "paladin",
    "hit_die": 10,
    "prof_saving_throws": "WIS, CHA",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 2,
        "from": [
          "Athletics",
          "Insight",
          "Intimidation",
          "Medicine",
          "Persuasion",
          "Religion"
        ]
      }
    ],
    "prof_armor": "All armor, shields",
    "prof_weapons": "Simple weapons, martial weapons",
    "prof_tools": "None",
    "equipment": "(a) a martial weapon and a shield or (b) two martial weapons; (a) five javelins or (b) any simple melee weapon; (a) a priest’s pack or (b) an explorer’s pack; Chain mail and a holy symbol.",
    "features": [
      {
        "name": "Divine Sense",
        "level": 1,
        "desc": "As an action, you can open your awareness to detect the location of any celestial, fiend, or undead within 60 feet that is not behind total cover, until the end of your next turn. You know the type of any being whose presence you sense. You can use this feature a number of times equal to 1 + your Charisma modifier, regaining expended uses on a long rest."
      },
      {
        "name": "Lay on Hands",
        "level": 1,
        "desc": "You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5. As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature. Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison."
      },
      {
        "name": "Fighting Style",
        "level": 2,
        "desc": "At 2nd level, you adopt a style of fighting as your specialty. Choose one of the following options: Defense, Dueling, Great Weapon Fighting, or Protection."
      },
      {
        "name": "Spellcasting",
        "level": 2,
        "desc": "By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells. You prepare a list of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots. You can change your list of prepared spells when you finish a long rest. Charisma is your spellcasting ability for your paladin spells. The save DC is 8 + your proficiency bonus + your Charisma modifier, and the attack modifier is your proficiency bonus + your Charisma modifier. You can use a holy symbol as a spellcasting focus for your paladin spells."
      },
      {
        "name": "Divine Smite",
        "level": 2,
        "desc": "Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon’s damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend."
      },
      {
        "name": "Divine Health",
        "level": 3,
        "desc": "By 3rd level, the divine magic flowing through you makes you immune to disease."
      },
      {
        "name": "Sacred Oath",
        "level": 3,
        "desc": "When you reach 3rd level, you swear an oath, such as the Oath of Devotion. Your choice grants you features at 3rd, 7th, 15th, and 20th level. Each oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared, and it doesn't count against the number of spells you can prepare. Your oath allows you to channel divine energy. You must finish a short or long rest to use your Channel Divinity again."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "desc": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
      },
      {
        "name": "Aura of Protection",
        "level": 6,
        "desc": "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus. At 18th level, the range of this aura increases to 30 feet."
      },
      {
        "name": "Aura of Courage",
        "level": 10,
        "desc": "Starting at 10th level, you and friendly creatures within 10 feet of you can’t be frightened while you are conscious. At 18th level, the range of this aura increases to 30 feet."
      },
      {
        "name": "Improved Divine Smite",
        "level": 11,
        "desc": "By 11th level, whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage."
      },
      {
        "name": "Cleansing Touch",
        "level": 14,
        "desc": "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once), regaining expended uses on a long rest."
      }
    ],
    "archetypes": [
      {
        "name": "Oath of Devotion",
        "desc": "This oath binds a paladin to the loftiest ideals of justice, virtue, and order. Tenets of Devotion: Honesty: Don’t lie or cheat. Courage: Never fear to act. Compassion: Aid others, protect the weak, and punish those who threaten them. Honor: Treat others with fairness. Duty: Be responsible for your actions and their consequences. Oath Spells (Devotion): You gain access to specific spells at certain paladin levels: 3rd - protection from evil and good, sanctuary; 5th - lesser restoration, zone of truth; 9th - beacon of hope, dispel magic; 13th - freedom of movement, guardian of faith; 17th - commune, flame strike. Channel Divinity (Devotion): You gain two Channel Divinity options: Sacred Weapon, which allows you to add your Charisma modifier to attack rolls with one weapon for 1 minute, and Turn the Unholy, which allows you to turn fiends and undead.",
        "features": [
          {
            "name": "Aura of Devotion",
            "level": 7,
            "desc": "Starting at 7th level, you and friendly creatures within 10 feet of you can’t be charmed while you are conscious. At 18th level, the range increases to 30 feet."
          },
          {
            "name": "Purity of Spirit",
            "level": 15,
            "desc": "Beginning at 15th level, you are always under the effects of a protection from evil and good spell."
          },
          {
            "name": "Holy Nimbus",
            "level": 20,
            "desc": "At 20th level, as an action, you can emanate an aura of sunlight for 1 minute. Whenever an enemy creature starts its turn in the bright light, it takes 10 radiant damage. You also have advantage on saving throws against spells cast by fiends or undead."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Divine Sense, Lay on Hands |\n| 2nd | +2 | Fighting Style, Spellcasting, Divine Smite |\n| 3rd | +2 | Divine Health, Sacred Oath |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | Extra Attack |\n| 6th | +3 | Aura of Protection |\n| 7th | +3 | Sacred Oath feature |\n| 8th | +3 | Ability Score Improvement |\n| 9th | +4 | - |\n| 10th | +4 | Aura of Courage |\n| 11th | +4 | Improved Divine Smite |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | - |\n| 14th | +5 | Cleansing Touch |\n| 15th | +5 | Sacred Oath feature |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | - |\n| 18th | +6 | Aura improvements |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Sacred Oath feature |"
  },
  {
    "name": "Ranger",
    "slug": "ranger",
    "hit_die": 10,
    "prof_saving_throws": "STR, DEX",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 3,
        "from": [
          "Animal Handling",
          "Athletics",
          "Insight",
          "Investigation",
          "Nature",
          "Perception",
          "Stealth",
          "Survival"
        ]
      }
    ],
    "prof_armor": "Light armor, medium armor, shields",
    "prof_weapons": "Simple weapons, martial weapons",
    "prof_tools": "None",
    "equipment": "(a) scale mail or (b) leather armor; (a) two shortswords or (b) two simple melee weapons; (a) a dungeoneer’s pack or (b) an explorer’s pack; A longbow and a quiver of 20 arrows.",
    "features": [
      {
        "name": "Favored Enemy",
        "level": 1,
        "desc": "Beginning at 1st level, you have significant experience with a certain type of enemy. Choose a type of favored enemy. You have advantage on Wisdom (Survival) checks to track them and on Intelligence checks to recall information about them. You also learn one language of your choice that is spoken by your favored enemies. You choose additional favored enemies at 6th and 14th level."
      },
      {
        "name": "Natural Explorer",
        "level": 1,
        "desc": "You are particularly familiar with one type of natural environment. Choose one type of favored terrain. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you’re proficient in. While traveling for an hour or more in your favored terrain, you gain several benefits, including that difficult terrain doesn’t slow your group’s travel and your group can’t become lost except by magical means. You choose additional favored terrain types at 6th and 10th level."
      },
      {
        "name": "Fighting Style",
        "level": 2,
        "desc": "At 2nd level, you adopt a particular style of fighting. Choose one of the following options: Archery, Defense, Dueling, or Two-Weapon Fighting."
      },
      {
        "name": "Spellcasting",
        "level": 2,
        "desc": "By 2nd level, you have learned to use the magical essence of nature to cast spells. The Ranger table shows how many spell slots you have to cast your spells of 1st level and higher. You regain all expended spell slots when you finish a long rest. You know two 1st-level spells of your choice from the ranger spell list. You learn more ranger spells as you level up. Additionally, when you gain a level in this class, you can replace one of the ranger spells you know with another from the ranger spell list. Wisdom is your spellcasting ability for your ranger spells. The save DC is 8 + your proficiency bonus + your Wisdom modifier, and the attack modifier is your proficiency bonus + your Wisdom modifier."
      },
      {
        "name": "Ranger Archetype",
        "level": 3,
        "desc": "At 3rd level, you choose an archetype to emulate, such as the Hunter, which grants features at 3rd, 7th, 11th, and 15th level."
      },
      {
        "name": "Primeval Awareness",
        "level": 3,
        "desc": "Beginning at 3rd level, you can use your action and expend one ranger spell slot to sense whether certain types of creatures are present within 1 mile of you (or within up to 6 miles in your favored terrain)."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "desc": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
      },
      {
        "name": "Land’s Stride",
        "level": 8,
        "desc": "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement, and you can pass through nonmagical plants without being slowed or taking damage from them. You also have advantage on saving throws against plants that are magically created or manipulated to impede movement."
      },
      {
        "name": "Hide in Plain Sight",
        "level": 10,
        "desc": "Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions."
      },
      {
        "name": "Vanish",
        "level": 14,
        "desc": "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can’t be tracked by nonmagical means unless you choose to leave a trail."
      },
      {
        "name": "Feral Senses",
        "level": 18,
        "desc": "At 18th level, when you attack a creature you can’t see, your inability to see it doesn’t impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn’t hidden from you and you aren’t blinded or deafened."
      },
      {
        "name": "Foe Slayer",
        "level": 20,
        "desc": "At 20th level, once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies."
      }
    ],
    "archetypes": [
      {
        "name": "Hunter",
        "desc": "Emulating the Hunter archetype means accepting your place as a bulwark between civilization and the terrors of the wilderness.",
        "features": [
          {
            "name": "Hunter’s Prey",
            "level": 3,
            "desc": "At 3rd level, you gain one of the following features: Colossus Slayer (deal an extra 1d8 damage once per turn to a creature below its hit point maximum), Giant Killer (use your reaction to attack a Large or larger creature that attacks you), or Horde Breaker (make another attack against a different creature within 5 feet of the original target)."
          },
          {
            "name": "Defensive Tactics",
            "level": 7,
            "desc": "At 7th level, you gain one of the following features: Escape the Horde (opportunity attacks against you are made with disadvantage), Multiattack Defense (gain a +4 bonus to AC against all subsequent attacks from a creature after it hits you for the rest of the turn), or Steel Will (advantage on saving throws against being frightened)."
          },
          {
            "name": "Multiattack",
            "level": 11,
            "desc": "At 11th level, you gain one of the following features: Volley (use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see) or Whirlwind Attack (use your action to make a melee attack against any number of creatures within 5 feet of you)."
          },
          {
            "name": "Superior Hunter’s Defense",
            "level": 15,
            "desc": "At 15th level, you gain one of the following features: Evasion (take no damage on a successful Dexterity save and half damage on a failed one), Stand Against the Tide (when a hostile creature misses you with a melee attack, you can use your reaction to force it to repeat the attack against another creature), or Uncanny Dodge (use your reaction to halve an attack's damage against you)."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Favored Enemy, Natural Explorer |\n| 2nd | +2 | Fighting Style, Spellcasting |\n| 3rd | +2 | Ranger Archetype, Primeval Awareness |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | Extra Attack |\n| 6th | +3 | Favored Enemy and Natural Explorer improvements |\n| 7th | +3 | Ranger Archetype feature |\n| 8th | +3 | Ability Score Improvement, Land’s Stride |\n| 9th | +4 | - |\n| 10th | +4 | Natural Explorer improvement, Hide in Plain Sight |\n| 11th | +4 | Ranger Archetype feature |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | - |\n| 14th | +5 | Favored Enemy improvement, Vanish |\n| 15th | +5 | Ranger Archetype feature |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | - |\n| 18th | +6 | Feral Senses |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Foe Slayer |"
  },
  {
    "name": "Rogue",
    "slug": "rogue",
    "hit_die": 8,
    "prof_saving_throws": "DEX, INT",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 4,
        "from": [
          "Acrobatics",
          "Athletics",
          "Deception",
          "Insight",
          "Intimidation",
          "Investigation",
          "Perception",
          "Performance",
          "Persuasion",
          "Sleight of Hand",
          "Stealth"
        ]
      }
    ],
    "prof_armor": "Light armor",
    "prof_weapons": "Simple weapons, hand crossbows, longswords, rapiers, shortswords",
    "prof_tools": "Thieves’ tools",
    "equipment": "(a) a rapier or (b) a shortsword; (a) a shortbow and quiver of 20 arrows or (b) a shortsword; (a) a burglar’s pack, (b) a dungeoneer’s pack, or (c) an explorer’s pack; Leather armor, two daggers, and thieves’ tools.",
    "features": [
      {
        "name": "Expertise",
        "level": 1,
        "desc": "At 1st level, choose two of your skill proficiencies, or one skill proficiency and your proficiency with thieves’ tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. At 6th level, you can choose two more proficiencies to gain this benefit."
      },
      {
        "name": "Sneak Attack",
        "level": 1,
        "desc": "Beginning at 1st level, once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon. You don’t need advantage if another enemy of the target is within 5 feet of it, that enemy isn’t incapacitated, and you don’t have disadvantage. The extra damage increases as you gain levels in this class."
      },
      {
        "name": "Thieves’ Cant",
        "level": 1,
        "desc": "During your rogue training, you learned thieves’ cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation."
      },
      {
        "name": "Cunning Action",
        "level": 2,
        "desc": "Starting at 2nd level, you can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action."
      },
      {
        "name": "Roguish Archetype",
        "level": 3,
        "desc": "At 3rd level, you choose an archetype to emulate, such as Thief. Your choice grants you features at 3rd, 9th, 13th, and 17th level."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 10th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Uncanny Dodge",
        "level": 5,
        "desc": "Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack’s damage against you."
      },
      {
        "name": "Evasion",
        "level": 7,
        "desc": "Beginning at 7th level, when you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed and only half damage if you fail."
      },
      {
        "name": "Reliable Talent",
        "level": 11,
        "desc": "By 11th level, whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10."
      },
      {
        "name": "Blindsense",
        "level": 14,
        "desc": "Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you."
      },
      {
        "name": "Slippery Mind",
        "level": 15,
        "desc": "By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws."
      },
      {
        "name": "Elusive",
        "level": 18,
        "desc": "Beginning at 18th level, no attack roll has advantage against you while you aren’t incapacitated."
      },
      {
        "name": "Stroke of Luck",
        "level": 20,
        "desc": "At 20th level, if your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20. Once you use this feature, you can’t use it again until you finish a short or long rest."
      }
    ],
    "archetypes": [
      {
        "name": "Thief",
        "desc": "You hone your skills in the larcenous arts.",
        "features": [
          {
            "name": "Fast Hands",
            "level": 3,
            "desc": "Starting at 3rd level, you can use the bonus action granted by your Cunning Action to make a Dexterity (Sleight of Hand) check, use your thieves’ tools to disarm a trap or open a lock, or take the Use an Object action."
          },
          {
            "name": "Second-Story Work",
            "level": 3,
            "desc": "When you choose this archetype at 3rd level, climbing no longer costs you extra movement. In addition, when you make a running jump, the distance you cover increases by a number of feet equal to your Dexterity modifier."
          },
          {
            "name": "Supreme Sneak",
            "level": 9,
            "desc": "Starting at 9th level, you have advantage on a Dexterity (Stealth) check if you move no more than half your speed on the same turn."
          },
          {
            "name": "Use Magic Device",
            "level": 13,
            "desc": "By 13th level, you ignore all class, race, and level requirements on the use of magic items."
          },
          {
            "name": "Thief’s Reflexes",
            "level": 17,
            "desc": "When you reach 17th level, you can take two turns during the first round of any combat. You take your first turn at your normal initiative and your second turn at your initiative minus 10. You can’t use this feature when you are surprised."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Expertise, Sneak Attack, Thieves’ Cant |\n| 2nd | +2 | Cunning Action |\n| 3rd | +2 | Roguish Archetype |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | Uncanny Dodge |\n| 6th | +3 | Expertise |\n| 7th | +3 | Evasion |\n| 8th | +3 | Ability Score Improvement |\n| 9th | +4 | Roguish Archetype feature |\n| 10th | +4 | Ability Score Improvement |\n| 11th | +4 | Reliable Talent |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | Roguish Archetype feature |\n| 14th | +5 | Blindsense |\n| 15th | +5 | Slippery Mind |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | Roguish Archetype feature |\n| 18th | +6 | Elusive |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Stroke of Luck |"
  },
  {
    "name": "Sorcerer",
    "slug": "sorcerer",
    "hit_die": 6,
    "prof_saving_throws": "CON, CHA",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 2,
        "from": [
          "Arcana",
          "Deception",
          "Insight",
          "Intimidation",
          "Persuasion",
          "Religion"
        ]
      }
    ],
    "prof_armor": "None",
    "prof_weapons": "Daggers, darts, slings, quarterstaffs, light crossbows",
    "prof_tools": "None",
    "equipment": "(a) a light crossbow and 20 bolts or (b) any simple weapon; (a) a component pouch or (b) an arcane focus; (a) a dungeoneer’s pack or (b) an explorer’s pack; Two daggers.",
    "features": [
      {
        "name": "Spellcasting",
        "level": 1,
        "desc": "An event in your past left an indelible mark on you, infusing you with arcane magic. At 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn additional sorcerer cantrips at higher levels. The Sorcerer table shows how many spell slots you have to cast your spells. You regain all expended spell slots when you finish a long rest. You know two 1st-level spells of your choice from the sorcerer spell list. You learn more sorcerer spells as you level up. Additionally, when you gain a level in this class, you can replace one of the sorcerer spells you know with another from the sorcerer spell list. Charisma is your spellcasting ability for your sorcerer spells. The save DC is 8 + your proficiency bonus + your Charisma modifier, and the attack modifier is your proficiency bonus + your Charisma modifier. You can use an arcane focus as a spellcasting focus for your sorcerer spells."
      },
      {
        "name": "Sorcerous Origin",
        "level": 1,
        "desc": "Choose a sorcerous origin, which describes the source of your innate magical power, such as Draconic Bloodline. Your choice grants you features at 1st, 6th, 14th, and 18th level."
      },
      {
        "name": "Font of Magic",
        "level": 2,
        "desc": "At 2nd level, you tap into a deep wellspring of magic within yourself, represented by sorcery points. You have 2 sorcery points, and you gain more as you reach higher levels. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest. You can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points."
      },
      {
        "name": "Metamagic",
        "level": 3,
        "desc": "At 3rd level, you gain the ability to twist your spells. You gain two Metamagic options of your choice from a list including Careful Spell, Distant Spell, Empowered Spell, Extended Spell, Heightened Spell, Quickened Spell, Subtle Spell, and Twinned Spell. You gain another one at 10th and 17th level."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Sorcerous Restoration",
        "level": 20,
        "desc": "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest."
      }
    ],
    "archetypes": [
      {
        "name": "Draconic Bloodline",
        "desc": "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors.",
        "features": [
          {
            "name": "Dragon Ancestor",
            "level": 1,
            "desc": "At 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later. You can speak, read, and write Draconic. Additionally, your proficiency bonus is doubled for Charisma checks when interacting with dragons."
          },
          {
            "name": "Draconic Resilience",
            "level": 1,
            "desc": "At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class. Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren’t wearing armor, your AC equals 13 + your Dexterity modifier."
          },
          {
            "name": "Elemental Affinity",
            "level": 6,
            "desc": "Starting at 6th level, when you cast a spell that deals damage of the type associated with your draconic ancestry, you can add your Charisma modifier to one damage roll of that spell. You can also spend 1 sorcery point to gain resistance to that damage type for 1 hour."
          },
          {
            "name": "Dragon Wings",
            "level": 14,
            "desc": "At 14th level, you gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current speed."
          },
          {
            "name": "Draconic Presence",
            "level": 18,
            "desc": "Beginning at 18th level, you can spend 5 sorcery points to exude an aura of awe or fear to a distance of 60 feet for 1 minute. Each hostile creature that starts its turn in this aura must succeed on a Wisdom saving throw or be charmed (if awe) or frightened (if fear) until the aura ends."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Spellcasting, Sorcerous Origin |\n| 2nd | +2 | Font of Magic |\n| 3rd | +2 | Metamagic |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | - |\n| 6th | +3 | Sorcerous Origin feature |\n| 7th | +3 | - |\n| 8th | +3 | Ability Score Improvement |\n| 9th | +4 | - |\n| 10th | +4 | Metamagic |\n| 11th | +4 | - |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | - |\n| 14th | +5 | Sorcerous Origin feature |\n| 15th | +5 | - |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | Metamagic |\n| 18th | +6 | Sorcerous Origin feature |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Sorcerous Restoration |"
  },
  {
    "name": "Warlock",
    "slug": "warlock",
    "hit_die": 8,
    "prof_saving_throws": "WIS, CHA",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 2,
        "from": [
          "Arcana",
          "Deception",
          "History",
          "Intimidation",
          "Investigation",
          "Nature",
          "Religion"
        ]
      }
    ],
    "prof_armor": "Light armor",
    "prof_weapons": "Simple weapons",
    "prof_tools": "None",
    "equipment": "(a) a light crossbow and 20 bolts or (b) any simple weapon; (a) a component pouch or (b) an arcane focus; (a) a scholar’s pack or (b) a dungeoneer’s pack; Leather armor, any simple weapon, and two daggers.",
    "features": [
      {
        "name": "Otherworldly Patron",
        "level": 1,
        "desc": "At 1st level, you have struck a bargain with an otherworldly being, such as The Fiend. Your choice grants you features at 1st, 6th, 10th, and 14th level."
      },
      {
        "name": "Pact Magic",
        "level": 1,
        "desc": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells. You know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips at higher levels. The Warlock table shows how many spell slots you have. All of your spell slots are the same level. You regain all expended spell slots when you finish a short or long rest. At 1st level, you know two 1st-level spells of your choice from the warlock spell list. You learn more warlock spells as you level up. Additionally, when you gain a level, you can replace one warlock spell you know with another from the warlock spell list. Charisma is your spellcasting ability for your warlock spells. The save DC is 8 + your proficiency bonus + your Charisma modifier, and the attack modifier is your proficiency bonus + your Charisma modifier. You can use an arcane focus as a spellcasting focus for your warlock spells."
      },
      {
        "name": "Eldritch Invocations",
        "level": 2,
        "desc": "At 2nd level, you gain two eldritch invocations of your choice. You gain additional invocations as you gain levels. Additionally, when you gain a level, you can replace one invocation you know with another."
      },
      {
        "name": "Pact Boon",
        "level": 3,
        "desc": "At 3rd level, your otherworldly patron bestows a gift upon you. You gain one of the following features: Pact of the Chain, Pact of the Blade, or Pact of the Tome."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Mystic Arcanum",
        "level": 11,
        "desc": "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. You gain more warlock spells of your choice that can be cast this way at higher levels."
      },
      {
        "name": "Eldritch Master",
        "level": 20,
        "desc": "At 20th level, you can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
      }
    ],
    "archetypes": [
      {
        "name": "The Fiend",
        "desc": "You have made a pact with a fiend from the lower planes of existence. Expanded Spell List (The Fiend): The Fiend lets you choose from an expanded list of spells. 1st: burning hands, command; 2nd: blindness/deafness, scorching ray; 3rd: fireball, stinking cloud; 4th: fire shield, wall of fire; 5th: flame strike, hallow.",
        "features": [
          {
            "name": "Dark One’s Blessing",
            "level": 1,
            "desc": "Starting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1)."
          },
          {
            "name": "Dark One’s Own Luck",
            "level": 6,
            "desc": "Starting at 6th level, when you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can’t use it again until you finish a short or long rest."
          },
          {
            "name": "Fiendish Resilience",
            "level": 10,
            "desc": "Starting at 10th level, you can choose one damage type when you finish a short or long rest and gain resistance to it. Damage from magical weapons or silver weapons ignores this resistance."
          },
          {
            "name": "Hurl Through Hell",
            "level": 14,
            "desc": "Starting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. At the end of your next turn, the target returns and takes 10d10 psychic damage if it is not a fiend. You can’t use this feature again until you finish a long rest."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Otherworldly Patron, Pact Magic |\n| 2nd | +2 | Eldritch Invocations |\n| 3rd | +2 | Pact Boon |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | - |\n| 6th | +3 | Otherworldly Patron feature |\n| 7th | +3 | - |\n| 8th | +3 | Ability Score Improvement |\n| 9th | +4 | - |\n| 10th | +4 | Otherworldly Patron feature |\n| 11th | +4 | Mystic Arcanum (6th level) |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | Mystic Arcanum (7th level) |\n| 14th | +5 | Otherworldly Patron feature |\n| 15th | +5 | Mystic Arcanum (8th level) |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | Mystic Arcanum (9th level) |\n| 18th | +6 | - |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Eldritch Master |"
  },
  {
    "name": "Wizard",
    "slug": "wizard",
    "hit_die": 6,
    "prof_saving_throws": "INT, WIS",
    "skill_proficiencies": [
      {
        "type": "choice",
        "choose": 2,
        "from": [
          "Arcana",
          "History",
          "Insight",
          "Investigation",
          "Medicine",
          "Religion"
        ]
      }
    ],
    "prof_armor": "None",
    "prof_weapons": "Daggers, darts, slings, quarterstaffs, light crossbows",
    "prof_tools": "None",
    "equipment": "(a) a quarterstaff or (b) a dagger; (a) a component pouch or (b) an arcane focus; (a) a scholar’s pack or (b) an explorer’s pack; A spellbook.",
    "features": [
      {
        "name": "Spellcasting",
        "level": 1,
        "desc": "As a student of arcane magic, you have a spellbook containing spells. At 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips at higher levels. At 1st level, you have a spellbook containing six 1st-level wizard spells of your choice. You prepare a list of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots. You can change your list of prepared spells when you finish a long rest. Intelligence is your spellcasting ability for your wizard spells. The save DC is 8 + your proficiency bonus + your Intelligence modifier, and the attack modifier is your proficiency bonus + your Intelligence modifier. You can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don’t need to have the spell prepared. You can use an arcane focus as a spellcasting focus for your wizard spells. Each time you gain a wizard level, you can add two wizard spells of your choice to your spellbook for free."
      },
      {
        "name": "Arcane Recovery",
        "level": 1,
        "desc": "Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher."
      },
      {
        "name": "Arcane Tradition",
        "level": 2,
        "desc": "When you reach 2nd level, you choose an arcane tradition, shaping your practice of magic through one of eight schools, such as the School of Evocation. Your choice grants you features at 2nd, 6th, 10th, and 14th level."
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature."
      },
      {
        "name": "Spell Mastery",
        "level": 18,
        "desc": "At 18th level, choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared."
      },
      {
        "name": "Signature Spells",
        "level": 20,
        "desc": "When you reach 20th level, choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don’t count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. You must finish a short or long rest before you can do so again."
      }
    ],
    "archetypes": [
      {
        "name": "School of Evocation",
        "desc": "You focus your study on magic that creates powerful elemental effects.",
        "features": [
          {
            "name": "Evocation Savant",
            "level": 2,
            "desc": "Beginning when you select this school at 2nd level, the gold and time you must spend to copy an evocation spell into your spellbook is halved."
          },
          {
            "name": "Sculpt Spells",
            "level": 2,
            "desc": "Beginning at 2nd level, when you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell’s level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save."
          },
          {
            "name": "Potent Cantrip",
            "level": 6,
            "desc": "Starting at 6th level, when a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip’s damage (if any) but suffers no additional effect."
          },
          {
            "name": "Empowered Evocation",
            "level": 10,
            "desc": "Beginning at 10th level, you can add your Intelligence modifier to one damage roll of any wizard evocation spell you cast."
          },
          {
            "name": "Overchannel",
            "level": 14,
            "desc": "Starting at 14th level, when you cast a wizard spell of 1st through 5th level that deals damage, you can deal maximum damage with that spell. The first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12."
          }
        ]
      }
    ],
    "table": "| Level | Proficiency Bonus | Features |\n|:---:|:---:|:---|\n| 1st | +2 | Spellcasting, Arcane Recovery |\n| 2nd | +2 | Arcane Tradition |\n| 3rd | +2 | - |\n| 4th | +2 | Ability Score Improvement |\n| 5th | +3 | - |\n| 6th | +3 | Arcane Tradition feature |\n| 7th | +3 | - |\n| 8th | +3 | Ability Score Improvement |\n| 9th | +4 | - |\n| 10th | +4 | Arcane Tradition feature |\n| 11th | +4 | - |\n| 12th | +4 | Ability Score Improvement |\n| 13th | +5 | - |\n| 14th | +5 | Arcane Tradition feature |\n| 15th | +5 | - |\n| 16th | +5 | Ability Score Improvement |\n| 17th | +6 | - |\n| 18th | +6 | Spell Mastery |\n| 19th | +6 | Ability Score Improvement |\n| 20th | +6 | Signature Spells |"
  }
]
