[
  {
    "name": "Alchemical Form",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "1 minute",
    "description": "You transform into an amoebic form composed of highly acidic and poisonous alchemical jelly. While in this form:\n* you are immune to acid and poison damage and to the poisoned and stunned conditions;\n* you have resistance to nonmagical fire, piercing, and slashing damage;\n* you can’t speak, cast spells, use items or weapons, or manipulate objects;\n* your gear melds into your body and reappears when the spell ends;\n* you don't need to breathe;\n* your speed is 20 feet;\n* your size doesn’t change, but you can move through and between obstructions as if you were two size categories smaller; and\n* you gain the following action: **Melee Weapon Attack:** spellcasting ability modifier + proficiency bonus to hit, range 5 ft., one target; **Hit:** 4d6 acid or poison damage (your choice), and the target must make a successful Constitution saving throw or be poisoned until the start of your next turn."
  },
  {
    "name": "Ally Aegis",
    "level": 6,
    "school": "Abjuration",
    "casting_time": "1 reaction",
    "range": "60 feet",
    "components": "",
    "duration": "1 round",
    "description": "When you see an ally within range in imminent danger, you can use your reaction to protect that creature with a shield of magical force. Until the start of your next turn, your ally has a +5 bonus to AC and is immune to force damage. In addition, if your ally must make a saving throw against an enemy’s spell that deals damage, the ally takes half as much damage on a failed saving throw and no damage on a successful save. Ally aegis offers no protection, however, against psychic damage from any source."
  },
  {
    "name": "Animate Greater Undead",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 hour",
    "range": "15 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "**Animate greater undead** creates an undead servant from a pile of bones or from the corpse of a Large or Huge humanoid within range. The spell imbues the target with a foul mimicry of life, raising it as an undead skeleton or zombie. A skeleton uses the stat block of a minotaur skeleton, or a zombie uses the stat block of an ogre zombie, unless a more appropriate stat block is available.\n\nThe creature is under your control for 24 hours, after which it stops obeying your commands. To maintain control of the creature for another 24 hours, you must cast this spell on it again while you have it controlled. Casting the spell for this purpose reasserts your control over up to four creatures you have previously animated rather than animating a new one."
  },
  {
    "name": "Avronin’s Astral Assembly",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "10 minutes",
    "range": "999999 feet",
    "components": "M",
    "duration": "Concentration, up to 1 hour",
    "description": "You alert a number of creatures that you are familiar with, up to your spellcasting ability modifier (minimum of 1), of your intent to communicate with them through spiritual projection. The invitation can extend any distance and even cross to other planes of existence. Once notified, the creatures can choose to accept this communication at any time during the duration of the spell.\n\nWhen a creature accepts, its spirit is projected into one of the gems used in casting the spell. The material body it leaves behind falls unconscious and doesn't need food or air. The creature's consciousness is present in the room with you, and its normal form appears as an astral projection within 5 feet of the gem its spirit occupies. You can see and hear all the creatures who have joined in the assembly, and they can see and hear you and each other as if they were present (which they are, astrally). They can't interact with anything physically.\n\nA creature can end the spell's effect on itself voluntarily at any time, as can you. When the effect ends or the duration expires, a creature's spirit returns to its body and it regains consciousness. A creature that withdraws voluntarily from the assembly can't rejoin it even if the spell is still active. If a gem is broken while occupied by a creature's astral self, the spirit in the gem returns to its body and the creature suffers two levels of exhaustion."
  },
  {
    "name": "Banshee Wail",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "instantaneous",
    "description": "You emit a soul-shattering wail. Every creature within a 30-foot cone who hears the wail must make a Wisdom saving throw. Those that fail take 6d10 psychic damage and become frightened of you; a frightened creature repeats the saving throw at the end of its turn, ending the effect on itself on a success. Those that succeed take 3d10 psychic damage and aren't frightened. This spell has no effect on constructs and undead."
  },
  {
    "name": "Become Nightwing",
    "level": 6,
    "school": "Enchantment",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "This spell imbues you with wings of shadow. For the duration of the spell, you gain a flying speed of 60 feet and a new attack action: Nightwing Breath.\n\n***Nightwing Breath (Recharge 4–6).*** You exhale shadow‐substance in a 30-foot cone. Each creature in the area takes 5d6 necrotic damage, or half the damage with a successful Dexterity saving throw."
  },
  {
    "name": "Black Well",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "300 feet",
    "components": "",
    "duration": "Concentration, up to 1 minute",
    "description": "You summon a seething sphere of dark energy 5 feet in diameter at a point within range. The sphere pulls creatures toward it and devours the life force of those it envelops. Every creature other than you that starts its turn within 90 feet of the black well must make a successful Strength saving throw or be pulled 50 feet toward the well. A creature pulled into the well takes 6d8 necrotic damage and is stunned; a successful Constitution saving throw halves the damage and causes the creature to become incapacitated. A creature that starts its turn inside the well also makes a Constitution saving throw; the creature is stunned on a failed save or incapacitated on a success. An incapacitated creature that leaves the well recovers immediately and can take actions and reactions on that turn. A creature takes damage only upon entering the well—it takes no additional damage for remaining there—but if it leaves the well and is pulled back in again, it takes damage again. A total of nine Medium creatures, three Large creatures, or one Huge creature can be inside the well’s otherdimensional space at one time. When the spell’s duration ends, all creatures inside it tumble out in a heap, landing prone."
  },
  {
    "name": "Blade Barrier",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "",
    "duration": "Concentration, up to 10 minutes",
    "description": "You create a wall of slashing blades. The wall can be up to 20 feet high and 5 feet thick, and can either be a straight wall up to 100 feet long or a ringed wall of up to 60 feet in diameter. The wall provides three-quarters cover and its area is difficult terrain.\n\nWhen a creature starts its turn within the wall's area or enters the wall's area for the first time on a turn, it makes a Dexterity saving throw, taking 6d10 slashing damage on a failed save, or half as much on a successful save."
  },
  {
    "name": "Blade Barrier",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "90 feet",
    "components": "",
    "duration": "Concentration, up to 10 minutes",
    "description": "You create a vertical wall of whirling, razor-sharp blades made of magical energy. The wall appears within range and lasts for the duration. You can make a straight wall up to 100 feet long, 20 feet high, and 5 feet thick, or a ringed wall up to 60 feet in diameter, 20 feet high, and 5 feet thick. The wall provides three-quarters cover to creatures behind it, and its space is difficult terrain. When a creature enters the wall's area for the first time on a turn or starts its turn there, the creature must make a dexterity saving throw. On a failed save, the creature takes 6d10 slashing damage. On a successful save, the creature takes half as much damage."
  },
  {
    "name": "Catapult",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "400 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "You magically hurl an object or creature weighing 500 pounds or less 40 feet through the air in a direction of your choosing (including straight up). Objects hurled at specific targets require a spell attack roll to hit. A thrown creature takes 6d10 bludgeoning damage from the force of the throw, plus any appropriate falling damage, and lands prone. If the target of the spell is thrown against another creature, the total damage is divided evenly between them and both creatures are knocked prone."
  },
  {
    "name": "Chain Lightning",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "You fire a bolt of electricity at the primary target that deals 10d8 lightning damage. Electricity arcs to up to 3 additional targets you choose that are within 30 feet of the primary target."
  },
  {
    "name": "Chain Lightning",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "150 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "You create a bolt of lightning that arcs toward a target of your choice that you can see within range. Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts. A target must make a dexterity saving throw. The target takes 10d8 lightning damage on a failed save, or half as much damage on a successful one."
  },
  {
    "name": "Chaotic World",
    "level": 6,
    "school": "Illusion",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You throw a handful of colored cloth into the air while screaming a litany of disjointed phrases. A moment later, a 30-foot cube centered on a point within range fills with multicolored light, cacophonous sound, overpowering scents, and other confusing sensory information. The effect is dizzying and overwhelming. Each enemy within the cube must make a successful Intelligence saving throw or become blinded and deafened, and fall prone. An affected enemy cannot stand up or recover from the blindness or deafness while within the area, but all three conditions end immediately for a creature that leaves the spell’s area."
  },
  {
    "name": "Circle of Death",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "A sphere of negative energy sucks life from the area.\n\nCreatures in the area take 9d6 necrotic damage."
  },
  {
    "name": "Circle of Death",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "150 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "A sphere of negative energy ripples out in a 60-foot-radius sphere from a point within range. Each creature in that area must make a constitution saving throw. A target takes 8d6 necrotic damage on a failed save, or half as much damage on a successful one."
  },
  {
    "name": "Conjure Construct",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You summon a construct of challenge rating 5 or lower to harry your foes. It appears in an unoccupied space you can see within range. It disappears when it drops to 0 hit points or when the spell ends.\n  The construct is friendly to you and your companions for the duration. Roll initiative for the construct, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you). If you don't issue any commands to the construct, it defends itself from hostile creatures but otherwise takes no actions.\n  If your concentration is broken, the construct doesn't disappear. Instead, you lose control of the construct, it becomes hostile toward you and your companions, and it might attack. An uncontrolled construct can't be dismissed by you, and it disappears 1 hour after you summoned it.\n  The construct deals double damage to objects and structures.\n  The GM has the construct's statistics."
  },
  {
    "name": "Conjure Fey",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "60 feet",
    "components": "",
    "duration": "Concentration, up to 1 hour",
    "description": "You summon a creature from The Dreaming.\n\nThis creature uses the statistics of a fey creature (detailed below) with certain traits determined by your choice of its type: hag, hound, or redcap.\n\nThe creature is friendly to you and your companions and takes its turn immediately after yours.\n\nIt obeys your verbal commands. Without such commands, the creature only defends itself.\n\nThe summoned creature disappears when reduced to 0 hit points. If your concentration is broken before the spell ends, you lose control of the summoned creature, which becomes hostile and might attack you and your companions. An uncontrolled creature disappears at the end of the spell's maximum duration."
  },
  {
    "name": "Conjure Fey",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "90 feet",
    "components": "",
    "duration": "Concentration, up to 1 hour",
    "description": "You summon a fey creature of challenge rating 6 or lower, or a fey spirit that takes the form of a beast of challenge rating 6 or lower. It appears in an unoccupied space that you can see within range. The fey creature disappears when it drops to 0 hit points or when the spell ends. The fey creature is friendly to you and your companions for the duration. Roll initiative for the creature, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you), as long as they don't violate its alignment. If you don't issue any commands to the fey creature, it defends itself from hostile creatures but otherwise takes no actions. If your concentration is broken, the fey creature doesn't disappear. Instead, you lose control of the fey creature, it becomes hostile toward you and your companions, and it might attack. An uncontrolled fey creature can't be dismissed by you, and it disappears 1 hour after you summoned it. The DM has the fey creature's statistics."
  },
  {
    "name": "Conjure Forest Defender",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 hour",
    "range": "30 feet",
    "components": "M",
    "duration": "until destroyed",
    "description": "When you cast this spell in a forest, you fasten sticks and twigs around a body. The body comes to life as a [forest defender](https://api.open5e.com/monsters/forest-defender). The forest defender is friendly to you and your companions. Roll initiative for the forest defender, which has its own turns. It obeys any verbal or mental commands that you issue to it (no action required by you), as long as you remain within its line of sight. If you don’t issue any commands to the forest defender, if you are out of its line of sight, or if you are unconscious, it defends itself from hostile creatures but otherwise takes no actions. A body sacrificed to form the forest defender is permanently destroyed and can be restored to life only by means of a [true resurrection](https://api.open5e.com/spells/true-resurrection) or a [wish](https://api.open5e.com/spells/wish) spell. You can have only one forest defender under your control at a time. If you cast this spell again, the previous forest defender crumbles to dust."
  },
  {
    "name": "Contingency",
    "level": 6,
    "school": "Evocation",
    "casting_time": "10 minutes",
    "range": "Self",
    "components": "M",
    "duration": "10 days",
    "description": "As part of this spell, cast a spell of 5th-level or lower that has a casting time of 1 action, expending spell slots for both. The second spell must target you, and doesn't target others even if it normally would.\n\nDescribe the circumstances under which the second spell should be cast. It is automatically triggered the first time these circumstances are met. This spell ends when the second spell is triggered, when you cast _contingency_ again, or if the material component for it is not on your person. For example, when you cast _contingency_ with _blur_ as a second spell you might make the trigger be when you see a creature target you with a weapon attack, or you might make it be when you make a weapon attack against a creature, or you could choose for it to be when you see an ally make a weapon attack against a creature."
  },
  {
    "name": "Contingency",
    "level": 6,
    "school": "Evocation",
    "casting_time": "10 minutes",
    "range": "Self",
    "components": "M",
    "duration": "10 days",
    "description": "Choose a spell of 5th level or lower that you can cast, that has a casting time of 1 action, and that can target you. You cast that spell-called the contingent spell-as part of casting contingency, expending spell slots for both, but the contingent spell doesn't come into effect. Instead, it takes effect when a certain circumstance occurs. You describe that circumstance when you cast the two spells. For example, a contingency cast with water breathing might stipulate that water breathing comes into effect when you are engulfed in water or a similar liquid. The contingent spell takes effect immediately after the circumstance is met for the first time, whether or not you want it to. and then contingency ends. The contingent spell takes effect only on you, even if it can normally target others. You can use only one contingency spell at a time. If you cast this spell again, the effect of another contingency spell on you ends. Also, contingency ends on you if its material component is ever not on your person."
  },
  {
    "name": "Create Undead",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 minute",
    "range": "30 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "This spell cannot be cast in sunlight. You reanimate the targets as undead and transform them into ghouls under your control.\n\nWhile it is within 120 feet you can use a bonus action to mentally command the undead. When you command multiple undead using this spell, you must give them all the same command. You may decide the action the undead takes and where it moves during its next turn, or you can issue a general command, such as guarding an area. If not given a command, the undead only defends itself. The undead continues to follow a command until its task is complete.\n\nThe undead is under your control for 24 hours, after which it stops obeying any commands. You must cast this spell on the undead before the spell ends to maintain control of it for another 24 hours. Casting the spell in this way reasserts control over up to 3 undead you have animated with this spell, rather than animating a new one."
  },
  {
    "name": "Create Undead",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 minute",
    "range": "10 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "You can cast this spell only at night. Choose up to three corpses of Medium or Small humanoids within range. Each corpse becomes a ghoul under your control. (The DM has game statistics for these creatures.) As a bonus action on each of your turns, you can mentally command any creature you animated with this spell if the creature is within 120 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete. The creature is under your control for 24 hours, after which it stops obeying any command you have given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature before the current 24-hour period ends. This use of the spell reasserts your control over up to three creatures you have animated with this spell, rather than animating new ones."
  },
  {
    "name": "Curse of Boreas",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "100 feet",
    "components": "",
    "duration": "permanent",
    "description": "You designate a creature within range that you can see. If the target fails a Charisma saving throw, it and its equipment are frozen solid, becoming an inert statue of ice. The creature is effectively paralyzed, but mental activity does not cease, and signs of life are detectable; the creature still breathes and its heart continues to beat, though both acts are almost imperceptible. If the ice statue is broken or damaged while frozen, the creature will have matching damage or injury when returned to its original state. [Dispel magic](https://api.open5e.com/spells/dispel-magic) can’t end this spell, but it can allow the target to speak (but not move or cast spells) for a number of rounds equal to the spell slot used. [Greater restoration](https://api.open5e.com/spells/greater-restoration) or more potent magic is needed to free a creature from the ice."
  },
  {
    "name": "Curse of Formlessness",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "permanent",
    "description": "A creature you touch must make a successful Constitution saving throw or be cursed with a shifting, amorphous form. Spells that change the target creature's shape (such as polymorph) do not end the curse, but they do hold the creature in a stable form, temporarily mitigating it until the end of that particular spell's duration; shapechange and stoneskin have similar effects. While under the effect of the curse of formlessness, the target creature is resistant to slashing and piercing damage and ignores the additional damage done by critical hits, but it can neither hold nor use any item, nor can it cast spells or activate magic items. Its movement is halved, and winged flight becomes impossible. Any armor, clothing, helmet, or ring becomes useless. Large items that are carried or worn, such as armor, backpacks, or clothing, become hindrances, so the target has disadvantage on Dexterity checks and saving throws while such items are in place. A creature under the effect of a curse of formlessness can try to hold itself together through force of will. The afflicted creature uses its action to repeat the saving throw; if it succeeds, the afflicted creature negates the penalties from the spell until the start of its next turn."
  },
  {
    "name": "Disintegrate",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "A pale ray emanates from your pointed finger to the target as you attempt to undo it.\n\nThe target takes 10d6 + 40 force damage. A creature reduced to 0 hit points is obliterated, leaving behind nothing but fine dust, along with anything it was wearing or carrying (except magic items). Only true resurrection or a wish spell can restore it to life.\n\nThis spell automatically disintegrates nonmagical objects and creations of magical force that are Large-sized or smaller. Larger objects and creations of magical force have a 10-foot-cube portion disintegrated instead. Magic items are unaffected."
  },
  {
    "name": "Disintegrate",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "A thin green ray springs from your pointing finger to a target that you can see within range. The target can be a creature, an object, or a creation of magical force, such as the wall created by wall of force. A creature targeted by this spell must make a dexterity saving throw. On a failed save, the target takes 10d6 + 40 force damage. If this damage reduces the target to 0 hit points, it is disintegrated. A disintegrated creature and everything it is wearing and carrying, except magic items, are reduced to a pile of fine gray dust. The creature can be restored to life only by means of a true resurrection or a wish spell. This spell automatically disintegrates a Large or smaller nonmagical object or a creation of magical force. If the target is a Huge or larger object or creation of force, this spell disintegrates a 10-foot-cube portion of it. A magic item is unaffected by this spell."
  },
  {
    "name": "Enchant Ring",
    "level": 6,
    "school": "Enchantment",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "permanent until discharged",
    "description": "You enchant a ring you touch that isn’t being worn or carried. The next creature that willingly wears the ring becomes charmed by you for 1 week or until it is harmed by you or one of your allies. If the creature dons the ring while directly threatened by you or one of your allies, the spell fails.\n\nThe charmed creature regards you as a friend. When the spell ends, it doesn’t know it was charmed by you, but it does realize that its attitude toward you has changed (possibly greatly) in a short time. How the creature reacts to you and regards you in the future is up to the GM."
  },
  {
    "name": "Encroaching Shadows",
    "level": 6,
    "school": "Illusion",
    "casting_time": "1 hour",
    "range": "150 feet",
    "components": "M",
    "duration": "12 hours",
    "description": "You cause menacing shadows to invade an area 200 feet on a side and 50 feet high, centered on a point within range. Illumination in the area drops one step (from bright light to dim, or from dim light to darkness). Any spell that creates light in the area that is cast using a lower-level spell slot than was used to cast encroaching shadows is dispelled, and a spell that creates light doesn’t function in the area if that spell is cast using a spell slot of 5th level or lower. Nonmagical effects can’t increase the level of illumination in the affected area.\n\nA spell that creates darkness or shadow takes effect in the area as if the spell slot expended was one level higher than the spell slot actually used."
  },
  {
    "name": "Entomb",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "90 feet",
    "components": "M",
    "duration": "8 hours",
    "description": "You cause slabs of rock to burst out of the ground or other stone surface to form a hollow, 10-foot cube within range. A creature inside the cube when it forms must make a successful Dexterity saving throw or be trapped inside the stone tomb. The tomb is airtight, with enough air for a single Medium or Small creature to breathe for 8 hours. If more than one creature is trapped inside, divide the time evenly between all the occupants. A Large creature counts as four Medium creatures. If the creature is still trapped inside when the air runs out, it begins to suffocate.\n\nThe tomb has AC 18 and 50 hit points. It is resistant to fire, cold, lightning, bludgeoning, and slashing damage, is immune to poison and psychic damage, and is vulnerable to thunder damage. When reduced to 0 hit points, the tomb crumbles into harmless powder."
  },
  {
    "name": "Extract Knowledge",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "instantaneous",
    "description": "By touching a recently deceased corpse, you gain one specific bit of knowledge from it that was known to the creature in life. You must form a question in your mind as part of casting the spell; if the corpse has an answer to your question, it reveals the information to you telepathically. The answer is always brief—no more than a sentence—and very specific to the framed question. It doesn’t matter whether the creature was your friend or enemy; the spell compels it to answer in any case."
  },
  {
    "name": "Eye bite",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "Concentration, up to 1 minute",
    "description": "For the spell's Duration, your eyes turn black and veins of dark energy lace your cheeks. One creature of your choice within 60 feet of you that you can see must succeed on a Wisdom saving throw or be affected by one of the listed Effects of your choice for the Duration. On each of your turns until the spell ends, you can use your action to target another creature but can't target a creature again if it has succeeded on a saving throw against this casting of Eyebite.\n\nAsleep: The target is rendered Unconscious. It wakes up if it takes any damage or if another creature uses its action to jostle the sleeper awake.\n\nPanicked: The target is Frightened of you. On each of its turns, the Frightened creature must take the Dash action and move away from you by the safest and shortest possible route, unless there is no place to move. If the target is at least 60 feet away from you and can no longer see you, this effect ends.\n\nSickened: The target has disadvantage on Attack rolls and Ability Checks. At the end of each of its turns, it can make another Wisdom saving throw. If it succeeds, the effect ends.\n\n*(This Open5e spell replaces a like-named non-SRD spell from an official source.*"
  },
  {
    "name": "Eyebite",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "Concentration, up to 1 minute",
    "description": "Your eyes become an inky void imbued with fell power. One creature of your choice within 60 feet of you that you can see and that can see you must succeed on a Wisdom saving throw or be afflicted by one of the following effects for the duration. Until the spell ends, on each of your turns you can use an action to target a creature that has not already succeeded on a saving throw against this casting of _eyebite_.\n\n* **Asleep:** The target falls unconscious, waking if it takes any damage or another creature uses an action to rouse it.\n* **Panicked:** The target is frightened of you. On each of its turns, the frightened creature uses its action to take the Dash action and move away from you by the safest and shortest available route unless there is nowhere for it to move. If the target moves to a place at least 60 feet away from you where it can no longer see you, this effect ends.\n* **Sickened:** The target has disadvantage on attack rolls and ability checks. At the end of each of its turns, it can make another Wisdom saving throw, ending this effect on a successful save."
  },
  {
    "name": "Eyebite",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "Concentration, up to 1 minute",
    "description": "For the spell's duration, your eyes become an inky void imbued with dread power. One creature of your choice within 60 feet of you that you can see must succeed on a wisdom saving throw or be affected by one of the following effects of your choice for the duration. On each of your turns until the spell ends, you can use your action to target another creature but can't target a creature again if it has succeeded on a saving throw against this casting of eyebite.\n\n**Asleep.** The target falls unconscious. It wakes up if it takes any damage or if another creature uses its action to shake the sleeper awake.\n\n**Panicked.** The target is frightened of you. On each of its turns, the frightened creature must take the Dash action and move away from you by the safest and shortest available route, unless there is nowhere to move. If the target moves to a place at least 60 feet away from you where it can no longer see you, this effect ends\n\n **Sickened.** The target has disadvantage on attack rolls and ability checks. At the end of each of its turns, it can make another wisdom saving throw. If it succeeds, the effect ends."
  },
  {
    "name": "Fault Line",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "permanent",
    "description": "The ground thrusts sharply upward along a 5-foot-wide, 60‐foot-long line that you designate. All spaces affected by the spell become difficult terrain. In addition, all creatures in the affected area are knocked prone and take 8d6 bludgeoning damage. Creatures that make a successful Dexterity saving throw take half as much damage and are not knocked prone. This spell doesn’t damage permanent structures."
  },
  {
    "name": "Find the Path",
    "level": 6,
    "school": "Divination",
    "casting_time": "1 minute",
    "range": "0 feet",
    "components": "M",
    "duration": "Concentration, up to 1 day",
    "description": "Name a specific, immovable location that you have visited before. If no such location is within range, the spell fails. For the duration, you know the location's direction and distance. While you are traveling there, you have advantage on ability checks made to determine the shortest path."
  },
  {
    "name": "Find the Path",
    "level": 6,
    "school": "Divination",
    "casting_time": "1 minute",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 24 hours",
    "description": "This spell allows you to find the shortest, most direct physical route to a specific fixed location that you are familiar with on the same plane of existence. If you name a destination on another plane of existence, a destination that moves (such as a mobile fortress), or a destination that isn't specific (such as \"a green dragon's lair\"), the spell fails. For the duration, as long as you are on the same plane of existence as the destination, you know how far it is and in what direction it lies. While you are traveling there, whenever you are presented with a choice of paths along the way, you automatically determine which path is the shortest and most direct route (but not necessarily the safest route) to the destination."
  },
  {
    "name": "Firewalk",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "",
    "duration": "Concentration, up to 10 minutes",
    "description": "The creature you cast **firewalk** on becomes immune to fire damage. In addition, that creature can walk along any burning surface, such as a burning wall or burning oil spread on water, as if it were solid and horizontal. Even if there is no other surface to walk on, the creature can walk along the tops of the flames."
  },
  {
    "name": "Flesh to Stone",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "The target becomes restrained as it begins to turn to stone. On a successful saving throw, the target is instead slowed until the end of its next turn and the spell ends.\n\nA creature restrained by this spell makes a second saving throw at the end of its turn. On a success, the spell ends. On a failure, the target is petrified for the duration. If you maintain concentration for the maximum duration of the spell, this petrification is permanent.\n\nAny pieces removed from a petrified creature are missing when the petrification ends."
  },
  {
    "name": "Flesh to Stone",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You attempt to turn one creature that you can see within range into stone. If the target's body is made of flesh, the creature must make a constitution saving throw. On a failed save, it is restrained as its flesh begins to harden. On a successful save, the creature isn't affected. A creature restrained by this spell must make another constitution saving throw at the end of each of its turns. If it successfully saves against this spell three times, the spell ends. If it fails its saves three times, it is turned to stone and subjected to the petrified condition for the duration. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind. If the creature is physically broken while petrified, it suffers from similar deformities if it reverts to its original state. If you maintain your concentration on this spell for the entire possible duration, the creature is turned to stone until the effect is removed."
  },
  {
    "name": "Forbiddance",
    "level": 6,
    "school": "Abjuration",
    "casting_time": "10 minutes",
    "range": "Touch",
    "components": "M",
    "duration": "1 day",
    "description": "You protect the target area against magical travel. Creatures can't teleport into the area, use a magical portal to enter it, or travel into it from another plane of existence, such as the Astral or Ethereal Plane. The spell's area can't overlap with another _forbiddance_ spell.\n\nThe spell damages specific types of trespassing creatures. Choose one or more of celestials, elementals, fey, fiends, and undead. When a chosen creature first enters the area on a turn or starts its turn there, it takes 5d10 radiant or necrotic damage (your choice when you cast the spell). You may designate a password. A creature speaking this password as it enters takes no damage from the spell.\n\nAfter casting this spell on the same area for 30 consecutive days it becomes permanent until dispelled. This final casting to make the spell permanent consumes its material components."
  },
  {
    "name": "Forbiddance",
    "level": 6,
    "school": "Abjuration",
    "casting_time": "10 minutes",
    "range": "Touch",
    "components": "M",
    "duration": "24 hours",
    "description": "You create a ward against magical travel that protects up to 40,000 square feet of floor space to a height of 30 feet above the floor. For the duration, creatures can't teleport into the area or use portals, such as those created by the gate spell, to enter the area. The spell proofs the area against planar travel, and therefore prevents creatures from accessing the area by way of the Astral Plane, Ethereal Plane, Feywild, Shadowfell, or the plane shift spell. In addition, the spell damages types of creatures that you choose when you cast it. Choose one or more of the following: celestials, elementals, fey, fiends, and undead. When a chosen creature enters the spell's area for the first time on a turn or starts its turn there, the creature takes 5d10 radiant or necrotic damage (your choice when you cast this spell). When you cast this spell, you can designate a password. A creature that speaks the password as it enters the area takes no damage from the spell. The spell's area can't overlap with the area of another forbiddance spell. If you cast forbiddance every day for 30 days in the same location, the spell lasts until it is dispelled, and the material components are consumed on the last casting."
  },
  {
    "name": "Freezing Sphere",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "A freezing globe streaks to a point within range and explodes, dealing 10d6 cold damage to creatures in the area. Liquid in the area is frozen to a depth of 6 inches for 1 minute. Any creature caught in the ice can use an action to make a Strength check against your spell save DC to escape.\n\nInstead of firing the globe, you can hold it in your hand. If you handle it carefully, it won't explode until a minute after you cast the spell. At any time, you or another creature can strike the globe, throw it up to 60 feet, or use it as a slingstone, causing it to explode on impact."
  },
  {
    "name": "Freezing Sphere",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "300 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "A frigid globe of cold energy streaks from your fingertips to a point of your choice within range, where it explodes in a 60-foot-radius sphere. Each creature within the area must make a constitution saving throw. On a failed save, a creature takes 10d6 cold damage. On a successful save, it takes half as much damage. If the globe strikes a body of water or a liquid that is principally water (not including water-based creatures), it freezes the liquid to a depth of 6 inches over an area 30 feet square. This ice lasts for 1 minute. Creatures that were swimming on the surface of frozen water are trapped in the ice. A trapped creature can use an action to make a Strength check against your spell save DC to break free. You can refrain from firing the globe after completing the spell, if you wish. A small globe about the size of a sling stone, cool to the touch, appears in your hand. At any time, you or a creature you give the globe to can throw the globe (to a range of 40 feet) or hurl it with a sling (to the sling's normal range). It shatters on impact, with the same effect as the normal casting of the spell. You can also set the globe down without shattering it. After 1 minute, if the globe hasn't already shattered, it explodes."
  },
  {
    "name": "Gale",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "1 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "You summon a storm to batter your oncoming enemies. Until the spell ends, freezing rain and turbulent winds fill a 20-foot-tall cylinder with a 300- foot radius centered on a point you choose within range. You must be outdoors to cast this spell. Moving to a place where you don't have a clear path to the sky ends the spell early.\n  The spell's area is heavily obscured, and exposed flames in the area are doused. The ground in the area becomes slick, difficult terrain, and a flying creature in the area must land at the end of its turn or fall. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Constitution saving throw as the wind and rain assail it. On a failed save, the creature takes 1d6 cold damage.\n  If a creature is concentrating in the spell's area, the creature must make a successful Constitution saving throw against your spell save DC or lose concentration."
  },
  {
    "name": "Globe of Invulnerability",
    "level": 6,
    "school": "Abjuration",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "An immobile, glimmering sphere forms around you. Any spell of 5th-level or lower cast from outside the sphere can't affect anything inside the sphere, even if it's cast with a higher level spell slot. Targeting something inside the sphere or including the globe's space in an area has no effect on anything inside."
  },
  {
    "name": "Globe of Invulnerability",
    "level": 6,
    "school": "Abjuration",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "An immobile, faintly shimmering barrier springs into existence in a 10-foot radius around you and remains for the duration. Any spell of 5th level or lower cast from outside the barrier can't affect creatures or objects within it, even if the spell is cast using a higher level spell slot. Such a spell can target creatures and objects within the barrier, but the spell has no effect on them. Similarly, the area within the barrier is excluded from the areas affected by such spells."
  },
  {
    "name": "Guards and Wards",
    "level": 6,
    "school": "Abjuration",
    "casting_time": "10 minutes",
    "range": "Touch",
    "components": "M",
    "duration": "24 hours",
    "description": "You create wards that protect the target area. Each warded area has a maximum height of 20 feet and can be shaped. Several stories of a stronghold can be warded by dividing the area among them if you can walk from one to the next while the spell is being cast.\n\nWhen cast, you can create a password that can make a creature immune to these effects when it is spoken aloud. You may also specify individuals that are unaffected by any or all of the effects that you choose.\n\n_Guards and wards_ creates the following effects within the area of the spell.\n\n* **_Corridors:_** Corridors are heavily obscured with fog. Additionally, creatures that choose between multiple passages or branches have a 50% chance to unknowingly choose a path other than the one they meant to choose.\n* **_Doors:_** Doors are magically locked as if by an _arcane lock_ spell. Additionally, you may conceal up to 10 doors with an illusion as per the illusory object component of the _minor illusion_ spell to make the doors appear as unadorned wall sections.</ li>\n* **_Stairs:_** Stairs are filled from top to bottom with webs as per the _web_ spell. Until the spell ends, the webbing strands regrow 10 minutes after they are damaged or destroyed.\n\nIn addition, one of the following spell effects can be placed within the spell's area.\n\n* _Dancing lights_ can be placed in 4 corridors and you can choose for them to repeat a simple sequence.\n* _Magic mouth_ spells can be placed in 2 locations.\n_Stinking clouds_ can be placed in 2 locations.\n\nThe clouds return after 10 minutes if dispersed while the spell remains.\n* A _gust of wind_ can be placed in a corridor or room.\n* Pick a 5-foot square. Any creature that passes through it subjected to a _suggestion_ spell, hearing the suggestion mentally.\n\nThe entirety of the warded area radiates as magic. Each effect must be targeted by separate dispel magic spells to be removed.\n\nThe spell can be made permanent by recasting the spell every day for a year."
  },
  {
    "name": "Guards and Wards",
    "level": 6,
    "school": "Abjuration",
    "casting_time": "10 minutes",
    "range": "Touch",
    "components": "M",
    "duration": "24 hours",
    "description": "You create a ward that protects up to 2,500 square feet of floor space (an area 50 feet square, or one hundred 5-foot squares or twenty-five 10-foot squares). The warded area can be up to 20 feet tall, and shaped as you desire. You can ward several stories of a stronghold by dividing the area among them, as long as you can walk into each contiguous area while you are casting the spell. When you cast this spell, you can specify individuals that are unaffected by any or all of the effects that you choose. You can also specify a password that, when spoken aloud, makes the speaker immune to these effects. Guards and wards creates the following effects within the warded area.\n\n**Corridors.** Fog fills all the warded corridors, making them heavily obscured. In addition, at each intersection or branching passage offering a choice of direction, there is a 50 percent chance that a creature other than you will believe it is going in the opposite direction from the one it chooses.\n\n**Doors.** All doors in the warded area are magically locked, as if sealed by an arcane lock spell. In addition, you can cover up to ten doors with an illusion (equivalent to the illusory object function of the minor illusion spell) to make them appear as plain sections of wall\n\n **Stairs.** Webs fill all stairs in the warded area from top to bottom, as the web spell. These strands regrow in 10 minutes if they are burned or torn away while guards and wards lasts.\n\n**Other Spell Effect.** You can place your choice of one of the following magical effects within the warded area of the stronghold. \n- Place dancing lights in four corridors. You can designate a simple program that the lights repeat as long as guards and wards lasts. \n- Place magic mouth in two locations. \n- Place stinking cloud in two locations. The vapors appear in the places you designate; they return within 10 minutes if dispersed by wind while guards and wards lasts. \n- Place a constant gust of wind in one corridor or room. \n- Place a suggestion in one location. You select an area of up to 5 feet square, and any creature that enters or passes through the area receives the suggestion mentally. The whole warded area radiates magic. A dispel magic cast on a specific effect, if successful, removes only that effect. You can create a permanently guarded and warded structure by casting this spell there every day for one year."
  },
  {
    "name": "Harm",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You assail a target with an agonizing disease. The target takes 14d6 necrotic damage. If it fails its saving throw its hit point maximum is reduced by an amount equal to the damage taken for 1 hour or until the disease is magically cured. This spell cannot reduce a target to less than 1 hit point."
  },
  {
    "name": "Harm",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You unleash a virulent disease on a creature that you can see within range. The target must make a constitution saving throw. On a failed save, it takes 14d6 necrotic damage, or half as much damage on a successful save. The damage can't reduce the target's hit points below 1. If the target fails the saving throw, its hit point maximum is reduced for 1 hour by an amount equal to the necrotic damage it took. Any effect that removes a disease allows a creature's hit point maximum to return to normal before that time passes."
  },
  {
    "name": "Heal",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "A torrent of healing energy suffuses the target and it regains 70 hit points. The spell also ends blindness, deafness, and any diseases afflicting the target."
  },
  {
    "name": "Heal",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "Choose a creature that you can see within range. A surge of positive energy washes through the creature, causing it to regain 70 hit points. This spell also ends blindness, deafness, and any diseases affecting the target. This spell has no effect on constructs or undead."
  },
  {
    "name": "Heavenly Crown",
    "level": 6,
    "school": "Enchantment",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "A glowing, golden crown appears on your head and sheds dim light in a 30-foot radius. When you cast the spell (and as a bonus action on subsequent turns, until the spell ends), you can target one willing creature within 30 feet of you that you can see. If the target can hear you, it can use its reaction to make one melee weapon attack and then move up to half its speed, or vice versa."
  },
  {
    "name": "Heroes' Feast",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "10 minutes",
    "range": "30 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "The spell summons forth a sumptuous feast with a cuisine of your choosing that provides 1 Supply for a number of creatures equal to twice your proficiency bonus. Consuming the food takes 1 hour and leaves a creature feeling nourished—it immediately makes a saving throw with advantage against any disease or poison it is suffering from, and it is cured of any effect that frightens it.\n\nFor up to 24 hours afterward the feast's participants have advantage on Wisdom saving throws, advantage on saving throws made against disease and poison, resistance against damage from poison and disease, and each increases its hit point maximum by 2d10."
  },
  {
    "name": "Heroes' Feast",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "10 minutes",
    "range": "30 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "You bring forth a great feast, including magnificent food and drink. The feast takes 1 hour to consume and disappears at the end of that time, and the beneficial effects don't set in until this hour is over. Up to twelve other creatures can partake of the feast. A creature that partakes of the feast gains several benefits. The creature is cured of all diseases and poison, becomes immune to poison and being frightened, and makes all wisdom saving throws with advantage. Its hit point maximum also increases by 2d10, and it gains the same number of hit points. These benefits last for 24 hours."
  },
  {
    "name": "Icy Manipulation",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "One creature you can see within range must make a Constitution saving throw. On a failed save, the creature is petrified (frozen solid). A petrified creature can repeat the saving throw at the end of each of its turns, ending the effect on itself if it makes two successful saves. If a petrified creature gets two failures on the saving throw (not counting the original failure that caused the petrification), the petrification becomes permenant.\n\nThe petrification also becomes permanent if you maintain concentration on this spell for a full minute. A permanently petrified/frozen creature can be restored to normal with [greater restoration](https://api.open5e.com/spells/greater-restoration) or comparable magic, or by casting this spell on the creature again and maintaining concentration for a full minute.\n\nIf the frozen creature is damaged or broken before it recovers from being petrified, the injury carries over to its normal state."
  },
  {
    "name": "Infernal Weapon",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 bonus action",
    "range": "Self",
    "components": "",
    "duration": "10 minutes",
    "description": "A weapon formed from the essence of Hell appears in your hands. You must use two hands to wield the weapon. If you let go of the weapon, it disappears and the spell ends.\n\nWhen you cast the spell, choose either a flame fork or ice spear. While the spell lasts, you can use an action to make a melee spell attack with the weapon against a creature within 10 feet of you.\n\nOn a hit, you deal 5d8 damage of a type determined by the weapon's form. On a critical hit, you inflict an additional effect.\n\nIn addition, on a hit with the infernal weapon, you can end the spell early to inflict an automatic critical hit.\n\n**Flame Fork.** The weapon deals fire damage.\n\nOn a critical hit, the target catches fire, taking 2d6 ongoing fire damage.\n\n**Ice Spear.** The weapon deals cold damage. On a critical hit, for 1 minute the target is slowed.\n\nAt the end of each of its turns a slowed creature can make a Constitution saving throw, ending the effect on itself on a success.\n\nA creature reduced to 0 hit points by an infernal weapon immediately dies in a gruesome fashion.\n\nFor example, a creature killed by an ice spear might freeze solid, then shatter into a thousand pieces. Each creature of your choice within 60 feet of the creature and who can see it when it dies must make a Wisdom saving throw. On a failure, a creature becomes frightened of you until the end of your next turn."
  },
  {
    "name": "Instant Armored Vehicle",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "You transform a handful of materials into a Huge armored vehicle. The vehicle can take whatever form you want, but it has AC 18 and 100 hit points. If it is reduced to 0 hit points, it is destroyed. If it is a ground vehicle, it has a speed of 90 feet. If it is an airborne vehicle, it has a flying speed of 45 feet. If it is a waterborne vehicle, it has a speed of 2 miles per hour. The vehicle can hold up to four Medium creatures within it.\n  A creature inside it has three-quarters cover from attacks outside the vehicle, which contains arrow slits, portholes, and other small openings. A creature piloting the armored vehicle can take the Careen action. To do so, the vehicle must move at least 10 feet in a straight line and enter or pass through the space of at least one Large or smaller creature. This movement doesn't provoke opportunity attacks. Each creature in the armored vehicle's path must make a Dexterity saving throw against your spell save DC. On a failed save, the creature takes 5d8 bludgeoning damage and is knocked prone. On a successful save, the creature can choose to be pushed 5 feet away from the space through which the vehicle passed. A creature that chooses not to be pushed suffers the consequences of a failed saving throw. If the creature piloting the armored vehicle isn't proficient in land, water, or air vehicles (whichever is appropriate for the vehicle's type), each target has advantage on the saving throw against the Careen action."
  },
  {
    "name": "Instant Summons",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "Touch",
    "components": "M",
    "duration": "permanent",
    "description": "Until the spell ends, a mystical bond connects the target and the precious stone used to cast this spell.\n\nAny time after, you may crush the stone and speak the name of the item, summoning it instantly into your hand no matter the physical, metaphysical, or planar distances involved, at which point the spell ends. If another creature is holding the item when the stone is crushed, the item is not summoned to you. Instead, the spell grants you the knowledge of who possesses it and a general idea of the creature's location.\n\nEach time you cast this spell, you must use a different precious stone.\n\nDispel magic or a similar effect targeting the stone ends the spell."
  },
  {
    "name": "Instant Summons",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "Touch",
    "components": "M",
    "duration": "until dispelled",
    "description": "You touch an object weighing 10 pounds or less whose longest dimension is 6 feet or less. The spell leaves an invisible mark on its surface and invisibly inscribes the name of the item on the sapphire you use as the material component. Each time you cast this spell, you must use a different sapphire. At any time thereafter, you can use your action to speak the item's name and crush the sapphire. The item instantly appears in your hand regardless of physical or planar distances, and the spell ends. If another creature is holding or carrying the item, crushing the sapphire doesn't transport the item to you, but instead you learn who the creature possessing the object is and roughly where that creature is located at that moment. Dispel magic or a similar effect successfully applied to the sapphire ends this spell's effect."
  },
  {
    "name": "Irresistible Dance",
    "level": 6,
    "school": "Enchantment",
    "casting_time": "1 action",
    "range": "30 feet",
    "components": "",
    "duration": "Concentration, up to 1 minute",
    "description": "You murmur a tune that takes root in the target's mind until the spell ends, forcing it to caper, dance, and shuffle. At the start of each of its turns, the dancing target must use all of its movement to dance in its space, and it has disadvantage on attack rolls and saving throws. Attacks made against the target have advantage. On each of its turns, the target can use an action to repeat the saving throw, ending the spell on a successful save."
  },
  {
    "name": "Irresistible Dance",
    "level": 6,
    "school": "Enchantment",
    "casting_time": "1 action",
    "range": "30 feet",
    "components": "",
    "duration": "Concentration, up to 1 minute",
    "description": "Choose one creature that you can see within range. The target begins a comic dance in place: shuffling, tapping its feet, and capering for the duration. Creatures that can't be charmed are immune to this spell. A dancing creature must use all its movement to dance without leaving its space and has disadvantage on dexterity saving throws and attack rolls. While the target is affected by this spell, other creatures have advantage on attack rolls against it. As an action, a dancing creature makes a wisdom saving throw to regain control of itself. On a successful save, the spell ends."
  },
  {
    "name": "Ley Whip",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 bonus action",
    "range": "Self",
    "components": "",
    "duration": "1 minute",
    "description": "You channel the power of a ley line within 1 mile into a crackling tendril of multicolored ley energy. The tendril extends from your hand but doesn't interfere with your ability to hold or manipulate objects. When you cast the spell and as a bonus action on subsequent turns, you can direct the tendril to strike a target within 50 feet of you. Make a melee spell attack; on a hit, the tendril does 3d8 force damage and the target must make a Strength saving throw. If the saving throw fails, you can push the target away or pull it closer, up to 10 feet in either direction. Special. A geomancer with a bound ley line can cast this spell as long as he or she is on the same plane as the bound line."
  },
  {
    "name": "Life Drain",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "90 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "With a snarled word of Void Speech, you create a swirling vortex of purple energy. Choose a point you can see within range. Creatures within 15 feet of the point take 10d6 necrotic damage, or half that damage with a successful Constitution saving throw. For each creature damaged by the spell, you can choose one other creature within range, including yourself, that is not a construct or undead. The secondary targets regain hit points equal to half the necrotic damage you dealt."
  },
  {
    "name": "Magic Jar",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 minute",
    "range": "120 feet",
    "components": "M",
    "duration": "permanent",
    "description": "Your body becomes catatonic as your soul enters the vessel used as a material component. While within this vessel, you're aware of your surroundings as if you physically occupied the same space.\n\nThe only action you can take is to project your soul within range, whether to return to your living body (and end the spell) or to possess a humanoid.\n\nYou may not target creatures protected by protection from good and evil or magic circle spells. A creature you try to possess makes a Charisma saving throw or your soul moves from your vessel and into its body. The creature's soul is now within the container. On a successful save, the creature resists and you may not attempt to possess it again for 24 hours.\n\nOnce you possess a creature, you have control of it. Replace your game statistics with the creature's, except your Charisma, Intelligence and Wisdom scores. Your own cultural traits and class features also remain, and you may not use the creature's cultural traits or class features (if it has any).\n\nDuring possession, you can use an action to return to the vessel if it is within range, returning the host creature to its body. If the host body dies while you are possessing it, the creature also dies and you must make a Charisma save. On a success you return to the container if it's within range. Otherwise, you die.\n\nIf the vessel is destroyed, the spell ends and your soul returns to your body if it's within range. If your body is out of range or dead when you try to return, you die.\n\nThe possessed creature perceives the world as if it occupied the same space as the vessel, but may not take any actions or movement. If the vessel is destroyed while occupied by a creature other than yourself, the creature returns to its body if the body is alive and within range. Otherwise, the creature dies.\n\nThe vessel is destroyed when the spell ends."
  },
  {
    "name": "Magic Jar",
    "level": 6,
    "school": "Necromancy",
    "casting_time": "1 minute",
    "range": "Self",
    "components": "M",
    "duration": "until dispelled",
    "description": "Your body falls into a catatonic state as your soul leaves it and enters the container you used for the spell's material component. While your soul inhabits the container, you are aware of your surroundings as if you were in the container's space. You can't move or use reactions. The only action you can take is to project your soul up to 100 feet out of the container, either returning to your living body (and ending the spell) or attempting to possess a humanoids body. You can attempt to possess any humanoid within 100 feet of you that you can see (creatures warded by a protection from evil and good or magic circle spell can't be possessed). The target must make a charisma saving throw. On a failure, your soul moves into the target's body, and the target's soul becomes trapped in the container. On a success, the target resists your efforts to possess it, and you can't attempt to possess it again for 24 hours. Once you possess a creature's body, you control it. Your game statistics are replaced by the statistics of the creature, though you retain your alignment and your Intelligence, Wisdom, and Charisma scores. You retain the benefit of your own class features. If the target has any class levels, you can't use any of its class features. Meanwhile, the possessed creature's soul can perceive from the container using its own senses, but it can't move or take actions at all. While possessing a body, you can use your action to return from the host body to the container if it is within 100 feet of you, returning the host creature's soul to its body. If the host body dies while you're in it, the creature dies, and you must make a charisma saving throw against your own spellcasting DC. On a success, you return to the container if it is within 100 feet of you. Otherwise, you die. If the container is destroyed or the spell ends, your soul immediately returns to your body. If your body is more than 100 feet away from you or if your body is dead when you attempt to return to it, you die. If another creature's soul is in the container when it is destroyed, the creature's soul returns to its body if the body is alive and within 100 feet. Otherwise, that creature dies. When the spell ends, the container is destroyed."
  },
  {
    "name": "Mass Suggestion",
    "level": 6,
    "school": "Enchantment",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "24 hours",
    "description": "Creatures that cannot be charmed are immune to this spell. Suggest an activity phrased in a sentence or two. The targets are magically influenced to follow that course of activity. The suggestion must be worded to sound reasonable. Asking the targets to perform an action that is obviously harmful to them ends the spell.\n\nA target carries out the activity suggested by you as well as it can. The activity can last for the duration of the spell, and if it requires less time the spell ends after a target has carried out the activity.\n\nYou may specify trigger conditions that cause a target to perform a specific activity while the spell lasts. For example, you may suggest that the target takes off its clothes and dives the next time it sees a body of water. If the target does not see a body of water before the spell ends, the specific activity isn't performed.\n\nAny damage done to a target by you or an ally ends the spell for that creature."
  },
  {
    "name": "Mass Suggestion",
    "level": 6,
    "school": "Enchantment",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "24 hours",
    "description": "You suggest a course of activity (limited to a sentence or two) and magically influence up to twelve creatures of your choice that you can see within range and that can hear and understand you. Creatures that can't be charmed are immune to this effect. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act automatically negates the effect of the spell. Each target must make a wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability. The suggested course of action can continue for the entire duration. If the suggested activity can be completed in a shorter time, the spell ends when the subject finishes what it was asked to do. You can also specify conditions that will trigger a special activity during the duration. For example, you might suggest that a group of soldiers give all their money to the first beggar they meet. If the condition isn't met before the spell ends, the activity isn't performed. If you or any of your companions damage a creature affected by this spell, the spell ends for that creature."
  },
  {
    "name": "Mind Maze",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "up to 1 minute",
    "description": "Choose a creature you can see within range. It must succeed on an Intelligence saving throw or be mentally trapped in an imagined maze of mirrors for the duration. While trapped in this way, the creature is incapacitated, but it imagines itself alone and wandering through the maze. Externally, it appears dazed as it turns in place and reaches out at nonexistent barriers. Each time the target takes damage, it makes another Intelligence saving throw. On a success, the spell ends."
  },
  {
    "name": "Move Earth",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 2 hours",
    "description": "You reshape the area, changing its elevation or creating and eliminating holes, walls, and pillars.\n\nThe only limitation is that the elevation change may not exceed half the area's horizontal dimensions.\n\nFor example, affecting a 40-by-40 area allows you to include 20 foot high pillars, holes 20 feet deep, and changes in terrain elevation of 20 feet or less.\n\nChanges that result in unstable terrain are subject to collapse.\n\nChanges take 10 minutes to complete, after which you can choose another area to affect. Due to the slow speed of transformation, it is nearly impossible for creatures to be hurt or captured by the spell.\n\nThis spell has no effect on stone, objects crafted from stone, or plants, though these objects will shift based on changes in the area."
  },
  {
    "name": "Move Earth",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 2 hours",
    "description": "Choose an area of terrain no larger than 40 feet on a side within range. You can reshape dirt, sand, or clay in the area in any manner you choose for the duration. You can raise or lower the area's elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can't exceed half the area's largest dimension. So, if you affect a 40-foot square, you can create a pillar up to 20 feet high, raise or lower the square's elevation by up to 20 feet, dig a trench up to 20 feet deep, and so on. It takes 10 minutes for these changes to complete. At the end of every 10 minutes you spend concentrating on the spell, you can choose a new area of terrain to affect. Because the terrain's transformation occurs slowly, creatures in the area can't usually be trapped or injured by the ground's movement. This spell can't manipulate natural stone or stone construction. Rocks and structures shift to accommodate the new terrain. If the way you shape the terrain would make a structure unstable, it might collapse. Similarly, this spell doesn't directly affect plant growth. The moved earth carries any plants along with it."
  },
  {
    "name": "Pincer",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You force your enemies into a tight spot. Choose two points you can see within range. The points must be at least 30 feet apart from each other. Each point then emits a thunderous boom in a 30-foot cone in the direction of the other point. The boom is audible out to 300 feet.\n  Each creature within a cone must make a Constitution saving throw. On a failed save, a creature takes 5d10 thunder damage and is pushed up to 10 feet away from the point that emitted the cone. On a successful save, the creature takes half as much damage and isn't pushed. Objects that aren't being worn or carried within each cone are automatically pushed."
  },
  {
    "name": "Planar Ally",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "10 minutes",
    "range": "60 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "An entity from beyond the realm material answers your call for assistance. You must know this entity whether it is holy, unholy, or beyond the bounds of mortal comprehension. The entity sends forth a servant loyal to it to aid you in your endeavors. If you have a specific servant in mind you may speak its name during the casting, but ultimately who is sent to answer your call is the entity's decision.\n\nThe creature that appears (a celestial, elemental, fey, or fiend), is under no compulsion to behave in any particular way other than how its nature and personality direct it. Any request made of the creature, simple or complex, requires an equal amount of payment which you must bargain with the creature to ascertain. The creature can request either items, sacrifices, or services in exchange for its assistance. A creature that you cannot communicate with cannot be bargained with.\n\nA task that can be completed in minutes is worth 100 gold per minute, a task that requires hours is worth 1, 000 gold per hour, and a task requiring days is worth 10, 000 gold per day (the creature can only accept tasks contained within a 10 day timeframe). A creature can often be persuaded to lower or raise prices depending on how a task aligns with its personality and the goals of its master —some require no payment at all if the task is deemed worthy. Additionally, a task that poses little or no risk only requires half the usual amount of payment, and an extremely dangerous task might call for double the usual payment. Still, only extreme circumstances will cause a creature summoned this way to accept tasks with a near certain result of death.\n\nA creature returns to its place of origin when a task is completed or if you fail to negotiate an agreeable task and payment. Should a creature join your party, it counts as a member of the group and receives a full portion of any experience gained."
  },
  {
    "name": "Planar Ally",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "10 minutes",
    "range": "60 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You beseech an otherworldly entity for aid. The being must be known to you: a god, a primordial, a demon prince, or some other being of cosmic power. That entity sends a celestial, an elemental, or a fiend loyal to it to aid you, making the creature appear in an unoccupied space within range. If you know a specific creature's name, you can speak that name when you cast this spell to request that creature, though you might get a different creature anyway (DM's choice). When the creature appears, it is under no compulsion to behave in any particular way. You can ask the creature to perform a service in exchange for payment, but it isn't obliged to do so. The requested task could range from simple (fly us across the chasm, or help us fight a battle) to complex (spy on our enemies, or protect us during our foray into the dungeon). You must be able to communicate with the creature to bargain for its services. Payment can take a variety of forms. A celestial might require a sizable donation of gold or magic items to an allied temple, while a fiend might demand a living sacrifice or a gift of treasure. Some creatures might exchange their service for a quest undertaken by you. As a rule of thumb, a task that can be measured in minutes requires a payment worth 100 gp per minute. A task measured in hours requires 1,000 gp per hour. And a task measured in days (up to 10 days) requires 10,000 gp per day. The DM can adjust these payments based on the circumstances under which you cast the spell. If the task is aligned with the creature's ethos, the payment might be halved or even waived. Nonhazardous tasks typically require only half the suggested payment, while especially dangerous tasks might require a greater gift. Creatures rarely accept tasks that seem suicidal. After the creature completes the task, or when the agreed-upon duration of service expires, the creature returns to its home plane after reporting back to you, if appropriate to the task and if possible. If you are unable to agree on a price for the creature's service, the creature immediately returns to its home plane. A creature enlisted to join your group counts as a member of it, receiving a full share of experience points awarded."
  },
  {
    "name": "Programmed Illusion",
    "level": 6,
    "school": "Illusion",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "permanent",
    "description": "You craft an illusory object, creature, or other effect which executes a scripted performance when a specific condition is met within 30 feet of the area.\n\nYou must describe both the condition and the details of the performance upon casting. The trigger must be based on something that can be seen or heard.\n\nOnce the illusion triggers, it runs its performance for up to 5 minutes before it disappears and goes dormant for 10 minutes. The illusion is undetectable until then and only reactivates when the condition is triggered and after the dormant period has passed.\n\nA creature can use an action to attempt an Investigation check against your spell save DC to reveal the spell's illusory nature. Physical interactions reveal the illusion for what it is as things can pass through it with ease. A creature aware of the illusion perceives the image as transparent and the sounds it generates hollow."
  },
  {
    "name": "Programmed Illusion",
    "level": 6,
    "school": "Illusion",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "until dispelled",
    "description": "You create an illusion of an object, a creature, or some other visible phenomenon within range that activates when a specific condition occurs. The illusion is imperceptible until then. It must be no larger than a 30-foot cube, and you decide when you cast the spell how the illusion behaves and what sounds it makes. This scripted performance can last up to 5 minutes. When the condition you specify occurs, the illusion springs into existence and performs in the manner you described. Once the illusion finishes performing, it disappears and remains dormant for 10 minutes. After this time, the illusion can be activated again. The triggering condition can be as general or as detailed as you like, though it must be based on visual or audible conditions that occur within 30 feet of the area. For example, you could create an illusion of yourself to appear and warn off others who attempt to open a trapped door, or you could set the illusion to trigger only when a creature says the correct word or phrase. Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and any noise it makes sounds hollow to the creature."
  },
  {
    "name": "Robe of Shards",
    "level": 6,
    "school": "Abjuration",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "1 minute",
    "description": "Deep Magic: clockwork You create a robe of metal shards, gears, and cogs that provides a base AC of 14 + your Dexterity modifier. As a bonus action while protected by a robe of shards, you can command bits of metal from a fallen foe to be absorbed by your robe; each infusion of metal increases your AC by 1, to a maximum of 18 + Dexterity modifier. You can also use a bonus action to dispel the robe, causing it to explode into a shower of flying metal that does 8d6 slashing damage, +1d6 per point of basic (non-Dexterity) AC above 14, to all creatures within 30 feet of you."
  },
  {
    "name": "Seal Red Portal",
    "level": 6,
    "school": "Abjuration",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "until dispelled",
    "description": "You seal a Red Portal or other dimensional gate within range, rendering it inoperable until this spell is dispelled. While the portal remains sealed in this way, it cannot be found with the locate Red Portal spell."
  },
  {
    "name": "Shadow Spawn",
    "level": 6,
    "school": "Illusion",
    "casting_time": "4 hours",
    "range": "Touch",
    "components": "M",
    "duration": "instantaneous",
    "description": "Casting this spell consumes the corpse of a creature and creates a shadowy duplicate of it. The creature returns as a shadow beast. The shadow beast has dim memories of its former life and retains free will; casters are advised to be ready to make an attractive offer to the newly-risen shadow beast, to gain its cooperation."
  },
  {
    "name": "Sphere of Order",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "1 round",
    "description": "Deep Magic: clockwork You surround yourself with the perfect order of clockwork. Chaotic creatures that start their turn in the area or enter it on their turn take 5d8 psychic damage. The damage is 8d8 for Chaotic aberrations, celestials, elementals, and fiends. A successful Wisdom saving throw halves the damage, but Chaotic creatures (the only ones affected by the spell) make the saving throw with disadvantage."
  },
  {
    "name": "Sunbeam",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "Oozes and undead have disadvantage on saving throws made to resist this spell. A beam of radiant sunlight streaks from your hand. Each creature in the area takes 6d8 radiant damage and is blinded for 1 round.\n\nUntil the spell ends, you can use an action on subsequent turns to create a new beam of sunlight and a mote of brilliant radiance lingers on your hand, shedding bright light in a 30-foot radius and dim light an additional 30 feet. This light is sunlight."
  },
  {
    "name": "Sunbeam",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "A beam of brilliant light flashes out from your hand in a 5-foot-wide, 60-foot-long line. Each creature in the line must make a constitution saving throw. On a failed save, a creature takes 6d8 radiant damage and is blinded until your next turn. On a successful save, it takes half as much damage and isn't blinded by this spell. Undead and oozes have disadvantage on this saving throw. You can create a new line of radiance as your action on any turn until the spell ends. For the duration, a mote of brilliant radiance shines in your hand. It sheds bright light in a 30-foot radius and dim light for an additional 30 feet. This light is sunlight."
  },
  {
    "name": "Time Loop",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "30 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You capture a creature within range in a loop of time. The target is teleported to the space where it began its most recent turn. The target then makes a Wisdom saving throw. On a successful save, the spell ends. On a failed save, the creature must repeat the activities it undertook on its previous turn, following the sequence of moves and actions to the best of its ability. It doesn’t need to move along the same path or attack the same target, but if it moved and then attacked on its previous turn, its only option is to move and then attack on this turn. If the space where the target began its previous turn is occupied or if it’s impossible for the target to take the same action (if it cast a spell but is now unable to do so, for example), the target becomes incapacitated.\n\nAn affected target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. For as long as the spell lasts, the target teleports back to its starting point at the start of each of its turns, and it must repeat the same sequence of moves and actions."
  },
  {
    "name": "Toadstool Ring",
    "level": 6,
    "school": "Divination",
    "casting_time": "1 action",
    "range": "30 feet",
    "components": "M",
    "duration": "1 hour",
    "description": "You coax a toadstool ring to sprout from the ground. A creature of your choice can sit in the center of the ring and meditate for the duration, catching glimpses of the past, present, and future. The creature can ask up to three questions: one about the past, one about the present, and one about the future. The GM offers truthful answers in the form of dreamlike visions that may be subject to interpretation. When the spell ends, the toadstools turn black and dissolve back into the earth.\n  If you cast the spell two or more times before finishing your next long rest, there is a cumulative 25 percent chance for each casting after the first that the meditating creature gets a random vision unrelated to the question. The GM makes this roll in secret."
  },
  {
    "name": "Transport via Plants",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "",
    "duration": "1 round",
    "description": "You create a magical pathway between the target and a second plant that you've seen or touched before that is on the same plane of existence. Any creature can step into the target and exit from the second plant by using 5 feet of movement."
  },
  {
    "name": "Transport via Plants",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "10 feet",
    "components": "",
    "duration": "1 round",
    "description": "This spell creates a magical link between a Large or larger inanimate plant within range and another plant, at any distance, on the same plane of existence. You must have seen or touched the destination plant at least once before. For the duration, any creature can step into the target plant and exit from the destination plant by using 5 feet of movement."
  },
  {
    "name": "True Seeing",
    "level": 6,
    "school": "Divination",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "1 hour",
    "description": "Until the spell ends, the target gains truesight to a range of 120 feet. The target also notices secret doors hidden by magic."
  },
  {
    "name": "True Seeing",
    "level": 6,
    "school": "Divination",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "1 hour",
    "description": "This spell gives the willing creature you touch the ability to see things as they actually are. For the duration, the creature has truesight, notices secret doors hidden by magic, and can see into the Ethereal Plane, all out to a range of 120 feet."
  },
  {
    "name": "Vengeful Panopy of the Ley Line Ignited",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "10 minutes",
    "description": "Deep Magic: ley line While bound to a ley line, you draw directly from its power, becoming cloaked in a magical heliotropic fire that sheds dim light in a 10-foot radius. Additionally, each round, including the round it is cast, you may make a ranged spell attack as an action. On a hit, the target takes 6d6 force damage. Every 3 minutes the effect is active, your bond with the ley line is reduced by one step; a bond to a Titanic ley line becomes effectively a Strong, then a Weak, and after 10 minutes, the bond is broken. The strength of the bond is only restored after a long rest; if the bond was broken, it can only be restored at the next weakest level for a week. A bond broken from a Weak ley line cannot be restored for two weeks. Some believe this spell damages ley lines, and there is some evidence to support this claim. Additionally, whenever a creature within 5 feet hits you with a melee attack, the cloak erupts with a heliotropic flare. The attacker takes 3d6 force damage."
  },
  {
    "name": "Walk the Twisted Path",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "special",
    "description": "When you cast this spell, you and up to five creatures you can see within 20 feet of you enter a shifting landscape of endless walls and corridors that connect to many places throughout the world.\n\nYou can find your way to a destination within 100 miles, as long as you know for certain that your destination exists (though you don’t need to have seen or visited it before), and you must make a successful DC 20 Intelligence check. If you have the ability to retrace a path you have previously taken without making a check (as a minotaur or a goristro can), this check automatically succeeds. On a failed check, you don't find your path this round, and you and your companions each take 4d6 psychic damage as the madness of the shifting maze exacts its toll. You must repeat the check at the start of each of your turns until you find your way to your destination or until you die. In either event, the spell ends.\n\nWhen the spell ends, you and those traveling with you appear in a safe location at your destination."
  },
  {
    "name": "Wall of Flesh",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 10 minutes",
    "description": "A squirming wall of bodies, groping arms and tentacles, and moaning, biting mouths heaves itself up from the ground at a point you choose. The wall is 6 inches thick and is made up of a contiguous group of ten 10-foot square sections. The wall can have any shape you desire.\n\nIf the wall enters a creature's space when it appears, the creature makes a Dexterity saving throw, and on a success it moves up to its Speed to escape. On a failed save, it is swallowed by the wall (as below).\n\nWhen a creature enters the area for the first time on a turn or starts its turn within 10 feet of the wall, tentacles and arms reach out to grab it. The creature makes a Dexterity saving throw or takes 5d8 bludgeoning damage and becomes grappled. If the creature was already grappled by the wall at the start of its turn and fails its saving throw, a mouth opens in the wall and swallows the creature.\n\nA creature swallowed by the wall takes 5d8 ongoing bludgeoning damage and is blinded, deafened, and restrained.\n\nA creature grappled or restrained by the wall can use its action to make a Strength saving throw against your spell save DC. On a success, a grappled creature frees itself and a restrained creature claws its way out of the wall's space, exiting to an empty space next to the wall and still grappled."
  },
  {
    "name": "Wall of Ice",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 10 minutes",
    "description": "You create a wall of ice on a solid surface. You can form it into a hemispherical dome or a sphere, either with a radius of up to 10 feet. You may also choose to create a flat surface made up of a contiguous group of ten 10-foot square sections. The wall is 1 foot thick.\n\nIf the wall enters a creature's space when it appears, the creature is pushed to one side of it (your choice).\n\nIn addition, the creature makes a Dexterity saving throw, taking 10d6 cold damage on a failed save, or half as much damage on a success.\n\nThe wall is an object with vulnerability to fire damage, with AC 12 and 30 hit points per 10-foot section. Reducing a 10-foot section of wall to 0 hit points destroys it and leaves behind a sheet of frigid air in the space the section occupied. A creature moving through the sheet of frigid air for the first time on a turn makes a Constitution saving throw, taking 5d6 cold damage on a failed save, or half as much damage on a successful one."
  },
  {
    "name": "Wall of Ice",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 10 minutes",
    "description": "You create a wall of ice on a solid surface within range. You can form it into a hemispherical dome or a sphere with a radius of up to 10 feet, or you can shape a flat surface made up of ten 10-foot-square panels. Each panel must be contiguous with another panel. In any form, the wall is 1 foot thick and lasts for the duration. If the wall cuts through a creature's space when it appears, the creature within its area is pushed to one side of the wall and must make a dexterity saving throw. On a failed save, the creature takes 10d6 cold damage, or half as much damage on a successful save. The wall is an object that can be damaged and thus breached. It has AC 12 and 30 hit points per 10-foot section, and it is vulnerable to fire damage. Reducing a 10-foot section of wall to 0 hit points destroys it and leaves behind a sheet of frigid air in the space the wall occupied. A creature moving through the sheet of frigid air for the first time on a turn must make a constitution saving throw. That creature takes 5d6 cold damage on a failed save, or half as much damage on a successful one."
  },
  {
    "name": "Wall of Thorns",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 10 minutes",
    "description": "You create a wall of tough, pliable, tangled brush bristling with needle-sharp thorns on a solid surface. You can choose to make the wall up to 60 feet long, 10 feet high, and 5 feet thick or a circle that has a 20-foot diameter and is up to 20 feet high and 5 feet thick. The wall blocks line of sight.\n\nWhen the wall appears, each creature within its area makes a Dexterity saving throw, taking 7d8 piercing damage on a failed save, or half as much damage on a successful save.\n\nA creature can move through the wall, albeit slowly and painfully. For every 1 foot a creature moves through the wall, it must spend 4 feet of movement. The first time a creature enters the wall on a turn or ends its turn there, it makes a Dexterity saving throw, taking 7d8 slashing damage on a failed save, or half as much damage on a successful save."
  },
  {
    "name": "Wall of Thorns",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 10 minutes",
    "description": "You create a wall of tough, pliable, tangled brush bristling with needle-sharp thorns. The wall appears within range on a solid surface and lasts for the duration. You choose to make the wall up to 60 feet long, 10 feet high, and 5 feet thick or a circle that has a 20-foot diameter and is up to 20 feet high and 5 feet thick. The wall blocks line of sight. When the wall appears, each creature within its area must make a dexterity saving throw. On a failed save, a creature takes 7d8 piercing damage, or half as much damage on a successful save. A creature can move through the wall, albeit slowly and painfully. For every 1 foot a creature moves through the wall, it must spend 4 feet of movement. Furthermore, the first time a creature enters the wall on a turn or ends its turn there, the creature must make a dexterity saving throw. It takes 7d8 slashing damage on a failed save, or half as much damage on a successful one."
  },
  {
    "name": "Warp Mind and Matter",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "30 feet",
    "components": "M",
    "duration": "until cured or dispelled",
    "description": "A creature you can see within range undergoes a baleful transmogrification. The target must make a successful Wisdom saving throw or suffer a flesh warp and be afflicted with a form of indefinite madness."
  },
  {
    "name": "Wind Walk",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 minute",
    "range": "30 feet",
    "components": "M",
    "duration": "8 hours",
    "description": "The targets assume a gaseous form and appear as wisps of cloud. Each target has a flying speed of 300 feet and resistance to damage from nonmagical weapons, but the only action it can take is the Dash action or to revert to its normal form (a process that takes 1 minute during which it is incapacitated and can't move).\n\nUntil the spell ends, a target can change again to cloud form (in an identical transformation process).\n\nWhen the effect ends for a target flying in cloud form, it descends 60 feet each round for up to 1 minute or until it safely lands. If the target can't land after 1 minute, the creature falls the rest of the way normally."
  },
  {
    "name": "Wind Walk",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 minute",
    "range": "30 feet",
    "components": "M",
    "duration": "8 hours",
    "description": "You and up to ten willing creatures you can see within range assume a gaseous form for the duration, appearing as wisps of cloud. While in this cloud form, a creature has a flying speed of 300 feet and has resistance to damage from nonmagical weapons. The only actions a creature can take in this form are the Dash action or to revert to its normal form. Reverting takes 1 minute, during which time a creature is incapacitated and can't move. Until the spell ends, a creature can revert to cloud form, which also requires the 1-minute transformation. If a creature is in cloud form and flying when the effect ends, the creature descends 60 feet per round for 1 minute until it lands, which it does safely. If it can't land after 1 minute, the creature falls the remaining distance."
  },
  {
    "name": "Winter's Radiance",
    "level": 6,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "400 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "When you cast this spell, the piercing rays of a day’s worth of sunlight reflecting off fresh snow blankets the area. A creature caught in the spell’s area must succeed on a Constitution saving throw or have disadvantage on ranged attacks and Wisdom (Perception) checks for the duration of the spell. In addition, an affected creature’s vision is hampered such that foes it targets are treated as having three-quarters cover."
  },
  {
    "name": "Winterdark",
    "level": 6,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "",
    "duration": "Concentration, up to 1 hour",
    "description": "This spell invokes the deepest part of night on the winter solstice. You target a 40-foot-radius, 60-foot-high cylinder centered on a point within range, which is plunged into darkness and unbearable cold. Each creature in the area when you cast the spell and at the start of its turn must make a successful Constitution saving throw or take 1d6 cold damage and gain one level of exhaustion. Creatures immune to cold damage are also immune to the exhaustion effect, as are creatures wearing cold weather gear or otherwise adapted for a cold environment.\n\nAs a bonus action, you can move the center of the effect 20 feet."
  },
  {
    "name": "Word of Recall",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "5 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "The targets instantly teleport to a previously designated sanctuary, appearing in the nearest unoccupied space to the spot you designated when you prepared your sanctuary.\n\nYou must first designate a sanctuary by casting this spell within a location aligned with your faith, such as a temple dedicated to or strongly linked to your deity."
  },
  {
    "name": "Word of Recall",
    "level": 6,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "5 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You and up to five willing creatures within 5 feet of you instantly teleport to a previously designated sanctuary. You and any creatures that teleport with you appear in the nearest unoccupied space to the spot you designated when you prepared your sanctuary (see below). If you cast this spell without first preparing a sanctuary, the spell has no effect. You must designate a sanctuary by casting this spell within a location, such as a temple, dedicated to or strongly linked to your deity. If you attempt to cast the spell in this manner in an area that isn't dedicated to your deity, the spell has no effect."
  },
  {
    "name": "Wormway",
    "level": 6,
    "school": "Enchantment",
    "casting_time": "1 minute",
    "range": "150 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You call a Gargantuan monstrosity from the depths of the world to carry you and your allies across great distances. When you cast this spell, the nearest purple worm within range is charmed by you and begins moving toward a point on the ground that you can see. If there are no purple worms within range, the spell fails. The earth rumbles slightly as it approaches and breaks through the surface. Any creatures within 20 feet of that point must make a Dexterity saving throw or be knocked prone and pushed 10 feet away from it.\n\nUpon emerging, the purple worm lays down before you and opens its maw. Targets can climb inside where they are enclosed in an impervious hemispherical dome of force.\n\nOnce targets are loaded into the purple worm, nothing—not physical objects, energy, or other spell effects —can pass through the barrier, in or out, though targets in the sphere can breathe there. The hemisphere is immune to all damage, and creatures and objects inside can't be damaged by attacks or effects originating from outside, nor can a target inside the hemisphere damage anything outside it.\n\nThe atmosphere inside the dome is comfortable and dry regardless of conditions outside it.\n\nThe purple worm waits until you give it a mental command to depart, at which point it dives back into the ground and travels, without need for rest or food, as directly as possible while avoiding obstacles to a destination known to you. It travels 150 miles per day.\n\nWhen the purple worm reaches its destination it surfaces, the dome vanishes, and it disgorges the targets in its mouth before diving back into the depths again.\n\nThe purple worm remains charmed by you until it has delivered you to your destination and returned to the depths, or until it is attacked at which point the charm ends, it vomits its targets in the nearest unoccupied space as soon as possible, and then retreats to safety."
  },
  {
    "name": "Acid Gate",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You create a portal of swirling, acidic green vapor in an unoccupied space you can see. This portal connects with a target destination within 100 miles that you are personally familiar with and have seen with your own eyes, such as your wizard’s tower or an inn you have stayed at. You and up to three creatures of your choice can enter the portal and pass through it, arriving at the target destination (or within 10 feet of it, if it is currently occupied). If the target destination doesn’t exist or is inaccessible, the spell automatically fails and the gate doesn’t form.\n\nAny creature that tries to move through the gate, other than those selected by you when the spell was cast, takes 10d6 acid damage and is teleported 1d100 × 10 feet in a random, horizontal direction. If the creature makes a successful Intelligence saving throw, it can’t be teleported by this portal, but it still takes acid damage when it enters the acid-filled portal and every time it ends its turn in contact with it."
  },
  {
    "name": "Amplify Gravity",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "100 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "This spell intensifies gravity in a 50-foot-radius area within range. Inside the area, damage from falling is quadrupled (2d6 per 5 feet fallen) and maximum damage from falling is 40d6. Any creature on the ground in the area when the spell is cast must make a successful Strength saving throw or be knocked prone; the same applies to a creature that enters the area or ends its turn in the area. A prone creature in the area must make a successful Strength saving throw to stand up. A creature on the ground in the area moves at half speed and has disadvantage on Dexterity checks and ranged attack rolls."
  },
  {
    "name": "Angel Paradox",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "30 feet",
    "components": "",
    "duration": "7 days",
    "description": "The target is bombarded with a fraction of energy stolen from some slumbering, deific source, immediately taking 40 radiant damage. This spell ignores resistances but does not ignore immunities. A creature killed by this spell does not decay and cannot become undead for the spell's duration. Days spent under the influence of this spell don't count against the time limit of spells such as _raise dead_. This effect ends early if the corpse takes necrotic damage."
  },
  {
    "name": "Anomalous Object",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "1 minute",
    "description": "Deep Magic: temporal By touching an object, you retrieve another version of the object from elsewhere in time. If the object is attended, you must succeed on a melee spell attack roll against the creature holding or controlling the object. Any effect that affects the original object also affects the duplicate (charges spent, damage taken, etc.) and any effect that affects the duplicate also affects the original object. If either object is destroyed, both are destroyed. This spell does not affect sentient items or unique artifacts."
  },
  {
    "name": "Arcane Sword",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You summon an insubstantial yet deadly sword to do your bidding.\n\nMake a melee spell attack against a target of your choice within 5 feet of the sword, dealing 3d10 force damage on a hit.\n\nUntil the spell ends, you can use a bonus action on subsequent turns to move the sword up to 20 feet to a space you can see and make an identical melee spell attack against a target."
  },
  {
    "name": "Arcane Sword",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You create a sword-shaped plane of force that hovers within range. It lasts for the duration. When the sword appears, you make a melee spell attack against a target of your choice within 5 feet of the sword. On a hit, the target takes 3d10 force damage. Until the spell ends, you can use a bonus action on each of your turns to move the sword up to 20 feet to a spot you can see and repeat this attack against the same target or a different one."
  },
  {
    "name": "Aspect of the Dragon",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "This spell draws out the ancient nature within your blood, allowing you to assume the form of any dragon-type creature of challenge 10 or less.\n\nYou assume the hit points and Hit Dice of the new form. When you revert to your normal form, you return to the number of hit points you had before you transformed. If you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. As long as the excess damage doesn’t reduce your normal form to 0 hit points, you aren’t knocked unconscious.\n\nYou retain the benefits of any features from your class, race, or other source and can use them, provided that your new form is physically capable of doing so. You can speak only if the dragon can normally speak.\n\nWhen you transform, you choose whether your equipment falls to the ground, merges into the new form, or is worn by it. Worn equipment functions normally, but equipment doesn’t change shape or size to match the new form. Any equipment that the new form can’t wear must either fall to the ground or merge into the new form. The GM has final say on whether the new form can wear or use a particular piece of equipment. Equipment that merges has no effect in that state."
  },
  {
    "name": "Blizzard",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "100 feet",
    "components": "",
    "duration": "Concentration, up to 1 minute",
    "description": "A howling storm of thick snow and ice crystals appears in a cylinder 40 feet high and 40 feet in diameter within range. The area is heavily obscured by the swirling snow. When the storm appears, each creature in the area takes 8d8 cold damage, or half as much damage with a successful Constitution saving throw. A creature also makes this saving throw and takes damage when it enters the area for the first time on a turn or ends its turn there. In addition, a creature that takes cold damage from this spell has disadvantage on Constitution saving throws to maintain concentration until the start of its next turn."
  },
  {
    "name": "Celebration",
    "level": 7,
    "school": "Enchantment",
    "casting_time": "1 action",
    "range": "90 feet",
    "components": "M",
    "duration": "1 hour",
    "description": "You create a 30-foot-radius area around a point that you choose within range. An intelligent creature that enters the area or starts its turn there must make a Wisdom saving throw. On a failed save, the creature starts to engage in celebratory revelry: drinking, singing, laughing, and dancing. Affected creatures are reluctant to leave the area until the spell ends, preferring to continue the festivities. They forsake appointments, cease caring about their woes, and generally behave in a cordial (if not hedonistic) manner. This preoccupation with merrymaking occurs regardless of an affected creature’s agenda or alignment. Assassins procrastinate, servants join in the celebration rather than working, and guards abandon their posts.\n\nThe effect ends on a creature when it is attacked, takes damage, or is forced to leave the area. A creature that makes a successful saving throw can enter or leave the area without danger of being enchanted. A creature that fails the saving throw and is forcibly removed from the area must repeat the saving throw if it returns to the area."
  },
  {
    "name": "Clear the Board",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "You send your allies and your enemies to opposite sides of the battlefield. Pick a cardinal direction. With a shout and a gesture, you and up to five willing friendly creatures within range are teleported up to 90 feet in that direction to spaces you can see. At the same time, up to six hostile creatures within range must make a Wisdom saving throw. On a failed save, the hostile creature is teleported up to 90 feet in the opposite direction of where you teleport yourself and the friendly creatures to spaces you can see. You can't teleport a target into dangerous terrain, such as lava or off the edge of a cliff, and each target must be teleported to an unoccupied space that is on the ground or on a floor."
  },
  {
    "name": "Conjure Celestial",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "60 feet",
    "components": "",
    "duration": "Concentration, up to 1 hour",
    "description": "You summon a creature from the realms celestial.\n\nThis creature uses the statistics of a celestial creature (detailed below) with certain traits determined by your choice of its type: an angel of battle, angel of protection, or angel of vengeance.\n\nThe creature is friendly to you and your companions and takes its turn immediately after yours.\n\nIt obeys your verbal commands. Without such commands, the creature only defends itself.\n\nThe creature disappears when reduced to 0 hit points. If your concentration is broken before the spell ends, you lose control of the celestial creature, which becomes hostile and might attack you and your companions. An uncontrolled creature disappears 1 hour after you summoned it."
  },
  {
    "name": "Conjure Celestial",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "90 feet",
    "components": "",
    "duration": "Concentration, up to 1 hour",
    "description": "You summon a celestial of challenge rating 4 or lower, which appears in an unoccupied space that you can see within range. The celestial disappears when it drops to 0 hit points or when the spell ends. The celestial is friendly to you and your companions for the duration. Roll initiative for the celestial, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you), as long as they don't violate its alignment. If you don't issue any commands to the celestial, it defends itself from hostile creatures but otherwise takes no actions. The DM has the celestial's statistics."
  },
  {
    "name": "Conjure Greater Spectral Dead",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 hour",
    "description": "You summon an incorporeal undead creature that appears in an unoccupied space you can see within range. You choose one of the following options for what appears:\n* One [wraith](https://api.open5e.com/monsters/wraith)\n* One [spectral guardian](https://api.open5e.com/monsters/spectral-guardian)\n* One [wolf spirit swarm](https://api.open5e.com/monsters/wolf-spirit-swarm)\nSummoned creatures disappear when they drop to 0 hit points or when the spell ends.\n\nThe summoned creature doesn’t attack you or your companions for the duration. Roll initiative for the summoned creature, which has its own turns. The creature attacks your enemies and tries to stay within 60 feet of you, but it otherwise controls its own actions. The summoned creature despises being bound and might harm or impede you and your companions by any means at its disposal other than direct attacks if the opportunity arises. At the beginning of the creature’s turn, you can use your reaction to verbally command it. The creature obeys your commands for that turn, and you take 1d6 psychic damage at the end of the turn. If your concentration is broken, the creature doesn’t disappear. Instead, you can no longer command it, it becomes hostile to you and your companions, and it attacks you and your allies if it believes it has a chance to win the fight or to inflict meaningful harm; otherwise it flees. You can’t dismiss the uncontrolled creature, but it disappears 1 hour after you summoned it."
  },
  {
    "name": "Conjure Shadow Titan",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "90 feet",
    "components": "",
    "duration": "Concentration, up to 1 hour",
    "description": "You summon a shadow titan, which appears in an unoccupied space that you can see within range. The shadow titan’s statistics are identical to a [stone giant’s](https://api.open5e.com/monsters/stone-giant), with two differences: its camouflage ability works in dim light instead of rocky terrain, and the “rocks” it hurls are composed of shadow-stuff and cause cold damage.\n\nThe shadow titan is friendly to you and your companions. Roll initiative for the shadow titan; it acts on its own turn. It obeys verbal or telepathic commands that you issue to it (giving a command takes no action on your part). If you don’t issue any commands to the shadow titan, it defends itself from hostile creatures but otherwise takes no actions.\n\nThe shadow titan disappears when it drops to 0 hit points or when the spell ends."
  },
  {
    "name": "Conjure Spectral Allies",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "instantaneous",
    "description": "You sprinkle some graveyard dirt before you and call forth vengeful spirits. The spirits erupt from the ground at a point you choose within range and sweep outward. Each creature in a 30-foot-radius sphere centered on that point must make a Wisdom saving throw. On a failed save, a creature takes 6d10 necrotic damage and becomes frightened for 1 minute. On a successful save, the creature takes half as much damage and isn't frightened.\n  At the end of each of its turns, a creature frightened by this spell can make another saving throw. On a success, this spell ends on the creature."
  },
  {
    "name": "Conjure Voidborn",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "90 feet",
    "components": "",
    "duration": "Concentration, up to 1 hour",
    "description": "You summon a fiend or aberration of challenge rating 6 or lower, which appears in an unoccupied space that you can see within range. The creature disappears when it drops to 0 hit points or when the spell ends.\n\nRoll initiative for the creature, which takes its own turns. It attacks the nearest creature on its turn. At the start of the fiend’s turn, you can use your reaction to command the creature by speaking in Void Speech. It obeys your verbal command, and you take 2d6 psychic damage at the end of the creature’s turn.\n\nIf your concentration is broken, the spell ends but the creature doesn’t disappear. Instead, you can no longer issue commands to the fiend, and it becomes hostile to you and your companions. It will attack you and your allies if it believes it has a chance to win the fight or to inflict meaningful harm, but it won’t fight if it fears doing so would mean its own death. You can’t dismiss the creature, but it disappears 1 hour after you summoned it."
  },
  {
    "name": "Create Thunderstaff",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "10 minutes",
    "range": "Touch",
    "components": "M",
    "duration": "instantaneous",
    "description": "After you cast **create thunderstaff** on a normal quarterstaff, the staff must then be mounted in a noisy location, such as a busy marketplace, and left there for 60 days. During that time, the staff gradually absorbs ambient sound.\n\nAfter 60 days, the staff is fully charged and can’t absorb any more sound. At that point, it becomes a **thunderstaff**, a +1 quarterstaff that has 10 charges. When you hit on a melee attack with the staff and expend 1 charge, the target takes an extra 1d8 thunder damage. You can cast a [thunderwave](https://api.open5e.com/spells/thunderwave) spell from the staff as a bonus action by expending 2 charges. The staff cannot be recharged.\n\nIf the final charge is not expended within 60 days, the staff becomes nonmagical again."
  },
  {
    "name": "Curse of Dust",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "10 minutes",
    "range": "500 feet",
    "components": "M",
    "duration": "5 days",
    "description": "You cast a curse on a creature within range that you’re familiar with, causing it to be unsatiated by food no matter how much it eats. This effect isn’t merely an issue of perception; the target physically can’t draw sustenance from food. Within minutes after the spell is cast, the target feels constant hunger no matter how much food it consumes. The target must make a Constitution saving throw 24 hours after the spell is cast and every 24 hours thereafter. On a failed save, the target gains one level of exhaustion. The effect ends when the duration expires or when the target makes two consecutive successful saves."
  },
  {
    "name": "Curse of the Grave",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "until dispelled",
    "description": "You tap your connection to death to curse a humanoid, making the grim pull of the grave stronger on that creature’s soul.\n\nChoose one humanoid you can see within range. The target must succeed on a Constitution saving throw or become cursed. A [remove curse](https://api.open5e.com/spells/remove-curse) spell or similar magic ends this curse. While cursed in this way, the target suffers the following effects:\n\n* The target fails death saving throws on any roll but a 20.\n* If the target dies while cursed, it rises 1 round later as a vampire spawn under your control and is no longer cursed.\n* The target, as a vampire spawn, seeks you out in an attempt to serve its new master. You can have only one vampire spawn under your control at a time through this spell. If you create another, the existing one turns to dust. If you or your companions do anything harmful to the target, it can make a Wisdom saving throw. On a success, it is no longer under your control."
  },
  {
    "name": "Death God’s Touch",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "",
    "duration": "instantaneous",
    "description": "This spell allows you to shred the life force of a creature you touch. You become invisible and make a melee spell attack against the target. On a hit, the target takes 10d10 necrotic damage. If this damage reduces the target to 0 hit points, the target dies. Whether the attack hits or misses, you remain invisible until the start of your next turn."
  },
  {
    "name": "Defile Healing",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 reaction",
    "range": "60 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You attempt to reverse the energy of a healing spell so that it deals damage instead of healing. If the healing spell is being cast with a spell slot of 5th level or lower, the slot is expended but the spell restores no hit points. In addition, each creature that was targeted by the healing spell takes necrotic damage equal to the healing it would have received, or half as much damage with a successful Constitution saving throw."
  },
  {
    "name": "Delayed Blast Fireball",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "A glowing bead of yellow light flies from your finger and lingers at a point at the center of the area until you end the spell—either because your concentration is broken or because you choose to end it—and the bead detonates. Each creature in the area takes 12d6 fire damage. If at the end of your turn the bead has not yet detonated, the damage increases by 1d6.\n\nIf touched before the spell ends, the creature touching the bead makes a Dexterity saving throw or the bead detonates. On a successful save, the creature can use an action to throw the bead up to 40 feet, moving the area with it. If the bead strikes a creature or solid object, the bead detonates.\n\nThe fire spreads around corners, and it damages and ignites any flammable unattended objects in the area."
  },
  {
    "name": "Delayed Blast Fireball",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "150 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "A beam of yellow light flashes from your pointing finger, then condenses to linger at a chosen point within range as a glowing bead for the duration. When the spell ends, either because your concentration is broken or because you decide to end it, the bead blossoms with a low roar into an explosion of flame that spreads around corners. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A creature takes fire damage equal to the total accumulated damage on a failed save, or half as much damage on a successful one. The spell's base damage is 12d6. If at the end of your turn the bead has not yet detonated, the damage increases by 1d6. If the glowing bead is touched before the interval has expired, the creature touching it must make a dexterity saving throw. On a failed save, the spell ends immediately, causing the bead to erupt in flame. On a successful save, the creature can throw the bead up to 40 feet. When it strikes a creature or a solid object, the spell ends, and the bead explodes. The fire damages objects in the area and ignites flammable objects that aren't being worn or carried."
  },
  {
    "name": "Divine Word",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 bonus action",
    "range": "30 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You utter a primordial imprecation that brings woe upon your enemies. A target suffers an effect based on its current hit points.\n\n* Fewer than 50 hit points: deafened for 1 minute.\n* Fewer than 40 hit points: blinded and deafened for 10 minutes.\n* Fewer than 30 hit points: stunned, blinded, and deafened for 1 hour.\n* Fewer than 20 hit points: instantly killed outright.\n\nAdditionally, when a celestial, elemental, fey, or fiend is affected by this spell it is immediately forced back to its home plane and for 24 hours it is unable to return to your current plane by any means less powerful than a wish spell. Such a creature does not suffer this effect if it is already on its plane of origin."
  },
  {
    "name": "Divine Word",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 bonus action",
    "range": "30 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You utter a divine word, imbued with the power that shaped the world at the dawn of creation. Choose any number of creatures you can see within range. Each creature that can hear you must make a Charisma saving throw. On a failed save, a creature suffers an effect based on its current hit points: \n- 50hp or less: deafened for 1 minute \n- 40 hp or less: deafened and blinded for 10 minutes \n- 30 hp or less: blinded, deafened and dazed for 1 hour \n- 20 hp or less: killed instantly. Regardless of its current hit points, a celestial, an elemental, a fey, or a fiend that fails its save is forced back to its plane of origin (if it isn't there already) and can't return to your current plane for 24 hours by any means short of a wish spell."
  },
  {
    "name": "Enrage Architecture",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You animate and enrage a target building that lashes out at its inhabitants and surroundings. As a bonus action you may command the target to open, close, lock, or unlock any nonmagical doors or windows, or to thrash about and attempt to crush its inhabitants. While the target is thrashing, any creature inside or within 30 feet of it must make a Dexterity saving throw, taking 2d10+5 bludgeoning damage on a failed save or half as much on a successful one. When the spell ends, the target returns to its previous state, magically repairing any damage it sustained during the spell's duration."
  },
  {
    "name": "Etherealness",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "8 hours",
    "description": "Until the spell ends or you use an action to end it, you step into the border regions of the Ethereal Plane where it overlaps with your current plane. While on the Ethereal Plane, you can move in any direction, but vertical movement is considered difficult terrain. You can see and hear the plane you originated from, but everything looks desaturated and you can see no further than 60 feet.\n\nWhile on the Ethereal Plane, you can only affect and be affected by other creatures on that plane. Creatures not on the Ethereal Plane can't perceive you unless some special ability or magic explicitly allows them to.\n\nWhen the spell ends, you immediately return to the plane you originated from in the spot you currently occupy. If you occupy the same spot as a solid object or creature when this happens, you are immediately shunted to the nearest unoccupied space and you take force damage equal to twice the number of feet you are moved.\n\nThe spell has no effect if you cast it while you are on the Ethereal Plane or a plane that doesn't border it, such as an Outer Plane."
  },
  {
    "name": "Etherealness",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "8 hours",
    "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can't see anything more than 60 feet away. While on the Ethereal Plane, you can only affect and be affected by other creatures on that plane. Creatures that aren't on the Ethereal Plane can't perceive you and can't interact with you, unless a special ability or magic has given them the ability to do so. You ignore all objects and effects that aren't on the Ethereal Plane, allowing you to move through objects you perceive on the plane you originated from. When the spell ends, you immediately return to the plane you originated from in the spot you currently occupy. If you occupy the same spot as a solid object or creature when this happens, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you are moved. This spell has no effect if you cast it while you are on the Ethereal Plane or a plane that doesn't border it, such as one of the Outer Planes."
  },
  {
    "name": "Finger of Death",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "Negative energy wracks the target and deals 7d8 + 30 necrotic damage. A humanoid killed by this spell turns into a zombie at the start of your next turn. It is permanently under your control and follows your spoken commands."
  },
  {
    "name": "Finger of Death",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You send negative energy coursing through a creature that you can see within range, causing it searing pain. The target must make a constitution saving throw. It takes 7d8 + 30 necrotic damage on a failed save, or half as much damage on a successful one. A humanoid killed by this spell rises at the start of your next turn as a zombie that is permanently under your command, following your verbal orders to the best of its ability."
  },
  {
    "name": "Fire Storm",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "Flames roar, dealing 7d10 fire damage to creatures and objects in the area and igniting unattended flammable objects. If you choose, plant life in the area is unaffected. This spell's area consists of a contiguous group of ten 10-foot cubes in an arrangement you choose, with each cube adjacent to at least one other cube."
  },
  {
    "name": "Fire Storm",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "150 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "A storm made up of sheets of roaring flame appears in a location you choose within range. The area of the storm consists of up to ten 10-foot cubes, which you can arrange as you wish. Each cube must have at least one face adjacent to the face of another cube. Each creature in the area must make a dexterity saving throw. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one. The fire damages objects in the area and ignites flammable objects that aren't being worn or carried. If you choose, plant life in the area is unaffected by this spell."
  },
  {
    "name": "Forcecage",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "1 hour",
    "description": "An opaque cube of banded force surrounds the area, preventing any matter or spells from passing through it, though creatures can breathe inside it. Creatures that make a Dexterity saving throw and creatures that are only partially inside the area are pushed out of the area. Any other creature is trapped and can't leave by nonmagical means. The cage also traps creatures on the Ethereal Plane, and can only be destroyed by being dealt at least 25 force damage at once or by a _dispel magic_ spell cast using an 8th-level or higher spell slot.\n\nIf a trapped creature tries to teleport or travel to another plane, it makes a Charisma saving throw. On a failure, the attempt fails and the spell or effect is wasted."
  },
  {
    "name": "Forcecage",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "100 feet",
    "components": "M",
    "duration": "1 hour",
    "description": "An immobile, invisible, cube-shaped prison composed of magical force springs into existence around an area you choose within range. The prison can be a cage or a solid box, as you choose. A prison in the shape of a cage can be up to 20 feet on a side and is made from 1/2-inch diameter bars spaced 1/2 inch apart. A prison in the shape of a box can be up to 10 feet on a side, creating a solid barrier that prevents any matter from passing through it and blocking any spells cast into or out from the area. When you cast the spell, any creature that is completely inside the cage's area is trapped. Creatures only partially within the area, or those too large to fit inside the area, are pushed away from the center of the area until they are completely outside the area. A creature inside the cage can't leave it by nonmagical means. If the creature tries to use teleportation or interplanar travel to leave the cage, it must first make a charisma saving throw. On a success, the creature can use that magic to exit the cage. On a failure, the creature can't exit the cage and wastes the use of the spell or effect. The cage also extends into the Ethereal Plane, blocking ethereal travel. This spell can't be dispelled by dispel magic."
  },
  {
    "name": "Glacial Fog",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "100 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "As you cast this spell, a 30-foot-radius sphere centered on a point within range becomes covered in a frigid fog. Each creature that is in the area at the start of its turn while the spell remains in effect must make a Constitution saving throw. On a failed save, a creature takes 12d6 cold damage and gains one level of exhaustion, and it has disadvantage on Perception checks until the start of its next turn. On a successful save, the creature takes half the damage and ignores the other effects.\n\nStored devices and tools are all frozen by the fog: crossbow mechanisms become sluggish, weapons are stuck in scabbards, potions turn to ice, bag cords freeze together, and so forth. Such items require the application of heat for 1 round or longer in order to become useful again."
  },
  {
    "name": "Greater Ley Protection",
    "level": 7,
    "school": "Abjuration",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "",
    "duration": "1 minute",
    "description": "Deep Magic: forest-bound You create a 20-foot cube of antimagic within range that specifically protects against ley line magic. Ley line spells and magical effects up to level 7 that target a creature within the cube have no effect on that target. Any active ley line spells or magical effects up to level 7 on a creature or an object in the cube is suppressed while the creature or object is in it. The area of a ley line spell or magical effect up to level 7 can't extend into the cube. If the cube overlaps an area of ley line magic, such as greater ley pulse, the part of the area that is covered by the cube is suppressed. The cube has no effect on other types of magic or spells. You can exclude specific individuals within the cube from the protection."
  },
  {
    "name": "Greater Ley Pulse",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "",
    "duration": "1 minute",
    "description": "You set up ley energy vibrations in a 20-foot cube within range, and name one type of damage. Each creature in the area must succeed on a Wisdom saving throw or lose immunity to the chosen damage type for the duration."
  },
  {
    "name": "Hellforging",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 hour",
    "range": "Touch",
    "components": "M",
    "duration": "instantaneous",
    "description": "Deep Magic: clockwork You spend an hour calling forth a disembodied evil spirit. At the end of that time, the summoned spirit must make a Charisma saving throw. If the saving throw succeeds, you take 2d10 psychic damage plus 2d10 necrotic damage from waves of uncontrolled energy rippling out from the disembodied spirit. You can maintain the spell, forcing the subject to repeat the saving throw at the end of each of your turns, with the same consequence to you for each failure. If you choose not to maintain the spell or are unable to do so, the evil spirit returns to its place of torment and cannot be recalled. If the saving throw fails, the summoned spirit is transferred into the waiting soul gem and immediately animates the constructed body. The subject is now a hellforged; it loses all of its previous racial traits and gains gearforged traits except as follows: Vulnerability: Hellforged are vulnerable to radiant damage. Evil Mind: Hellforged have disadvantage on saving throws against spells and abilities of evil fiends or aberrations that effect the mind or behavior. Past Life: The hellforged retains only a vague sense of who it was in its former existence, but these memories are enough for it to gain proficiency in one skill. Languages: Hellforged speak Common, Machine Speech, and Infernal or Abyssal Up to four other spellcasters of at least 5th level can assist you in the ritual. Each assistant increases the DC of the Charisma saving throw by 1. In the event of a failed saving throw, the spellcaster and each assistant take damage. An assistant who drops out of the casting can't rejoin."
  },
  {
    "name": "Ice Soldiers",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "30 feet",
    "components": "M",
    "duration": "1 minute",
    "description": "You pour water from the vial and cause two [ice soldiers](https://api.open5e.com/monsters/ice-soldier) to appear within range. The ice soldiers cannot form if there is no space available for them. The ice soldiers act immediately on your turn. You can mentally command them (no action required by you) to move and act where and how you desire. If you command an ice soldier to attack, it attacks that creature exclusively until the target is dead, at which time the soldier melts into a puddle of water. If an ice soldier moves farther than 30 feet from you, it immediately melts."
  },
  {
    "name": "Icy Grasp of the Void",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "",
    "duration": "Concentration, up to 1 minute",
    "description": "You summon the cold, inky darkness of the Void into being around a creature that you can see. The target takes 10d10 cold damage and is restrained for the duration; a successful Constitution saving throw halves the damage and negates the restrained condition. A restrained creature gains one level of exhaustion at the start of each of its turns. Creatures immune to cold and that do not breathe do not gain exhaustion. A creature restrained in this way can repeat the saving throw at the end of each of its turns, ending the spell on a success."
  },
  {
    "name": "Immolating Gibbet",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "30 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You cause up to three creatures you can see within range to be yanked into the air where their blood turns to fire, burning them from within. Each target must succeed on a Dexterity saving throw or be magically pulled up to 60 into the air. The creature is restrained there until the spell ends. A restrained creature must make a Constitution saving throw at the start of each of its turns. The creature takes 7d6 fire damage on a failed save, or half as much damage on a successful one.\n  At the end of each of its turns, a restrained creature can make another Dexterity saving throw. On a success, the spell ends on the creature, and the creature falls to the ground, taking falling damage as normal. Alternatively, the restrained creature or someone else who can reach it can use an action to make an Intelligence (Arcana) check against your spell save DC. On a success, the restrained effect ends, and the creature falls to the ground, taking falling damage as normal."
  },
  {
    "name": "Inescapable Malady",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "special",
    "description": "You infect your target with an arcane disease. At any time after you cast this spell, as long as you are on the same plane of existence as the target, you can use an action to deal 7d10 necrotic damage to the target. If this damage would reduce the target to 0 hit points, you can choose to leave it with 1 hit point.\n\nAs part of dealing the damage, you may expend a 7th-level spell slot to sustain the disease. Otherwise, the spell ends. The spell ends when you die.\n\nCasting remove curse, greater restoration, or heal on the target allows the target to make a Constitution saving throw against the disease. Otherwise the disease can only be cured by a wish spell."
  },
  {
    "name": "Last Rays of the Dying Sun",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "40 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "A burst of searing heat explodes from you, dealing 6d6 fire damage to all enemies within range. Immediately afterward, a wave of frigid cold rolls across the same area, dealing 6d6 cold damage to enemies. A creature that makes a successful Dexterity saving throw takes half the damage."
  },
  {
    "name": "Legend Killer",
    "level": 7,
    "school": "Divination",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You tap into the life force of a creature that is capable of performing legendary actions. When you cast the spell, the target must make a successful Constitution saving throw or lose the ability to take legendary actions for the spell’s duration. A creature can’t use legendary resistance to automatically succeed on the saving throw against this spell. An affected creature can repeat the saving throw at the end of each of its turns, regaining 1 legendary action on a successful save. The target continues repeating the saving throw until the spell ends or it regains all its legendary actions."
  },
  {
    "name": "Long Game",
    "level": 7,
    "school": "Enchantment",
    "casting_time": "1 minute",
    "range": "30 feet",
    "components": "",
    "duration": "7 days",
    "description": "While casting this spell, you must engage your target in conversation. At the completion of the casting, the target must make a Charisma saving throw. If it fails, you place a latent magical effect in the target's mind for the duration. If the target succeeds on the saving throw, it realizes that you used magic to affect its mind and might become hostile toward you, at the GM's discretion.\n  Once before the spell ends, you can use an action to trigger the magical effect in the target's mind, provided you are on the same plane of existence as the target. When the effect is triggered, the target takes 5d8 psychic damage plus an extra 1d8 psychic damage for every 24 hours that has passed since you cast the spell, up to a total of 12d8 psychic damage. The spell has no effect on the target if it ends before you trigger the magical effect.\n  *A greater restoration* or *wish* spell cast on the target ends the spell early. You know if the spell is ended early, provided you are on the same plane of existence as the target."
  },
  {
    "name": "Magnificent Mansion",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "300 feet",
    "components": "M",
    "duration": "24 hours",
    "description": "You conjure an extradimensional residence within range. It has one entrance that is in a place of your choosing, has a faint luster to it, and is 5 feet wide and 10 feet tall. You and any designated creature may enter your mansion while the portal is open. You may open and close the portal while you are within 30 feet of it. Once closed the entrance is invisible.\n\nThe entrance leads to an opulent entrance hall, with many doors and halls coming from it. The atmosphere is welcoming, warm, and comfortable, and the whole place is sparkling clean.\n\nThe floor plan of the residence is up to you, but it must be made up of fifty or fewer 10-foot cubes.\n\nThe furniture and decor are chosen by you. The residence contains enough food to provide Supply for a number of people equal to 5 × your proficiency bonus. A staff of translucent, lustrous servants dwell within the residence. They may otherwise look how you wish. These servants obey your commands without question, and can perform the same nonhostile actions as a human servant—they might carry objects, prepare and serve food and drinks, clean, make simple repairs, and so on. Servants have access to the entire mansion but may not leave.\n\nAll objects and furnishings belonging to the mansion evaporate into shimmering smoke when they leave it. Any creature within the mansion when the spell ends is expelled into an unoccupied space near the entrance."
  },
  {
    "name": "Magnificent Mansion",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 minute",
    "range": "300 feet",
    "components": "M",
    "duration": "24 hours",
    "description": "You conjure an extradimensional dwelling in range that lasts for the duration. You choose where its one entrance is located. The entrance shimmers faintly and is 5 feet wide and 10 feet tall. You and any creature you designate when you cast the spell can enter the extradimensional dwelling as long as the portal remains open. You can open or close the portal if you are within 30 feet of it. While closed, the portal is invisible. Beyond the portal is a magnificent foyer with numerous chambers beyond. The atmosphere is clean, fresh, and warm. You can create any floor plan you like, but the space can't exceed 50 cubes, each cube being 10 feet on each side. The place is furnished and decorated as you choose. It contains sufficient food to serve a nine course banquet for up to 100 people. A staff of 100 near-transparent servants attends all who enter. You decide the visual appearance of these servants and their attire. They are completely obedient to your orders. Each servant can perform any task a normal human servant could perform, but they can't attack or take any action that would directly harm another creature. Thus the servants can fetch things, clean, mend, fold clothes, light fires, serve food, pour wine, and so on. The servants can go anywhere in the mansion but can't leave it. Furnishings and other objects created by this spell dissipate into smoke if removed from the mansion. When the spell ends, any creatures inside the extradimensional space are expelled into the open spaces nearest to the entrance."
  },
  {
    "name": "Mirage Arcane",
    "level": 7,
    "school": "Illusion",
    "casting_time": "10 minutes",
    "range": "2020 feet",
    "components": "",
    "duration": "10 days",
    "description": "You make terrain within the spell's area appear as another kind of terrain, tricking all senses (including touch).\n\nThe general shape of the terrain remains the same, however. A small town could resemble a woodland, a smooth road could appear rocky and overgrown, a deep pit could resemble a shallow pond, and so on.\n\nStructures may be altered in the similar way, or added where there are none. Creatures are not disguised, concealed, or added by the spell.\n\nThe illusion appears completely real in all aspects, including physical terrain, and can be physically interacted with. Clear terrain becomes difficult terrain, and vice versa. Any part of the illusory terrain such as a boulder, or water collected from an illusory stream, disappears immediately upon leaving the spell's area.\n\nCreatures with truesight see through the illusion, but are not immune to its effects. They may know that the overgrown path is in fact a well maintained road, but are still impeded by illusory rocks and branches."
  },
  {
    "name": "Mirage Arcane",
    "level": 7,
    "school": "Illusion",
    "casting_time": "10 minutes",
    "range": "2020 feet",
    "components": "",
    "duration": "10 days",
    "description": "You make terrain in an area up to 1 mile square look, sound, smell, and even feel like some other sort of terrain. The terrain's general shape remains the same, however. Open fields or a road could be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Similarly, you can alter the appearance of structures, or add them where none are present. The spell doesn't disguise, conceal, or add creatures. The illusion includes audible, visual, tactile, and olfactory elements, so it can turn clear ground into difficult terrain (or vice versa) or otherwise impede movement through the area. Any piece of the illusory terrain (such as a rock or stick) that is removed from the spell's area disappears immediately. Creatures with truesight can see through the illusion to the terrain's true form; however, all other elements of the illusion remain, so while the creature is aware of the illusion's presence, the creature can still physically interact with the illusion."
  },
  {
    "name": "Mirror Realm",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "90 feet",
    "components": "M",
    "duration": "24 hours",
    "description": "You transform a mirror into a magical doorway to an extradimensional realm. You and any creatures you designate when you cast the spell can move through the doorway into the realm beyond. For the spell's duration, the mirror remains anchored in the plane of origin, where it can't be broken or otherwise damaged by any mundane means. No creatures other than those you designate can pass through the mirror or see into the mirror realm.\n  The realm within the mirror is an exact reflection of the location you left. The temperature is comfortable, and any environmental threats (lava, poisonous gas, or similar) are inert, harmless facsimiles of the real thing. Likewise, magic items reflected in the mirror realm have no magical properties, but those carried into it work normally. Food, drink, and other beneficial items within the mirror realm (reflections of originals in the real world) function as normal, real items; food can be eaten, wine can be drunk, and so on. Only items that were reflected in the mirror at the moment the spell was cast exist inside the mirror realm. Items placed in front of the mirror afterward don't appear in the mirror realm, and creatures never do unless they are allowed in by you. Items found in the mirror realm dissolve into nothingness when they leave it, but the effects of food and drink remain.\n  Sound passes through the mirror in both directions. Creatures in the mirror realm can see what's happening in the world, but creatures in the world see only what the mirror reflects. Objects can cross the mirror boundary only while worn or carried by a creature, and spells can't cross it at all. You can't stand in the mirror realm and shoot arrows or cast spells at targets in the world or vice versa.\n  The boundaries of the mirror realm are the same as the room or location in the plane of origin, but the mirror realm can't exceed 50,000 square feet (for simplicity, imagine 50 cubes, each cube being 10 feet on a side). If the original space is larger than this, such as an open field or a forest, the boundary is demarcated with an impenetrable, gray fog.\n  Any creature still inside the mirror realm when the spell ends is expelled through the mirror into the nearest empty space.\n  If this spell is cast in the same spot every day for a year, it becomes permanent. Once permanent, the mirror can't be moved or destroyed through mundane means. You can allow new creatures into the mirror realm (and disallow previous creatures) by recasting the spell within range of the permanent mirror. Casting the spell elsewhere doesn't affect the creation or the existence of a permanent mirror realm; a determined spellcaster could have multiple permanent mirror realms to use as storage spaces, hiding spots, and spy vantages."
  },
  {
    "name": "Molech's Blessing",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 hour",
    "range": "Touch",
    "components": "M",
    "duration": "instantaneous",
    "description": "Deep Magic: clockwork ritual You call upon the dark blessings of the furnace god Molech. In an hour-long ritual begun at midnight, you dedicate a living being to Molech by branding the deity's symbol onto the victim's forehead. If the ritual is completed and the victim fails to make a successful Wisdom saving throw (or the victim chooses not to make one), the being is transformed into an avatar of Molech under your control. The avatar is 8 feet tall and appears to be made of black iron wreathed in flames. Its eyes, mouth, and a portion of its torso are cut away to show the churning fire inside that crackles with wailing voices. The avatar has all the statistics and abilities of an earth elemental, with the following differences: Alignment is Neutral Evil; Speed is 50 feet and it cannot burrow or use earth glide; it gains the fire form ability of a fire elemental, but it cannot squeeze through small spaces; its Slam does an additional 1d10 fire damage. This transformation lasts for 24 hours. At the end of that time, the subject returns to its normal state and takes 77 (14d10) fire damage, or half damage with a successful DC 15 Constitution saving throw."
  },
  {
    "name": "Morphic Flux",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "1 minute",
    "description": "When you cast this spell, your body becomes highly mutable, your flesh constantly shifting and quivering, occasionally growing extra parts-limbs and eyes-only to reabsorb them soon afterward. While under the effect of this spell, you have resistance to slashing and piercing damage and ignore the additional damage done by critical hits. You can squeeze through Tiny spaces without penalty. In addition, once per round, as a bonus action, you can make an unarmed attack with a newly- grown limb. Treat it as a standard unarmed attack, but you choose whether it does bludgeoning, piercing, or slashing damage."
  },
  {
    "name": "Plane Shift",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "special",
    "description": "Willing targets are transported to a plane of existence that you choose. If the destination is generally described, targets arrive near that destination in a location chosen by the Narrator. If you know the correct sequence of an existing teleportation circle (see teleportation circle), you can choose it as the destination (when the designated circle is too small for all targets to fit, any additional targets are shunted to the closest unoccupied spaces).\n\nAlternatively this spell can be used offensively to banish an unwilling target. You make a melee spell attack and on a hit the target makes a Charisma saving throw or is transported to a random location on a plane of existence that you choose. Once transported, you must spend 1 minute concentrating on this spell or the target returns to the last space it occupied (otherwise it must find its own way back)."
  },
  {
    "name": "Plane Shift",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "instantaneous",
    "description": "You and up to eight willing creatures who link hands in a circle are transported to a different plane of existence. You can specify a target destination in general terms, such as the City of Brass on the Elemental Plane of Fire or the palace of Dispater on the second level of the Nine Hells, and you appear in or near that destination. If you are trying to reach the City of Brass, for example, you might arrive in its Street of Steel, before its Gate of Ashes, or looking at the city from across the Sea of Fire, at the DM's discretion. Alternatively, if you know the sigil sequence of a teleportation circle on another plane of existence, this spell can take you to that circle. If the teleportation circle is too small to hold all the creatures you transported, they appear in the closest unoccupied spaces next to the circle. You can use this spell to banish an unwilling creature to another plane. Choose a creature within your reach and make a melee spell attack against it. On a hit, the creature must make a charisma saving throw. If the creature fails this save, it is transported to a random location on the plane of existence you specify. A creature so transported must find its own way back to your current plane of existence."
  },
  {
    "name": "Prismatic Spray",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "instantaneous",
    "description": "You unleash 8 rays of light, each with a different purpose and effect. For each target in the area, roll a d8 to determine the ray that affects it.\n\n1—Red: The target takes 10d6 fire damage.\n\n2—Orange: The target takes 10d6 acid damage.\n\n3—Yellow: The target takes 10d6 lightning damage.\n\n4—Green: The target takes 10d6 poison damage.\n\n5—Blue: The target takes 10d6 cold damage.\n\n6—Indigo: The target is restrained and at the end of each of its turns it makes a Constitution saving throw. Once it accumulates two failed saves it permanently turns to stone, or when it accumulates two successful saves the effect ends.\n\n7—Violet: The target is blinded. At the start of your next turn, the target makes a Wisdom saving throw, ending the effect on a success.\n\nOn a failed save, the target is banished to another random plane and is no longer blind. If it originated from another plane it returns there, while other creatures are generally cast into the Astral Plane or Ethereal Plane.\n\n8—Special: The target is hit by two rays.\n\nRoll a d8 twice to determine which rays, rerolling any 8s."
  },
  {
    "name": "Prismatic Spray",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "",
    "duration": "instantaneous",
    "description": "Eight multicolored rays of light flash from your hand. Each ray is a different color and has a different power and purpose. Each creature in a 60-foot cone must make a dexterity saving throw. For each target, roll a d8 to determine which color ray affects it.\n\n**1. Red.** The target takes 10d6 fire damage on a failed save, or half as much damage on a successful one.\n\n**2. Orange.** The target takes 10d6 acid damage on a failed save, or half as much damage on a successful one.\n\n**3. Yellow.** The target takes 10d6 lightning damage on a failed save, or half as much damage on a successful one.\n\n**4. Green.** The target takes 10d6 poison damage on a failed save, or half as much damage on a successful one.\n\n**5. Blue.** The target takes 10d6 cold damage on a failed save, or half as much damage on a successful one.\n\n**6. Indigo.** On a failed save, the target is restrained. It must then make a constitution saving throw at the end of each of its turns. If it successfully saves three times, the spell ends. If it fails its save three times, it permanently turns to stone and is subjected to the petrified condition. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.\n\n**7. Violet.** On a failed save, the target is blinded. It must then make a wisdom saving throw at the start of your next turn. A successful save ends the blindness. If it fails that save, the creature is transported to another plane of existence of the DM's choosing and is no longer blinded. (Typically, a creature that is on a plane that isn't its home plane is banished home, while other creatures are usually cast into the Astral or Ethereal planes.) \n\n**8. Special.** The target is struck by two rays. Roll twice more, rerolling any 8."
  },
  {
    "name": "Project Image",
    "level": 7,
    "school": "Illusion",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 1 day",
    "description": "You create an illusory duplicate of yourself that looks and sounds like you but is intangible. The duplicate can appear anywhere within range as long as you have seen the space before (it ignores any obstacles in the way).\n\nYou can use an action to move this duplicate up to twice your Speed and make it speak and behave in whatever way you choose, mimicking your mannerism with perfect accuracy. You can use a bonus action to see through your duplicate's eyes and hear through its ears until the beginning of your next turn. During this time, you are blind and deaf to your body's surroundings.\n\nA creature can use an action to attempt an Investigation check against your spell save DC to reveal the spell's illusory nature. Physical interactions reveal the illusion for what it is as things can pass through it with ease. A creature aware of the illusion perceives the image as transparent and the sounds it generates hollow."
  },
  {
    "name": "Project Image",
    "level": 7,
    "school": "Illusion",
    "casting_time": "1 action",
    "range": "500 feet",
    "components": "M",
    "duration": "Concentration, up to 24 hours",
    "description": "You create an illusory copy of yourself that lasts for the duration. The copy can appear at any location within range that you have seen before, regardless of intervening obstacles. The illusion looks and sounds like you but is intangible. If the illusion takes any damage, it disappears, and the spell ends. You can use your action to move this illusion up to twice your speed, and make it gesture, speak, and behave in whatever way you choose. It mimics your mannerisms perfectly. You can see through its eyes and hear through its ears as if you were in its space. On your turn as a bonus action, you can switch from using its senses to using your own, or back again. While you are using its senses, you are blinded and deafened in regard to your own surroundings. Physical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and any noise it makes sounds hollow to the creature."
  },
  {
    "name": "Regenerate",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 minute",
    "range": "Touch",
    "components": "M",
    "duration": "1 hour",
    "description": "You touch a creature, causing its body to spontaneously heal itself. The target immediately regains 4d8 + 15 hit points and regains 10 hit points per minute (1 hit point at the start of each of its turns).\n\nIf the target is missing any body parts, the lost parts are restored after 2 minutes. If a severed part is held against the stump, the limb instantaneously reattaches itself."
  },
  {
    "name": "Regenerate",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 minute",
    "range": "Touch",
    "components": "M",
    "duration": "1 hour",
    "description": "You touch a creature and stimulate its natural healing ability. The target regains 4d8 + 15 hit points. For the duration of the spell, the target regains 1 hit point at the start of each of its turns (10 hit points each minute). The target's severed body members (fingers, legs, tails, and so on), if any, are restored after 2 minutes. If you have the severed part and hold it to the stump, the spell instantaneously causes the limb to knit to the stump."
  },
  {
    "name": "Resurrection",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 hour",
    "range": "Touch",
    "components": "M",
    "duration": "instantaneous",
    "description": "Provided the target's soul is willing and able to return to its body, so long as it is not undead it returns to life with all of its hit points.\n\nThe spell cures any poisons and nonmagical diseases that affected the target at the time of death.\n\nIt does not remove any magical diseases, curses, or other magical effects; these must be removed prior to the spell being cast, otherwise they immediately take effect when the target returns to life. The spell closes all mortal wounds and restores any missing body parts.\n\nBeing raised from the dead takes a toll on the body, mind, and spirit. The target takes a -4 penalty to attack rolls, saving throws, and ability checks.\n\nAt the conclusion of each long rest, the penalty is reduced by 1 until the target completely recovers.\n\nResurrecting a creature that has been dead for one year or longer is exhausting. Until you finish a long rest, you can't cast spells again and you have disadvantage on attack rolls, ability checks, and saving throws."
  },
  {
    "name": "Resurrection",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 hour",
    "range": "Touch",
    "components": "M",
    "duration": "instantaneous",
    "description": "You touch a dead creature that has been dead for no more than a century, that didn't die of old age, and that isn't undead. If its soul is free and willing, the target returns to life with all its hit points. This spell neutralizes any poisons and cures normal diseases afflicting the creature when it died. It doesn't, however, remove magical diseases, curses, and the like; if such effects aren't removed prior to casting the spell, they afflict the target on its return to life. This spell closes all mortal wounds and restores any missing body parts. Coming back from the dead is an ordeal. The target takes a -4 penalty to all attack rolls, saving throws, and ability checks. Every time the target finishes a long rest, the penalty is reduced by 1 until it disappears. Casting this spell to restore life to a creature that has been dead for one year or longer taxes you greatly. Until you finish a long rest, you can't cast spells again, and you have disadvantage on all attack rolls, ability checks, and saving throws."
  },
  {
    "name": "Reverse Gravity",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "Gravity reverses in the area. Any creatures or objects not anchored to the ground fall upward until they reach the top of the area. A creature may make a Dexterity saving throw to prevent the fall by grabbing hold of something. If a solid object (such as a ceiling) is encountered, the affected creatures and objects impact against it with the same force as a downward fall. When an object or creature reaches the top of the area, it remains suspended there until the spell ends.\n\nWhen the spell ends, all affected objects and creatures fall back down."
  },
  {
    "name": "Reverse Gravity",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "100 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "This spell reverses gravity in a 50-foot-radius, 100-foot high cylinder centered on a point within range. All creatures and objects that aren't somehow anchored to the ground in the area fall upward and reach the top of the area when you cast this spell. A creature can make a dexterity saving throw to grab onto a fixed object it can reach, thus avoiding the fall. If some solid object (such as a ceiling) is encountered in this fall, falling objects and creatures strike it just as they would during a normal downward fall. If an object or creature reaches the top of the area without striking anything, it remains there, oscillating slightly, for the duration. At the end of the duration, affected objects and creatures fall back down."
  },
  {
    "name": "Right the Stars",
    "level": 7,
    "school": "Divination",
    "casting_time": "10 minutes",
    "range": "Self",
    "components": "M",
    "duration": "1 hour",
    "description": "You subtly warp the flow of space and time to enhance your conjurations with cosmic potency. Until the spell ends, the maximum duration of any conjuration spell you cast that requires concentration is doubled, any creature that you summon or create with a conjuration spell has 30 temporary hit points, and you have advantage on Charisma checks and Charisma saving throws."
  },
  {
    "name": "Ring Ward",
    "level": 7,
    "school": "Abjuration",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "Concentration, up to 1 hour",
    "description": "The iron ring you use to cast the spell becomes a faintly shimmering circlet of energy that spins slowly around you at a radius of 15 feet. For the duration, you and your allies inside the protected area have advantage on saving throws against spells, and all affected creatures gain resistance to one type of damage of your choice."
  },
  {
    "name": "Seal of Sanctuary",
    "level": 7,
    "school": "Abjuration",
    "casting_time": "1 minute",
    "range": "Touch",
    "components": "M",
    "duration": "24 hours",
    "description": "You inscribe an angelic seal on the ground, the floor, or other solid surface of a structure. The seal creates a spherical sanctuary with a radius of 50 feet, centered on the seal. For the duration, aberrations, elementals, fey, fiends, and undead that approach to within 5 feet of the boundary know they are about to come into contact with a deadly barrier. If such a creature moves so as to touch the boundary, or tries to cross the boundary by any means, including teleportation and extradimensional travel, it must make a Charisma saving throw. On a failed save, it takes 10d8 radiant damage, is repelled to 5 feet outside the boundary, and can’t target anything inside the boundary with attacks, spells, or abilities until the spell ends. On a successful save, the creature takes half as much radiant damage and can cross the boundary. If the creature is a fiend that isn’t on its home plane, it is immediately destroyed (no saving throw) instead of taking damage.\n\nAberrations, elementals, fey, and undead that are within 50 feet of the seal (inside the boundary) have disadvantage on ability checks, attack rolls, and saving throws, and each such creature takes 2d8 radiant damage at the start of its turn.\n\nCreatures other than aberrations, elementals, fey, fiends, and undead can’t be charmed or frightened while within 50 feet of the seal.\n\nThe seal has AC 18, 50 hit points, resistance to bludgeoning, piercing, and slashing damage, and immunity to psychic and poison damage. Ranged attacks against the seal are made with disadvantage. If it is scribed on the surface of an object that is later destroyed (such as a wooden door), the seal is not damaged and remains in place, perhaps suspended in midair. The spell ends only if the seal is reduced to 0 hit points."
  },
  {
    "name": "Sequester",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "permanent",
    "description": "You magically hide away a willing creature or object. The target becomes invisible, and it cannot be traced or detected by divination or scrying sensors. If the target is a living creature, it falls into a state of suspended animation and stops aging.\n\nThe spell ends when the target takes damage or a condition you set occurs. The condition can be anything you choose, like a set amount of time or a specific event, but it must occur within or be visible within 1 mile of the target."
  },
  {
    "name": "Sequester",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "M",
    "duration": "until dispelled",
    "description": "By means of this spell, a willing creature or an object can be hidden away, safe from detection for the duration. When you cast the spell and touch the target, it becomes invisible and can't be targeted by divination spells or perceived through scrying sensors created by divination spells. If the target is a creature, it falls into a state of suspended animation. Time ceases to flow for it, and it doesn't grow older. You can set a condition for the spell to end early. The condition can be anything you choose, but it must occur or be visible within 1 mile of the target. Examples include \"after 1,000 years\" or \"when the tarrasque awakens.\" This spell also ends if the target takes any damage."
  },
  {
    "name": "Sign of Koth",
    "level": 7,
    "school": "Abjuration",
    "casting_time": "turn",
    "range": "Self",
    "components": "M",
    "duration": "until dispelled",
    "description": "You invoke the twilight citadels of Koth to create a field of magical energy in the shape of a 60-foot-radius, 60-foot‑tall cylinder centered on you. The only visible evidence of this field is a black rune that appears on every doorway, window, or other portal inside the area.\n\nChoose one of the following creature types: aberration, beast, celestial, dragon, elemental, fey, fiend, giant, humanoid, monstrosity, ooze, plant, or undead. The sign affects creatures of the chosen type (including you, if applicable) in the following ways:\n* The creatures can’t willingly enter the cylinder’s area by nonmagical means; the cylinder acts as an invisible, impenetrable wall of force. If an affected creature tries to enter the cylinder’s area by using teleportation, a dimensional shortcut, or other magical means, it must make a successful Charisma saving throw or the attempt fails.\n* They cannot hear any sounds that originate inside the cylinder.\n* They have disadvantage on attack rolls against targets inside the cylinder.\n* They can’t charm, frighten, or possess creatures inside the cylinder.\nCreatures that aren’t affected by the field and that take a short rest inside it regain twice the usual number of hit points for each Hit Die spent at the end of the rest.\n\nWhen you cast this spell, you can choose to reverse its magic; doing this will prevent affected creatures from leaving the area instead of from entering it, make them unable to hear sounds that originate outside the cylinder, and so forth. In this case, the field provides no benefit for taking a short rest."
  },
  {
    "name": "Simulacrum",
    "level": 7,
    "school": "Illusion",
    "casting_time": "12 hours",
    "range": "Touch",
    "components": "M",
    "duration": "permanent",
    "description": "You sculpt an illusory duplicate of the target from ice and snow. The duplicate looks exactly like the target and uses all the statistics of the original, though it is formed without any gear, and has only half of the target's hit point maximum. The duplicate is a creature, can take actions, and be affected like any other creature. If the target is able to cast spells, the duplicate cannot cast spells of 7th-level or higher.\n\nThe duplicate is friendly to you and creatures you designate. It follows your spoken commands, and moves and acts on your turn in combat. It is a static creature and it does not learn, age, or grow, so it never increases in levels and cannot regain any spent spell slots.\n\nWhen the simulacrum is damaged you can repair it in an alchemy lab using components worth 100 gold per hit point it regains. The simulacrum remains until it is reduced to 0 hit points, at which point it crumbles into snow and melts away immediately.\n\nIf you cast this spell again, any existing simulacrum you have created with this spell is instantly destroyed."
  },
  {
    "name": "Simulacrum",
    "level": 7,
    "school": "Illusion",
    "casting_time": "12 hours",
    "range": "Touch",
    "components": "M",
    "duration": "until dispelled",
    "description": "You shape an illusory duplicate of one beast or humanoid that is within range for the entire casting time of the spell. The duplicate is a creature, partially real and formed from ice or snow, and it can take actions and otherwise be affected as a normal creature. It appears to be the same as the original, but it has half the creature's hit point maximum and is formed without any equipment. Otherwise, the illusion uses all the statistics of the creature it duplicates. The simulacrum is friendly to you and creatures you designate. It obeys your spoken commands, moving and acting in accordance with your wishes and acting on your turn in combat. The simulacrum lacks the ability to learn or become more powerful, so it never increases its level or other abilities, nor can it regain expended spell slots. If the simulacrum is damaged, you can repair it in an alchemical laboratory, using rare herbs and minerals worth 100 gp per hit point it regains. The simulacrum lasts until it drops to 0 hit points, at which point it reverts to snow and melts instantly. If you cast this spell again, any currently active duplicates you created with this spell are instantly destroyed."
  },
  {
    "name": "Sporesight",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "M",
    "duration": "Concentration, up to 10 minutes",
    "description": "You throw a mushroom at a point within range and detonate it, creating a cloud of spores that fills the area. The cloud of spores travels around corners, and the area is considered lightly obscured for everyone except you. Creatures and objects within the area are covered in spores.\n\nUntil the spell ends, you know the exact location of all affected objects and creatures. Any attack roll you make against an affected creature or object has advantage, and the affected creatures and objects can't benefit from being invisible."
  },
  {
    "name": "Starry Vision",
    "level": 7,
    "school": "Divination",
    "casting_time": "1 reaction",
    "range": "100 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "This spell acts as [compelling fate](https://api.open5e.com/spells/compelling-fate), except as noted above (**starry** vision can be cast as a reaction, has twice the range of [compelling fate](https://api.open5e.com/spells/compelling-fate), and lasts up to 1 minute). At the end of each of its turns, the target repeats the Charisma saving throw, ending the effect on a success."
  },
  {
    "name": "Symbol",
    "level": 7,
    "school": "Abjuration",
    "casting_time": "1 minute",
    "range": "Touch",
    "components": "M",
    "duration": "permanent",
    "description": "You inscribe a potent glyph on the target, setting a magical trap for your enemies. If the glyph is moved more than 10 feet from its original position, or if it comes within 20 feet of another glyph that you have cast, the spell ends. Finding the Tiny glyph requires an Investigation check against your spell save DC.\n\nDescribe the actions a creature must perform to trigger the spell, such as approaching within a certain distance, opening or touching the object the glyph is inscribed on, or seeing or reading the glyph. The creature must have a clear path to the glyph to trigger it. You can specify certain creatures which don't trigger the spell, such as those with a certain appearance or those who speak a certain phrase. Once the glyph is triggered, the spell ends.\n\nWhen triggered, the glyph sheds dim light in a 60-foot radius for 10 minutes, after which the spell ends. Each creature within the sphere's area is targeted by the glyph, as are creatures that enter the sphere for the first time on a turn.\n\nWhen you cast the spell, choose one of the following effects.\n\nDeath: Creatures in the area make a Constitution saving throw, taking 10d10 necrotic damage on a failed save, or half as much on a successful save.\n\nDiscord: Creatures in the area make a Constitution saving throw or bicker and argue with other creatures for 1 minute. While bickering, a creature cannot meaningfully communicate and it has disadvantage on attack rolls and ability checks.\n\nConfused: Creatures in the area make an Intelligence saving throw or become confused for 1 minute.\n\nFear: Creatures in the area make a Wisdom saving throw or are frightened for 1 minute.\n\nWhile frightened, a creature drops whatever it is holding and must move at least 30 feet away from the glyph on each of its turns.\n\nHopelessness: Creatures in the area make a Charisma saving throw or become overwhelmed with despair for 1 minute. While despairing, a creature can't attack or target any creature with harmful features, spells, traits, or other magical effects.\n\nPain: Creatures in the area make a Constitution saving throw or become incapacitated for 1 minute.\n\nSleep: Creatures in the area make a Wisdom saving throw or fall unconscious for 10 minutes.\n\nA sleeping creature awakens if it takes damage or an action is used to wake it.\n\nStunning: Creatures in the area make a Wisdom saving throw or become stunned for 1 minute."
  },
  {
    "name": "Symbol",
    "level": 7,
    "school": "Abjuration",
    "casting_time": "1 minute",
    "range": "Touch",
    "components": "M",
    "duration": "until dispelled or triggered",
    "description": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered. The glyph is nearly invisible, requiring an Intelligence (Investigation) check against your spell save DC to find it. You decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or stepping on the glyph, removing another object covering it, approaching within a certain distance of it, or manipulating the object that holds it. For glyphs inscribed within an object, the most common triggers are opening the object, approaching within a certain distance of it, or seeing or reading the glyph. You can further refine the trigger so the spell is activated only under certain circumstances or according to a creature's physical characteristics (such as height or weight), or physical kind (for example, the ward could be set to affect hags or shapechangers). You can also specify creatures that don't trigger the glyph, such as those who say a certain password. When you inscribe the glyph, choose one of the options below for its effect. Once triggered, the glyph glows, filling a 60-foot-radius sphere with dim light for 10 minutes, after which time the spell ends. Each creature in the sphere when the glyph activates is targeted by its effect, as is a creature that enters the sphere for the first time on a turn or ends its turn there.\n\n**Death.** Each target must make a constitution saving throw, taking 10d 10 necrotic damage on a failed save, or half as much damage on a successful save\n\n **Discord.** Each target must make a constitution saving throw. On a failed save, a target bickers and argues with other creatures for 1 minute. During this time, it is incapable of meaningful communication and has disadvantage on attack rolls and ability checks.\n\n**Fear.** Each target must make a wisdom saving throw and becomes frightened for 1 minute on a failed save. While frightened, the target drops whatever it is holding and must move at least 30 feet away from the glyph on each of its turns, if able.\n\n**Hopelessness.** Each target must make a charisma saving throw. On a failed save, the target is overwhelmed with despair for 1 minute. During this time, it can't attack or target any creature with harmful abilities, spells, or other magical effects.\n\n**Insanity.** Each target must make an intelligence saving throw. On a failed save, the target is driven insane for 1 minute. An insane creature can't take actions, can't understand what other creatures say, can't read, and speaks only in gibberish. The DM controls its movement, which is erratic.\n\n**Pain.** Each target must make a constitution saving throw and becomes incapacitated with excruciating pain for 1 minute on a failed save.\n\n**Sleep.** Each target must make a wisdom saving throw and falls unconscious for 10 minutes on a failed save. A creature awakens if it takes damage or if someone uses an action to shake or slap it awake.\n\n**Stunning.** Each target must make a wisdom saving throw and becomes stunned for 1 minute on a failed save."
  },
  {
    "name": "Symbol of Sorcery",
    "level": 7,
    "school": "Evocation",
    "casting_time": "10 minutes",
    "range": "Touch",
    "components": "M",
    "duration": "8 hours",
    "description": "You draw an arcane symbol on an object, wall, or other surface at least 5 feet wide. When a creature other than you approaches within 5 feet of the symbol, that act triggers an arcane explosion. Each creature in a 60-foot cone must make a successful Wisdom saving throw or be stunned. A stunned creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a successful save. After this symbol explodes or when the duration expires, its power is spent and the spell ends."
  },
  {
    "name": "Talons of a Hungry Land",
    "level": 7,
    "school": "Evocation",
    "casting_time": "1 action",
    "range": "60 feet",
    "components": "",
    "duration": "Concentration, up to 10 minutes",
    "description": "You cause three parallel lines of thick, flared obsidian spikes to erupt from the ground. They appear within range on a solid surface, last for the duration, and provide three‐quarters cover to creatures behind them. You can make lines (up to 60 feet long, 10 feet high, and 5 feet thick) or form a circle (20 feet in diameter, up to 15 feet high and 5 feet thick).\n\nWhen the lines appear, each creature in their area must make a Dexterity saving throw. Creatures takes 8d8 slashing damage, or half as much damage on a successful save.\n\nA creature can move through the lines at the risk of cutting itself on the exposed edges. For every 1 foot a creature moves through the lines, it must spend 4 feet of movement. Furthermore, the first time a creature enters the lines on a turn or ends its turn there, the creature must make a Dexterity saving throw. It takes 8d8 slashing damage on a failure, or half as much damage on a success.\n\nWhen you stop concentrating on the spell, you can cause the obsidian spikes to explode, dealing 5d8 slashing damage to any creature within 15 feet, or half as much damage on a successful Dexterity save."
  },
  {
    "name": "Teleport",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "0 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "You teleport the targets instantly across vast distances. When you cast this spell, choose a destination. You must know the location you're teleporting to, and it must be on the same plane of existence.\n\nTeleportation is difficult magic and you may arrive off-target or somewhere else entirely depending on how familiar you are with the location you're teleporting to. When you teleport, the Narrator rolls 1d100 and consults Table: Teleport Familiarity.\n\nFamiliarity is determined as follows: Permanent Circle: A permanent teleportation circle whose sigil sequence you know (see teleportation circle).\n\nAssociated Object: You have an object taken from the target location within the last 6 months, such as a piece of wood from the pew in a grand temple or a pinch of grave dust from a vampire's hidden redoubt.\n\nVery Familiar: A place you have frequented, carefully studied, or can see at the time you cast the spell.\n\nSeen Casually: A place you have seen more than once but don't know well. This could be a castle you've passed by but never visited, or the farms you look down on from your tower of ivory.\n\nViewed Once: A place you have seen once, either in person or via magic.\n\nDescription: A place you only know from someone else's description (whether spoken, written, or even marked on a map).\n\nFalse Destination: A place that doesn't actually exist. This typically happens when someone deceives you, either intentionally (like a wizard creating an illusion to hide their actual tower) or unintentionally (such as when the location you attempt to teleport to no longer exists).\n\nYour arrival is determined as follows: On Target: You and your targets arrive exactly where you mean to.\n\nOff Target: You and your targets arrive some distance away from the target in a random direction. The further you travel, the further away you are likely to arrive. You arrive off target by a number of miles equal to 1d10 × 1d10 percent of the total distance of your trip.\n\nIf you tried to travel 1, 000 miles and roll a 2 and 4 on the d10s, you land 6 percent off target and arrive 60 miles away from your intended destination in a random direction. Roll 1d8 to randomly determine the direction: 1—north, 2 —northeast, 3 —east, 4 —southeast, 5—south, 6 —southwest, 7—west, 8—northwest.\n\nSimilar Location: You and your targets arrive in a different location that somehow resembles the target area. If you tried to teleport to your favorite inn, you might end up at a different inn, or in a room with much of the same decor.\n\nTypically you appear at the closest similar location, but that is not always the case.\n\nMishap: The spell's magic goes awry, and each teleporting creature or object takes 3d10 force damage. The Narrator rerolls on the table to determine where you arrive. When multiple mishaps occur targets take damage each time."
  },
  {
    "name": "Teleport",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "10 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "This spell instantly transports you and up to eight willing creatures of your choice that you can see within range, or a single object that you can see within range, to a destination you select. If you target an object, it must be able to fit entirely inside a 10-foot cube, and it can't be held or carried by an unwilling creature. The destination you choose must be known to you, and it must be on the same plane of existence as you. Your familiarity with the destination determines whether you arrive there successfully. The DM rolls d100 and consults the table.\n\n**Familiarity.** \"Permanent circle\" means a permanent teleportation circle whose sigil sequence you know. \"Associated object\" means that you possess an object taken from the desired destination within the last six months, such as a book from a wizard's library, bed linen from a royal suite, or a chunk of marble from a lich's secret tomb. \"Very familiar\" is a place you have been very often, a place you have carefully studied, or a place you can see when you cast the spell. \"Seen casually\" is someplace you have seen more than once but with which you aren't very familiar. \"Viewed once\" is a place you have seen once, possibly using magic. \"Description\" is a place whose location and appearance you know through someone else's description, perhaps from a map. \"False destination\" is a place that doesn't exist. Perhaps you tried to scry an enemy's sanctum but instead viewed an illusion, or you are attempting to teleport to a familiar location that no longer exists.\n\n**On Target.** You and your group (or the target object) appear where you want to.\n\n**Off Target.** You and your group (or the target object) appear a random distance away from the destination in a random direction. Distance off target is 1d10 × 1d10 percent of the distance that was to be traveled. For example, if you tried to travel 120 miles, landed off target, and rolled a 5 and 3 on the two d10s, then you would be off target by 15 percent, or 18 miles. The GM determines the direction off target randomly by rolling a d8 and designating 1 as north, 2 as northeast, 3 as east, and so on around the points of the compass. If you were teleporting to a coastal city and wound up 18 miles out at sea, you could be in trouble.\n\n**Similar Area.** You and your group (or the target object) wind up in a different area that's visually or thematically similar to the target area. If you are heading for your home laboratory, for example, you might wind up in another wizard's laboratory or in an alchemical supply shop that has many of the same tools and implements as your laboratory. Generally, you appear in the closest similar place, but since the spell has no range limit, you could conceivably wind up anywhere on the plane.\n\n**Mishap.** The spell's unpredictable magic results in a difficult journey. Each teleporting creature (or the target object) takes 3d10 force damage, and the GM rerolls on the table to see where you wind up (multiple mishaps can occur, dealing damage each time)."
  },
  {
    "name": "Timeless Engine",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "",
    "duration": "until dispelled",
    "description": "Deep Magic: clockwork You halt the normal processes of degradation and wear in a nonmagical clockwork device, making normal maintenance unnecessary and slowing fuel consumption to 1/10th of normal. For magical devices and constructs, the spell greatly reduces wear. A magical clockwork device, machine, or creature that normally needs daily maintenance only needs care once a year; if it previously needed monthly maintenance, it now requires attention only once a decade."
  },
  {
    "name": "Triumph of Ice",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "100 feet",
    "components": "M",
    "duration": "Concentration, up to 1 minute",
    "description": "You transform one of the four elements—air, earth, fire, or water—into ice or snow. The affected area is a sphere with a radius of 100 feet, centered on you. The specific effect depends on the element you choose.\n* ***Air.*** Vapor condenses into snowfall. If the effect of a [fog cloud](https://api.open5e.com/spells/fog-cloud) spell, a [stinking cloud](https://api.open5e.com/spells/stinking-cloud), or similar magic is in the area, this spell negates it. A creature of elemental air within range takes 8d6 cold damage—and, if airborne, it must make a successful Constitution saving throw at the start of its turn to avoid being knocked prone (no falling damage).\n* ***Earth.*** Soil freezes into permafrost to a depth of 10 feet. A creature burrowing through the area has its speed halved until the area thaws, unless it can burrow through solid rock. A creature of elemental earth within range must make a successful Constitution saving throw or take 8d6 cold damage.\n* ***Fire.*** Flames or other sources of extreme heat (such as molten lava) on the ground within range transform into shards of ice, and the area they occupy becomes difficult terrain. Each creature in the previously burning area takes 2d6 slashing damage when the spell is cast and 1d6 slashing damage for every 5 feet it moves in the area (unless it is not hindered by icy terrain) until the spell ends; a successful Dexterity saving throw reduces the slashing damage by half. A creature of elemental fire within range must make a successful Constitution saving throw or take 8d6 cold damage and be stunned for 1d6 rounds.\n* ***Water.*** Open water (a pond, lake, or river) freezes to a depth of 4 feet. A creature on the surface of the water when it freezes must make a successful Dexterity saving throw to avoid being trapped in the ice. A trapped creature can free itself by using an action to make a successful Strength (Athletics) check. A creature of elemental water within range takes no damage from the spell but is paralyzed for 1d6 rounds unless it makes a successful Constitution saving throw, and it treats the affected area as difficult terrain."
  },
  {
    "name": "Uncontrollable Transformation",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "1 hour",
    "description": "You infuse your body with raw chaos and will it to adopt a helpful mutation. Roll a d10 and consult the Uncontrollable Transformation table below to determine what mutation occurs. You can try to control the shifting of your body to gain a mutation you prefer, but doing so is taxing; you can roll a d10 twice and choose the result you prefer, but you gain one level of exhaustion. At the end of the spell, your body returns to its normal form."
  },
  {
    "name": "Unholy Star",
    "level": 7,
    "school": "Conjuration",
    "casting_time": "1 action",
    "range": "120 feet",
    "components": "",
    "duration": "instantaneous",
    "description": "A meteor ripped from diabolical skies streaks through the air and explodes at a point you can see 100 feet directly above you. The spell fails if you can't see the point where the meteor explodes.\n\nEach creature within range that can see the meteor (other than you) makes a Dexterity saving throw or is blinded until the end of your next turn. Fiery chunks of the meteor then plummet to the ground at different areas you choose within range. Each creature in an area makes a Dexterity saving throw, taking 6d6 fire damage and 6d6 necrotic damage on a failed save, or half as much damage on a successful one. A creature in more than one area is affected only once.\n\nThe spell damages objects in the area and ignites flammable objects that aren't being worn or carried."
  },
  {
    "name": "Volley Shield",
    "level": 7,
    "school": "Abjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "components": "",
    "duration": "Concentration, up to 1 minute",
    "description": "You touch a willing creature and create a shimmering shield of energy to protect it. The shield grants the target a +5 bonus to AC and gives it resistance against nonmagical bludgeoning, piercing, and slashing damage for the duration of the spell.\n\nIn addition, the shield can reflect hostile spells back at their casters. When the target makes a successful saving throw against a hostile spell, the caster of the spell immediately becomes the spell’s new target. The caster is entitled to the appropriate saving throw against the returned spell, if any, and is affected by the spell as if it came from a spellcaster of the caster’s level."
  },
  {
    "name": "Walking Wall",
    "level": 7,
    "school": "Transmutation",
    "casting_time": "1 action",
    "range": "30 feet",
    "components": "M",
    "duration": "Concentration, up to 10 minutes",
    "description": "This spell creates a wall of swinging axes from the pile of miniature axes you provide when casting the spell. The wall fills a rectangle 10 feet wide, 10 feet high, and 20 feet long. The wall has a base speed of 50 feet, but it can’t take the Dash action. It can make up to four attacks per round on your turn, using your spell attack modifier to hit and with a reach of 10 feet. You direct the wall’s movement and attacks as a bonus action. If you choose not to direct it, the wall continues trying to execute the last command you gave it. The wall can’t use reactions. Each successful attack deals 4d6 slashing damage, and the damage is considered magical.\n\nThe wall has AC 12 and 200 hit points, and is immune to necrotic, poison, psychic, and piercing damage. If it is reduced to 0 hit points or when the spell’s duration ends, the wall disappears and the miniature axes fall to the ground in a tidy heap."
  },
  {
    "name": "Wild Hunt",
    "level": 7,
    "school": "Enchantment",
    "casting_time": "1 hour",
    "range": "30 feet",
    "components": "M",
    "duration": "24 hours",
    "description": "While casting this spell, you must chant and drum, calling forth the spirit of the hunt. Up to nine other creatures can join you in the chant.\n  For the duration, each creature that participated in the chant is filled with the fervent bloodlust of the wild hunt and gains several benefits. The creature is immune to being charmed and frightened, it deals one extra die of damage on the first weapon or spell attack it makes on each of its turns, it has advantage on Strength or Dexterity saving throws (the creature's choice), and its Armor Class increases by 1.\n  When this spell ends, a creature affected by it suffers one level of exhaustion."
  },
  {
    "name": "Zymurgic Aura",
    "level": 7,
    "school": "Necromancy",
    "casting_time": "1 action",
    "range": "Self",
    "components": "M",
    "duration": "instantaneous",
    "description": "A wave of putrefaction surges from you, targeting creatures of your choice within a 30-foot radius around you, speeding the rate of decay in those it touches. The target must make a Constitution saving throw. It takes 10d6 necrotic damage on a failed save or half as much on a successful save. Its hit point maximum is reduced by an amount equal to the damage taken. This reduction lasts until the creature takes a long rest."
  }
]